luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  1000, Message Object  Function Control Register */
#define CAN_MO0_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019000u)

/** Alias (User Manual Name) for CAN_MO0_EDATA0.
* To use register names with standard convension, please use CAN_MO0_EDATA0.
*/
#define	CAN_EMO0DATA0	(CAN_MO0_EDATA0)

/** \brief  1004, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO0_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019004u)

/** Alias (User Manual Name) for CAN_MO0_EDATA1.
* To use register names with standard convension, please use CAN_MO0_EDATA1.
*/
#define	CAN_EMO0DATA1	(CAN_MO0_EDATA1)

/** \brief  1008, Message Object  Interrupt Pointer Register */
#define CAN_MO0_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019008u)

/** Alias (User Manual Name) for CAN_MO0_EDATA2.
* To use register names with standard convension, please use CAN_MO0_EDATA2.
*/
#define	CAN_EMO0DATA2	(CAN_MO0_EDATA2)

/** \brief  100C, Message Object  Acceptance Mask Register */
#define CAN_MO0_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001900Cu)

/** Alias (User Manual Name) for CAN_MO0_EDATA3.
* To use register names with standard convension, please use CAN_MO0_EDATA3.
*/
#define	CAN_EMO0DATA3	(CAN_MO0_EDATA3)

/** \brief  1010, Message Object  Data Register Low */
#define CAN_MO0_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019010u)

/** Alias (User Manual Name) for CAN_MO0_EDATA4.
* To use register names with standard convension, please use CAN_MO0_EDATA4.
*/
#define	CAN_EMO0DATA4	(CAN_MO0_EDATA4)

/** \brief  1014, Message Object  Data Register High */
#define CAN_MO0_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019014u)

/** Alias (User Manual Name) for CAN_MO0_EDATA5.
* To use register names with standard convension, please use CAN_MO0_EDATA5.
*/
#define	CAN_EMO0DATA5	(CAN_MO0_EDATA5)

/** \brief  1018, Message Object  Arbitration Register */
#define CAN_MO0_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019018u)

/** Alias (User Manual Name) for CAN_MO0_EDATA6.
* To use register names with standard convension, please use CAN_MO0_EDATA6.
*/
#define	CAN_EMO0DATA6	(CAN_MO0_EDATA6)

/** \brief  1000, Message Object  Function Control Register */
#define CAN_MO0_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019000u)

/** Alias (User Manual Name) for CAN_MO0_FCR.
* To use register names with standard convension, please use CAN_MO0_FCR.
*/
#define	CAN_MOFCR0	(CAN_MO0_FCR)

/** \brief  1004, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO0_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019004u)

/** Alias (User Manual Name) for CAN_MO0_FGPR.
* To use register names with standard convension, please use CAN_MO0_FGPR.
*/
#define	CAN_MOFGPR0	(CAN_MO0_FGPR)

/** \brief  1008, Message Object  Interrupt Pointer Register */
#define CAN_MO0_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019008u)

/** Alias (User Manual Name) for CAN_MO0_IPR.
* To use register names with standard convension, please use CAN_MO0_IPR.
*/
#define	CAN_MOIPR0	(CAN_MO0_IPR)

/** \brief  101C, Message Object  Control Register */
#define CAN_MO0_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001901Cu)

/** Alias (User Manual Name) for CAN_MO0_STAT.
* To use register names with standard convension, please use CAN_MO0_STAT.
*/
#define	CAN_MOSTAT0	(CAN_MO0_STAT)

/** \brief  1C8C, Message Object  Acceptance Mask Register */
#define CAN_MO100_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019C8Cu)

/** Alias (User Manual Name) for CAN_MO100_AMR.
* To use register names with standard convension, please use CAN_MO100_AMR.
*/
#define	CAN_MOAMR100	(CAN_MO100_AMR)

/** \brief  1C98, Message Object  Arbitration Register */
#define CAN_MO100_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019C98u)

/** Alias (User Manual Name) for CAN_MO100_AR.
* To use register names with standard convension, please use CAN_MO100_AR.
*/
#define	CAN_MOAR100	(CAN_MO100_AR)

/** \brief  1C9C, Message Object  Control Register */
#define CAN_MO100_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019C9Cu)

/** Alias (User Manual Name) for CAN_MO100_CTR.
* To use register names with standard convension, please use CAN_MO100_CTR.
*/
#define	CAN_MOCTR100	(CAN_MO100_CTR)

/** \brief  1C94, Message Object  Data Register High */
#define CAN_MO100_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019C94u)

/** Alias (User Manual Name) for CAN_MO100_DATAH.
* To use register names with standard convension, please use CAN_MO100_DATAH.
*/
#define	CAN_MODATAH100	(CAN_MO100_DATAH)

/** \brief  1C90, Message Object  Data Register Low */
#define CAN_MO100_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019C90u)

/** Alias (User Manual Name) for CAN_MO100_DATAL.
* To use register names with standard convension, please use CAN_MO100_DATAL.
*/
#define	CAN_MODATAL100	(CAN_MO100_DATAL)

/** \brief  1C80, Message Object  Function Control Register */
#define CAN_MO100_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019C80u)

/** Alias (User Manual Name) for CAN_MO100_EDATA0.
* To use register names with standard convension, please use CAN_MO100_EDATA0.
*/
#define	CAN_EMO100DATA0	(CAN_MO100_EDATA0)

/** \brief  1C84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO100_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019C84u)

/** Alias (User Manual Name) for CAN_MO100_EDATA1.
* To use register names with standard convension, please use CAN_MO100_EDATA1.
*/
#define	CAN_EMO100DATA1	(CAN_MO100_EDATA1)

/** \brief  1C88, Message Object  Interrupt Pointer Register */
#define CAN_MO100_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019C88u)

/** Alias (User Manual Name) for CAN_MO100_EDATA2.
* To use register names with standard convension, please use CAN_MO100_EDATA2.
*/
#define	CAN_EMO100DATA2	(CAN_MO100_EDATA2)

/** \brief  1C8C, Message Object  Acceptance Mask Register */
#define CAN_MO100_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019C8Cu)

/** Alias (User Manual Name) for CAN_MO100_EDATA3.
* To use register names with standard convension, please use CAN_MO100_EDATA3.
*/
#define	CAN_EMO100DATA3	(CAN_MO100_EDATA3)

/** \brief  1C90, Message Object  Data Register Low */
#define CAN_MO100_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019C90u)

/** Alias (User Manual Name) for CAN_MO100_EDATA4.
* To use register names with standard convension, please use CAN_MO100_EDATA4.
*/
#define	CAN_EMO100DATA4	(CAN_MO100_EDATA4)

