luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO104_EDATA2.
* To use register names with standard convension, please use CAN_MO104_EDATA2.
*/
#define	CAN_EMO104DATA2	(CAN_MO104_EDATA2)

/** \brief  1D0C, Message Object  Acceptance Mask Register */
#define CAN_MO104_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019D0Cu)

/** Alias (User Manual Name) for CAN_MO104_EDATA3.
* To use register names with standard convension, please use CAN_MO104_EDATA3.
*/
#define	CAN_EMO104DATA3	(CAN_MO104_EDATA3)

/** \brief  1D10, Message Object  Data Register Low */
#define CAN_MO104_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019D10u)

/** Alias (User Manual Name) for CAN_MO104_EDATA4.
* To use register names with standard convension, please use CAN_MO104_EDATA4.
*/
#define	CAN_EMO104DATA4	(CAN_MO104_EDATA4)

/** \brief  1D14, Message Object  Data Register High */
#define CAN_MO104_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019D14u)

/** Alias (User Manual Name) for CAN_MO104_EDATA5.
* To use register names with standard convension, please use CAN_MO104_EDATA5.
*/
#define	CAN_EMO104DATA5	(CAN_MO104_EDATA5)

/** \brief  1D18, Message Object  Arbitration Register */
#define CAN_MO104_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019D18u)

/** Alias (User Manual Name) for CAN_MO104_EDATA6.
* To use register names with standard convension, please use CAN_MO104_EDATA6.
*/
#define	CAN_EMO104DATA6	(CAN_MO104_EDATA6)

/** \brief  1D00, Message Object  Function Control Register */
#define CAN_MO104_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019D00u)

/** Alias (User Manual Name) for CAN_MO104_FCR.
* To use register names with standard convension, please use CAN_MO104_FCR.
*/
#define	CAN_MOFCR104	(CAN_MO104_FCR)

/** \brief  1D04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO104_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019D04u)

/** Alias (User Manual Name) for CAN_MO104_FGPR.
* To use register names with standard convension, please use CAN_MO104_FGPR.
*/
#define	CAN_MOFGPR104	(CAN_MO104_FGPR)

/** \brief  1D08, Message Object  Interrupt Pointer Register */
#define CAN_MO104_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019D08u)

/** Alias (User Manual Name) for CAN_MO104_IPR.
* To use register names with standard convension, please use CAN_MO104_IPR.
*/
#define	CAN_MOIPR104	(CAN_MO104_IPR)

/** \brief  1D1C, Message Object  Control Register */
#define CAN_MO104_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019D1Cu)

/** Alias (User Manual Name) for CAN_MO104_STAT.
* To use register names with standard convension, please use CAN_MO104_STAT.
*/
#define	CAN_MOSTAT104	(CAN_MO104_STAT)

/** \brief  1D2C, Message Object  Acceptance Mask Register */
#define CAN_MO105_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019D2Cu)

/** Alias (User Manual Name) for CAN_MO105_AMR.
* To use register names with standard convension, please use CAN_MO105_AMR.
*/
#define	CAN_MOAMR105	(CAN_MO105_AMR)

/** \brief  1D38, Message Object  Arbitration Register */
#define CAN_MO105_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019D38u)

/** Alias (User Manual Name) for CAN_MO105_AR.
* To use register names with standard convension, please use CAN_MO105_AR.
*/
#define	CAN_MOAR105	(CAN_MO105_AR)

/** \brief  1D3C, Message Object  Control Register */
#define CAN_MO105_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019D3Cu)

/** Alias (User Manual Name) for CAN_MO105_CTR.
* To use register names with standard convension, please use CAN_MO105_CTR.
*/
#define	CAN_MOCTR105	(CAN_MO105_CTR)

/** \brief  1D34, Message Object  Data Register High */
#define CAN_MO105_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019D34u)

/** Alias (User Manual Name) for CAN_MO105_DATAH.
* To use register names with standard convension, please use CAN_MO105_DATAH.
*/
#define	CAN_MODATAH105	(CAN_MO105_DATAH)

/** \brief  1D30, Message Object  Data Register Low */
#define CAN_MO105_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019D30u)

/** Alias (User Manual Name) for CAN_MO105_DATAL.
* To use register names with standard convension, please use CAN_MO105_DATAL.
*/
#define	CAN_MODATAL105	(CAN_MO105_DATAL)

/** \brief  1D20, Message Object  Function Control Register */
#define CAN_MO105_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019D20u)

/** Alias (User Manual Name) for CAN_MO105_EDATA0.
* To use register names with standard convension, please use CAN_MO105_EDATA0.
*/
#define	CAN_EMO105DATA0	(CAN_MO105_EDATA0)

/** \brief  1D24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO105_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019D24u)

/** Alias (User Manual Name) for CAN_MO105_EDATA1.
* To use register names with standard convension, please use CAN_MO105_EDATA1.
*/
#define	CAN_EMO105DATA1	(CAN_MO105_EDATA1)

/** \brief  1D28, Message Object  Interrupt Pointer Register */
#define CAN_MO105_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019D28u)

/** Alias (User Manual Name) for CAN_MO105_EDATA2.
* To use register names with standard convension, please use CAN_MO105_EDATA2.
*/
#define	CAN_EMO105DATA2	(CAN_MO105_EDATA2)

/** \brief  1D2C, Message Object  Acceptance Mask Register */
#define CAN_MO105_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019D2Cu)

/** Alias (User Manual Name) for CAN_MO105_EDATA3.
* To use register names with standard convension, please use CAN_MO105_EDATA3.
*/
#define	CAN_EMO105DATA3	(CAN_MO105_EDATA3)

/** \brief  1D30, Message Object  Data Register Low */
#define CAN_MO105_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019D30u)

/** Alias (User Manual Name) for CAN_MO105_EDATA4.
* To use register names with standard convension, please use CAN_MO105_EDATA4.
*/
#define	CAN_EMO105DATA4	(CAN_MO105_EDATA4)

/** \brief  1D34, Message Object  Data Register High */
#define CAN_MO105_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019D34u)

