luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO105_EDATA5.
* To use register names with standard convension, please use CAN_MO105_EDATA5.
*/
#define	CAN_EMO105DATA5	(CAN_MO105_EDATA5)

/** \brief  1D38, Message Object  Arbitration Register */
#define CAN_MO105_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019D38u)

/** Alias (User Manual Name) for CAN_MO105_EDATA6.
* To use register names with standard convension, please use CAN_MO105_EDATA6.
*/
#define	CAN_EMO105DATA6	(CAN_MO105_EDATA6)

/** \brief  1D20, Message Object  Function Control Register */
#define CAN_MO105_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019D20u)

/** Alias (User Manual Name) for CAN_MO105_FCR.
* To use register names with standard convension, please use CAN_MO105_FCR.
*/
#define	CAN_MOFCR105	(CAN_MO105_FCR)

/** \brief  1D24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO105_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019D24u)

/** Alias (User Manual Name) for CAN_MO105_FGPR.
* To use register names with standard convension, please use CAN_MO105_FGPR.
*/
#define	CAN_MOFGPR105	(CAN_MO105_FGPR)

/** \brief  1D28, Message Object  Interrupt Pointer Register */
#define CAN_MO105_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019D28u)

/** Alias (User Manual Name) for CAN_MO105_IPR.
* To use register names with standard convension, please use CAN_MO105_IPR.
*/
#define	CAN_MOIPR105	(CAN_MO105_IPR)

/** \brief  1D3C, Message Object  Control Register */
#define CAN_MO105_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019D3Cu)

/** Alias (User Manual Name) for CAN_MO105_STAT.
* To use register names with standard convension, please use CAN_MO105_STAT.
*/
#define	CAN_MOSTAT105	(CAN_MO105_STAT)

/** \brief  1D4C, Message Object  Acceptance Mask Register */
#define CAN_MO106_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019D4Cu)

/** Alias (User Manual Name) for CAN_MO106_AMR.
* To use register names with standard convension, please use CAN_MO106_AMR.
*/
#define	CAN_MOAMR106	(CAN_MO106_AMR)

/** \brief  1D58, Message Object  Arbitration Register */
#define CAN_MO106_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019D58u)

/** Alias (User Manual Name) for CAN_MO106_AR.
* To use register names with standard convension, please use CAN_MO106_AR.
*/
#define	CAN_MOAR106	(CAN_MO106_AR)

/** \brief  1D5C, Message Object  Control Register */
#define CAN_MO106_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019D5Cu)

/** Alias (User Manual Name) for CAN_MO106_CTR.
* To use register names with standard convension, please use CAN_MO106_CTR.
*/
#define	CAN_MOCTR106	(CAN_MO106_CTR)

/** \brief  1D54, Message Object  Data Register High */
#define CAN_MO106_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019D54u)

/** Alias (User Manual Name) for CAN_MO106_DATAH.
* To use register names with standard convension, please use CAN_MO106_DATAH.
*/
#define	CAN_MODATAH106	(CAN_MO106_DATAH)

/** \brief  1D50, Message Object  Data Register Low */
#define CAN_MO106_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019D50u)

/** Alias (User Manual Name) for CAN_MO106_DATAL.
* To use register names with standard convension, please use CAN_MO106_DATAL.
*/
#define	CAN_MODATAL106	(CAN_MO106_DATAL)

/** \brief  1D40, Message Object  Function Control Register */
#define CAN_MO106_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019D40u)

/** Alias (User Manual Name) for CAN_MO106_EDATA0.
* To use register names with standard convension, please use CAN_MO106_EDATA0.
*/
#define	CAN_EMO106DATA0	(CAN_MO106_EDATA0)

/** \brief  1D44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO106_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019D44u)

/** Alias (User Manual Name) for CAN_MO106_EDATA1.
* To use register names with standard convension, please use CAN_MO106_EDATA1.
*/
#define	CAN_EMO106DATA1	(CAN_MO106_EDATA1)

/** \brief  1D48, Message Object  Interrupt Pointer Register */
#define CAN_MO106_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019D48u)

/** Alias (User Manual Name) for CAN_MO106_EDATA2.
* To use register names with standard convension, please use CAN_MO106_EDATA2.
*/
#define	CAN_EMO106DATA2	(CAN_MO106_EDATA2)

/** \brief  1D4C, Message Object  Acceptance Mask Register */
#define CAN_MO106_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019D4Cu)

/** Alias (User Manual Name) for CAN_MO106_EDATA3.
* To use register names with standard convension, please use CAN_MO106_EDATA3.
*/
#define	CAN_EMO106DATA3	(CAN_MO106_EDATA3)

/** \brief  1D50, Message Object  Data Register Low */
#define CAN_MO106_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019D50u)

/** Alias (User Manual Name) for CAN_MO106_EDATA4.
* To use register names with standard convension, please use CAN_MO106_EDATA4.
*/
#define	CAN_EMO106DATA4	(CAN_MO106_EDATA4)

/** \brief  1D54, Message Object  Data Register High */
#define CAN_MO106_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019D54u)

/** Alias (User Manual Name) for CAN_MO106_EDATA5.
* To use register names with standard convension, please use CAN_MO106_EDATA5.
*/
#define	CAN_EMO106DATA5	(CAN_MO106_EDATA5)

/** \brief  1D58, Message Object  Arbitration Register */
#define CAN_MO106_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019D58u)

/** Alias (User Manual Name) for CAN_MO106_EDATA6.
* To use register names with standard convension, please use CAN_MO106_EDATA6.
*/
#define	CAN_EMO106DATA6	(CAN_MO106_EDATA6)

/** \brief  1D40, Message Object  Function Control Register */
#define CAN_MO106_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019D40u)

/** Alias (User Manual Name) for CAN_MO106_FCR.
* To use register names with standard convension, please use CAN_MO106_FCR.
*/
#define	CAN_MOFCR106	(CAN_MO106_FCR)

/** \brief  1D44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO106_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019D44u)

/** Alias (User Manual Name) for CAN_MO106_FGPR.
* To use register names with standard convension, please use CAN_MO106_FGPR.
*/
#define	CAN_MOFGPR106	(CAN_MO106_FGPR)

/** \brief  1D48, Message Object  Interrupt Pointer Register */
#define CAN_MO106_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019D48u)

/** Alias (User Manual Name) for CAN_MO106_IPR.
* To use register names with standard convension, please use CAN_MO106_IPR.
*/
#define	CAN_MOIPR106	(CAN_MO106_IPR)

/** \brief  1D5C, Message Object  Control Register */
#define CAN_MO106_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019D5Cu)

