luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO110_STAT.
* To use register names with standard convension, please use CAN_MO110_STAT.
*/
#define	CAN_MOSTAT110	(CAN_MO110_STAT)

/** \brief  1DEC, Message Object  Acceptance Mask Register */
#define CAN_MO111_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019DECu)

/** Alias (User Manual Name) for CAN_MO111_AMR.
* To use register names with standard convension, please use CAN_MO111_AMR.
*/
#define	CAN_MOAMR111	(CAN_MO111_AMR)

/** \brief  1DF8, Message Object  Arbitration Register */
#define CAN_MO111_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019DF8u)

/** Alias (User Manual Name) for CAN_MO111_AR.
* To use register names with standard convension, please use CAN_MO111_AR.
*/
#define	CAN_MOAR111	(CAN_MO111_AR)

/** \brief  1DFC, Message Object  Control Register */
#define CAN_MO111_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019DFCu)

/** Alias (User Manual Name) for CAN_MO111_CTR.
* To use register names with standard convension, please use CAN_MO111_CTR.
*/
#define	CAN_MOCTR111	(CAN_MO111_CTR)

/** \brief  1DF4, Message Object  Data Register High */
#define CAN_MO111_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019DF4u)

/** Alias (User Manual Name) for CAN_MO111_DATAH.
* To use register names with standard convension, please use CAN_MO111_DATAH.
*/
#define	CAN_MODATAH111	(CAN_MO111_DATAH)

/** \brief  1DF0, Message Object  Data Register Low */
#define CAN_MO111_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019DF0u)

/** Alias (User Manual Name) for CAN_MO111_DATAL.
* To use register names with standard convension, please use CAN_MO111_DATAL.
*/
#define	CAN_MODATAL111	(CAN_MO111_DATAL)

/** \brief  1DE0, Message Object  Function Control Register */
#define CAN_MO111_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019DE0u)

/** Alias (User Manual Name) for CAN_MO111_EDATA0.
* To use register names with standard convension, please use CAN_MO111_EDATA0.
*/
#define	CAN_EMO111DATA0	(CAN_MO111_EDATA0)

/** \brief  1DE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO111_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019DE4u)

/** Alias (User Manual Name) for CAN_MO111_EDATA1.
* To use register names with standard convension, please use CAN_MO111_EDATA1.
*/
#define	CAN_EMO111DATA1	(CAN_MO111_EDATA1)

/** \brief  1DE8, Message Object  Interrupt Pointer Register */
#define CAN_MO111_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019DE8u)

/** Alias (User Manual Name) for CAN_MO111_EDATA2.
* To use register names with standard convension, please use CAN_MO111_EDATA2.
*/
#define	CAN_EMO111DATA2	(CAN_MO111_EDATA2)

/** \brief  1DEC, Message Object  Acceptance Mask Register */
#define CAN_MO111_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019DECu)

/** Alias (User Manual Name) for CAN_MO111_EDATA3.
* To use register names with standard convension, please use CAN_MO111_EDATA3.
*/
#define	CAN_EMO111DATA3	(CAN_MO111_EDATA3)

/** \brief  1DF0, Message Object  Data Register Low */
#define CAN_MO111_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019DF0u)

/** Alias (User Manual Name) for CAN_MO111_EDATA4.
* To use register names with standard convension, please use CAN_MO111_EDATA4.
*/
#define	CAN_EMO111DATA4	(CAN_MO111_EDATA4)

/** \brief  1DF4, Message Object  Data Register High */
#define CAN_MO111_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019DF4u)

/** Alias (User Manual Name) for CAN_MO111_EDATA5.
* To use register names with standard convension, please use CAN_MO111_EDATA5.
*/
#define	CAN_EMO111DATA5	(CAN_MO111_EDATA5)

/** \brief  1DF8, Message Object  Arbitration Register */
#define CAN_MO111_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019DF8u)

/** Alias (User Manual Name) for CAN_MO111_EDATA6.
* To use register names with standard convension, please use CAN_MO111_EDATA6.
*/
#define	CAN_EMO111DATA6	(CAN_MO111_EDATA6)

/** \brief  1DE0, Message Object  Function Control Register */
#define CAN_MO111_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019DE0u)

/** Alias (User Manual Name) for CAN_MO111_FCR.
* To use register names with standard convension, please use CAN_MO111_FCR.
*/
#define	CAN_MOFCR111	(CAN_MO111_FCR)

/** \brief  1DE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO111_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019DE4u)

/** Alias (User Manual Name) for CAN_MO111_FGPR.
* To use register names with standard convension, please use CAN_MO111_FGPR.
*/
#define	CAN_MOFGPR111	(CAN_MO111_FGPR)

/** \brief  1DE8, Message Object  Interrupt Pointer Register */
#define CAN_MO111_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019DE8u)

/** Alias (User Manual Name) for CAN_MO111_IPR.
* To use register names with standard convension, please use CAN_MO111_IPR.
*/
#define	CAN_MOIPR111	(CAN_MO111_IPR)

/** \brief  1DFC, Message Object  Control Register */
#define CAN_MO111_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019DFCu)

/** Alias (User Manual Name) for CAN_MO111_STAT.
* To use register names with standard convension, please use CAN_MO111_STAT.
*/
#define	CAN_MOSTAT111	(CAN_MO111_STAT)

/** \brief  1E0C, Message Object  Acceptance Mask Register */
#define CAN_MO112_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019E0Cu)

/** Alias (User Manual Name) for CAN_MO112_AMR.
* To use register names with standard convension, please use CAN_MO112_AMR.
*/
#define	CAN_MOAMR112	(CAN_MO112_AMR)

/** \brief  1E18, Message Object  Arbitration Register */
#define CAN_MO112_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019E18u)

/** Alias (User Manual Name) for CAN_MO112_AR.
* To use register names with standard convension, please use CAN_MO112_AR.
*/
#define	CAN_MOAR112	(CAN_MO112_AR)

/** \brief  1E1C, Message Object  Control Register */
#define CAN_MO112_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019E1Cu)

/** Alias (User Manual Name) for CAN_MO112_CTR.
* To use register names with standard convension, please use CAN_MO112_CTR.
*/
#define	CAN_MOCTR112	(CAN_MO112_CTR)

/** \brief  1E14, Message Object  Data Register High */
#define CAN_MO112_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019E14u)

/** Alias (User Manual Name) for CAN_MO112_DATAH.
* To use register names with standard convension, please use CAN_MO112_DATAH.
*/
#define	CAN_MODATAH112	(CAN_MO112_DATAH)

/** \brief  1E10, Message Object  Data Register Low */
#define CAN_MO112_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019E10u)

/** Alias (User Manual Name) for CAN_MO112_DATAL.
* To use register names with standard convension, please use CAN_MO112_DATAL.
*/
#define	CAN_MODATAL112	(CAN_MO112_DATAL)

/** \brief  1E00, Message Object  Function Control Register */
#define CAN_MO112_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019E00u)

/** Alias (User Manual Name) for CAN_MO112_EDATA0.
* To use register names with standard convension, please use CAN_MO112_EDATA0.
*/
#define	CAN_EMO112DATA0	(CAN_MO112_EDATA0)

/** \brief  1E04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO112_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019E04u)

/** Alias (User Manual Name) for CAN_MO112_EDATA1.
* To use register names with standard convension, please use CAN_MO112_EDATA1.
*/
#define	CAN_EMO112DATA1	(CAN_MO112_EDATA1)

