luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  1E08, Message Object  Interrupt Pointer Register */
#define CAN_MO112_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019E08u)

/** Alias (User Manual Name) for CAN_MO112_EDATA2.
* To use register names with standard convension, please use CAN_MO112_EDATA2.
*/
#define	CAN_EMO112DATA2	(CAN_MO112_EDATA2)

/** \brief  1E0C, Message Object  Acceptance Mask Register */
#define CAN_MO112_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019E0Cu)

/** Alias (User Manual Name) for CAN_MO112_EDATA3.
* To use register names with standard convension, please use CAN_MO112_EDATA3.
*/
#define	CAN_EMO112DATA3	(CAN_MO112_EDATA3)

/** \brief  1E10, Message Object  Data Register Low */
#define CAN_MO112_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019E10u)

/** Alias (User Manual Name) for CAN_MO112_EDATA4.
* To use register names with standard convension, please use CAN_MO112_EDATA4.
*/
#define	CAN_EMO112DATA4	(CAN_MO112_EDATA4)

/** \brief  1E14, Message Object  Data Register High */
#define CAN_MO112_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019E14u)

/** Alias (User Manual Name) for CAN_MO112_EDATA5.
* To use register names with standard convension, please use CAN_MO112_EDATA5.
*/
#define	CAN_EMO112DATA5	(CAN_MO112_EDATA5)

/** \brief  1E18, Message Object  Arbitration Register */
#define CAN_MO112_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019E18u)

/** Alias (User Manual Name) for CAN_MO112_EDATA6.
* To use register names with standard convension, please use CAN_MO112_EDATA6.
*/
#define	CAN_EMO112DATA6	(CAN_MO112_EDATA6)

/** \brief  1E00, Message Object  Function Control Register */
#define CAN_MO112_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019E00u)

/** Alias (User Manual Name) for CAN_MO112_FCR.
* To use register names with standard convension, please use CAN_MO112_FCR.
*/
#define	CAN_MOFCR112	(CAN_MO112_FCR)

/** \brief  1E04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO112_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019E04u)

/** Alias (User Manual Name) for CAN_MO112_FGPR.
* To use register names with standard convension, please use CAN_MO112_FGPR.
*/
#define	CAN_MOFGPR112	(CAN_MO112_FGPR)

/** \brief  1E08, Message Object  Interrupt Pointer Register */
#define CAN_MO112_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019E08u)

/** Alias (User Manual Name) for CAN_MO112_IPR.
* To use register names with standard convension, please use CAN_MO112_IPR.
*/
#define	CAN_MOIPR112	(CAN_MO112_IPR)

/** \brief  1E1C, Message Object  Control Register */
#define CAN_MO112_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019E1Cu)

/** Alias (User Manual Name) for CAN_MO112_STAT.
* To use register names with standard convension, please use CAN_MO112_STAT.
*/
#define	CAN_MOSTAT112	(CAN_MO112_STAT)

/** \brief  1E2C, Message Object  Acceptance Mask Register */
#define CAN_MO113_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019E2Cu)

/** Alias (User Manual Name) for CAN_MO113_AMR.
* To use register names with standard convension, please use CAN_MO113_AMR.
*/
#define	CAN_MOAMR113	(CAN_MO113_AMR)

/** \brief  1E38, Message Object  Arbitration Register */
#define CAN_MO113_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019E38u)

/** Alias (User Manual Name) for CAN_MO113_AR.
* To use register names with standard convension, please use CAN_MO113_AR.
*/
#define	CAN_MOAR113	(CAN_MO113_AR)

/** \brief  1E3C, Message Object  Control Register */
#define CAN_MO113_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019E3Cu)

/** Alias (User Manual Name) for CAN_MO113_CTR.
* To use register names with standard convension, please use CAN_MO113_CTR.
*/
#define	CAN_MOCTR113	(CAN_MO113_CTR)

/** \brief  1E34, Message Object  Data Register High */
#define CAN_MO113_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019E34u)

/** Alias (User Manual Name) for CAN_MO113_DATAH.
* To use register names with standard convension, please use CAN_MO113_DATAH.
*/
#define	CAN_MODATAH113	(CAN_MO113_DATAH)

/** \brief  1E30, Message Object  Data Register Low */
#define CAN_MO113_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019E30u)

/** Alias (User Manual Name) for CAN_MO113_DATAL.
* To use register names with standard convension, please use CAN_MO113_DATAL.
*/
#define	CAN_MODATAL113	(CAN_MO113_DATAL)

/** \brief  1E20, Message Object  Function Control Register */
#define CAN_MO113_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019E20u)

/** Alias (User Manual Name) for CAN_MO113_EDATA0.
* To use register names with standard convension, please use CAN_MO113_EDATA0.
*/
#define	CAN_EMO113DATA0	(CAN_MO113_EDATA0)

/** \brief  1E24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO113_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019E24u)

/** Alias (User Manual Name) for CAN_MO113_EDATA1.
* To use register names with standard convension, please use CAN_MO113_EDATA1.
*/
#define	CAN_EMO113DATA1	(CAN_MO113_EDATA1)

/** \brief  1E28, Message Object  Interrupt Pointer Register */
#define CAN_MO113_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019E28u)

/** Alias (User Manual Name) for CAN_MO113_EDATA2.
* To use register names with standard convension, please use CAN_MO113_EDATA2.
*/
#define	CAN_EMO113DATA2	(CAN_MO113_EDATA2)

/** \brief  1E2C, Message Object  Acceptance Mask Register */
#define CAN_MO113_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019E2Cu)

/** Alias (User Manual Name) for CAN_MO113_EDATA3.
* To use register names with standard convension, please use CAN_MO113_EDATA3.
*/
#define	CAN_EMO113DATA3	(CAN_MO113_EDATA3)

/** \brief  1E30, Message Object  Data Register Low */
#define CAN_MO113_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019E30u)

/** Alias (User Manual Name) for CAN_MO113_EDATA4.
* To use register names with standard convension, please use CAN_MO113_EDATA4.
*/
#define	CAN_EMO113DATA4	(CAN_MO113_EDATA4)

/** \brief  1E34, Message Object  Data Register High */
#define CAN_MO113_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019E34u)

