luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  1E6C, Message Object  Acceptance Mask Register */
#define CAN_MO115_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019E6Cu)

/** Alias (User Manual Name) for CAN_MO115_AMR.
* To use register names with standard convension, please use CAN_MO115_AMR.
*/
#define	CAN_MOAMR115	(CAN_MO115_AMR)

/** \brief  1E78, Message Object  Arbitration Register */
#define CAN_MO115_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019E78u)

/** Alias (User Manual Name) for CAN_MO115_AR.
* To use register names with standard convension, please use CAN_MO115_AR.
*/
#define	CAN_MOAR115	(CAN_MO115_AR)

/** \brief  1E7C, Message Object  Control Register */
#define CAN_MO115_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019E7Cu)

/** Alias (User Manual Name) for CAN_MO115_CTR.
* To use register names with standard convension, please use CAN_MO115_CTR.
*/
#define	CAN_MOCTR115	(CAN_MO115_CTR)

/** \brief  1E74, Message Object  Data Register High */
#define CAN_MO115_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019E74u)

/** Alias (User Manual Name) for CAN_MO115_DATAH.
* To use register names with standard convension, please use CAN_MO115_DATAH.
*/
#define	CAN_MODATAH115	(CAN_MO115_DATAH)

/** \brief  1E70, Message Object  Data Register Low */
#define CAN_MO115_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019E70u)

/** Alias (User Manual Name) for CAN_MO115_DATAL.
* To use register names with standard convension, please use CAN_MO115_DATAL.
*/
#define	CAN_MODATAL115	(CAN_MO115_DATAL)

/** \brief  1E60, Message Object  Function Control Register */
#define CAN_MO115_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019E60u)

/** Alias (User Manual Name) for CAN_MO115_EDATA0.
* To use register names with standard convension, please use CAN_MO115_EDATA0.
*/
#define	CAN_EMO115DATA0	(CAN_MO115_EDATA0)

/** \brief  1E64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO115_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019E64u)

/** Alias (User Manual Name) for CAN_MO115_EDATA1.
* To use register names with standard convension, please use CAN_MO115_EDATA1.
*/
#define	CAN_EMO115DATA1	(CAN_MO115_EDATA1)

/** \brief  1E68, Message Object  Interrupt Pointer Register */
#define CAN_MO115_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019E68u)

/** Alias (User Manual Name) for CAN_MO115_EDATA2.
* To use register names with standard convension, please use CAN_MO115_EDATA2.
*/
#define	CAN_EMO115DATA2	(CAN_MO115_EDATA2)

/** \brief  1E6C, Message Object  Acceptance Mask Register */
#define CAN_MO115_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019E6Cu)

/** Alias (User Manual Name) for CAN_MO115_EDATA3.
* To use register names with standard convension, please use CAN_MO115_EDATA3.
*/
#define	CAN_EMO115DATA3	(CAN_MO115_EDATA3)

/** \brief  1E70, Message Object  Data Register Low */
#define CAN_MO115_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019E70u)

/** Alias (User Manual Name) for CAN_MO115_EDATA4.
* To use register names with standard convension, please use CAN_MO115_EDATA4.
*/
#define	CAN_EMO115DATA4	(CAN_MO115_EDATA4)

/** \brief  1E74, Message Object  Data Register High */
#define CAN_MO115_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019E74u)

/** Alias (User Manual Name) for CAN_MO115_EDATA5.
* To use register names with standard convension, please use CAN_MO115_EDATA5.
*/
#define	CAN_EMO115DATA5	(CAN_MO115_EDATA5)

/** \brief  1E78, Message Object  Arbitration Register */
#define CAN_MO115_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019E78u)

/** Alias (User Manual Name) for CAN_MO115_EDATA6.
* To use register names with standard convension, please use CAN_MO115_EDATA6.
*/
#define	CAN_EMO115DATA6	(CAN_MO115_EDATA6)

/** \brief  1E60, Message Object  Function Control Register */
#define CAN_MO115_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019E60u)

/** Alias (User Manual Name) for CAN_MO115_FCR.
* To use register names with standard convension, please use CAN_MO115_FCR.
*/
#define	CAN_MOFCR115	(CAN_MO115_FCR)

/** \brief  1E64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO115_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019E64u)

/** Alias (User Manual Name) for CAN_MO115_FGPR.
* To use register names with standard convension, please use CAN_MO115_FGPR.
*/
#define	CAN_MOFGPR115	(CAN_MO115_FGPR)

/** \brief  1E68, Message Object  Interrupt Pointer Register */
#define CAN_MO115_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019E68u)

/** Alias (User Manual Name) for CAN_MO115_IPR.
* To use register names with standard convension, please use CAN_MO115_IPR.
*/
#define	CAN_MOIPR115	(CAN_MO115_IPR)

/** \brief  1E7C, Message Object  Control Register */
#define CAN_MO115_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019E7Cu)

/** Alias (User Manual Name) for CAN_MO115_STAT.
* To use register names with standard convension, please use CAN_MO115_STAT.
*/
#define	CAN_MOSTAT115	(CAN_MO115_STAT)

/** \brief  1E8C, Message Object  Acceptance Mask Register */
#define CAN_MO116_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019E8Cu)

/** Alias (User Manual Name) for CAN_MO116_AMR.
* To use register names with standard convension, please use CAN_MO116_AMR.
*/
#define	CAN_MOAMR116	(CAN_MO116_AMR)

/** \brief  1E98, Message Object  Arbitration Register */
#define CAN_MO116_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019E98u)

/** Alias (User Manual Name) for CAN_MO116_AR.
* To use register names with standard convension, please use CAN_MO116_AR.
*/
#define	CAN_MOAR116	(CAN_MO116_AR)

/** \brief  1E9C, Message Object  Control Register */
#define CAN_MO116_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019E9Cu)

/** Alias (User Manual Name) for CAN_MO116_CTR.
* To use register names with standard convension, please use CAN_MO116_CTR.
*/
#define	CAN_MOCTR116	(CAN_MO116_CTR)

/** \brief  1E94, Message Object  Data Register High */
#define CAN_MO116_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019E94u)

/** Alias (User Manual Name) for CAN_MO116_DATAH.
* To use register names with standard convension, please use CAN_MO116_DATAH.
*/
#define	CAN_MODATAH116	(CAN_MO116_DATAH)

/** \brief  1E90, Message Object  Data Register Low */
#define CAN_MO116_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019E90u)

/** Alias (User Manual Name) for CAN_MO116_DATAL.
* To use register names with standard convension, please use CAN_MO116_DATAL.
*/
#define	CAN_MODATAL116	(CAN_MO116_DATAL)

