luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO123_EDATA2.
* To use register names with standard convension, please use CAN_MO123_EDATA2.
*/
#define	CAN_EMO123DATA2	(CAN_MO123_EDATA2)

/** \brief  1F6C, Message Object  Acceptance Mask Register */
#define CAN_MO123_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019F6Cu)

/** Alias (User Manual Name) for CAN_MO123_EDATA3.
* To use register names with standard convension, please use CAN_MO123_EDATA3.
*/
#define	CAN_EMO123DATA3	(CAN_MO123_EDATA3)

/** \brief  1F70, Message Object  Data Register Low */
#define CAN_MO123_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019F70u)

/** Alias (User Manual Name) for CAN_MO123_EDATA4.
* To use register names with standard convension, please use CAN_MO123_EDATA4.
*/
#define	CAN_EMO123DATA4	(CAN_MO123_EDATA4)

/** \brief  1F74, Message Object  Data Register High */
#define CAN_MO123_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019F74u)

/** Alias (User Manual Name) for CAN_MO123_EDATA5.
* To use register names with standard convension, please use CAN_MO123_EDATA5.
*/
#define	CAN_EMO123DATA5	(CAN_MO123_EDATA5)

/** \brief  1F78, Message Object  Arbitration Register */
#define CAN_MO123_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019F78u)

/** Alias (User Manual Name) for CAN_MO123_EDATA6.
* To use register names with standard convension, please use CAN_MO123_EDATA6.
*/
#define	CAN_EMO123DATA6	(CAN_MO123_EDATA6)

/** \brief  1F60, Message Object  Function Control Register */
#define CAN_MO123_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019F60u)

/** Alias (User Manual Name) for CAN_MO123_FCR.
* To use register names with standard convension, please use CAN_MO123_FCR.
*/
#define	CAN_MOFCR123	(CAN_MO123_FCR)

/** \brief  1F64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO123_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019F64u)

/** Alias (User Manual Name) for CAN_MO123_FGPR.
* To use register names with standard convension, please use CAN_MO123_FGPR.
*/
#define	CAN_MOFGPR123	(CAN_MO123_FGPR)

/** \brief  1F68, Message Object  Interrupt Pointer Register */
#define CAN_MO123_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019F68u)

/** Alias (User Manual Name) for CAN_MO123_IPR.
* To use register names with standard convension, please use CAN_MO123_IPR.
*/
#define	CAN_MOIPR123	(CAN_MO123_IPR)

/** \brief  1F7C, Message Object  Control Register */
#define CAN_MO123_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019F7Cu)

/** Alias (User Manual Name) for CAN_MO123_STAT.
* To use register names with standard convension, please use CAN_MO123_STAT.
*/
#define	CAN_MOSTAT123	(CAN_MO123_STAT)

/** \brief  1F8C, Message Object  Acceptance Mask Register */
#define CAN_MO124_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019F8Cu)

/** Alias (User Manual Name) for CAN_MO124_AMR.
* To use register names with standard convension, please use CAN_MO124_AMR.
*/
#define	CAN_MOAMR124	(CAN_MO124_AMR)

/** \brief  1F98, Message Object  Arbitration Register */
#define CAN_MO124_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019F98u)

/** Alias (User Manual Name) for CAN_MO124_AR.
* To use register names with standard convension, please use CAN_MO124_AR.
*/
#define	CAN_MOAR124	(CAN_MO124_AR)

/** \brief  1F9C, Message Object  Control Register */
#define CAN_MO124_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019F9Cu)

/** Alias (User Manual Name) for CAN_MO124_CTR.
* To use register names with standard convension, please use CAN_MO124_CTR.
*/
#define	CAN_MOCTR124	(CAN_MO124_CTR)

/** \brief  1F94, Message Object  Data Register High */
#define CAN_MO124_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019F94u)

/** Alias (User Manual Name) for CAN_MO124_DATAH.
* To use register names with standard convension, please use CAN_MO124_DATAH.
*/
#define	CAN_MODATAH124	(CAN_MO124_DATAH)

/** \brief  1F90, Message Object  Data Register Low */
#define CAN_MO124_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019F90u)

/** Alias (User Manual Name) for CAN_MO124_DATAL.
* To use register names with standard convension, please use CAN_MO124_DATAL.
*/
#define	CAN_MODATAL124	(CAN_MO124_DATAL)

/** \brief  1F80, Message Object  Function Control Register */
#define CAN_MO124_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019F80u)

/** Alias (User Manual Name) for CAN_MO124_EDATA0.
* To use register names with standard convension, please use CAN_MO124_EDATA0.
*/
#define	CAN_EMO124DATA0	(CAN_MO124_EDATA0)

/** \brief  1F84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO124_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019F84u)

/** Alias (User Manual Name) for CAN_MO124_EDATA1.
* To use register names with standard convension, please use CAN_MO124_EDATA1.
*/
#define	CAN_EMO124DATA1	(CAN_MO124_EDATA1)

/** \brief  1F88, Message Object  Interrupt Pointer Register */
#define CAN_MO124_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019F88u)

/** Alias (User Manual Name) for CAN_MO124_EDATA2.
* To use register names with standard convension, please use CAN_MO124_EDATA2.
*/
#define	CAN_EMO124DATA2	(CAN_MO124_EDATA2)

/** \brief  1F8C, Message Object  Acceptance Mask Register */
#define CAN_MO124_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019F8Cu)

/** Alias (User Manual Name) for CAN_MO124_EDATA3.
* To use register names with standard convension, please use CAN_MO124_EDATA3.
*/
#define	CAN_EMO124DATA3	(CAN_MO124_EDATA3)

/** \brief  1F90, Message Object  Data Register Low */
#define CAN_MO124_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019F90u)

/** Alias (User Manual Name) for CAN_MO124_EDATA4.
* To use register names with standard convension, please use CAN_MO124_EDATA4.
*/
#define	CAN_EMO124DATA4	(CAN_MO124_EDATA4)

/** \brief  1F94, Message Object  Data Register High */
#define CAN_MO124_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019F94u)

/** Alias (User Manual Name) for CAN_MO124_EDATA5.
* To use register names with standard convension, please use CAN_MO124_EDATA5.
*/
#define	CAN_EMO124DATA5	(CAN_MO124_EDATA5)

/** \brief  1F98, Message Object  Arbitration Register */
#define CAN_MO124_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019F98u)

/** Alias (User Manual Name) for CAN_MO124_EDATA6.
* To use register names with standard convension, please use CAN_MO124_EDATA6.
*/
#define	CAN_EMO124DATA6	(CAN_MO124_EDATA6)

