luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  1FF4, Message Object  Data Register High */
#define CAN_MO127_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019FF4u)

/** Alias (User Manual Name) for CAN_MO127_DATAH.
* To use register names with standard convension, please use CAN_MO127_DATAH.
*/
#define	CAN_MODATAH127	(CAN_MO127_DATAH)

/** \brief  1FF0, Message Object  Data Register Low */
#define CAN_MO127_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019FF0u)

/** Alias (User Manual Name) for CAN_MO127_DATAL.
* To use register names with standard convension, please use CAN_MO127_DATAL.
*/
#define	CAN_MODATAL127	(CAN_MO127_DATAL)

/** \brief  1FE0, Message Object  Function Control Register */
#define CAN_MO127_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019FE0u)

/** Alias (User Manual Name) for CAN_MO127_EDATA0.
* To use register names with standard convension, please use CAN_MO127_EDATA0.
*/
#define	CAN_EMO127DATA0	(CAN_MO127_EDATA0)

/** \brief  1FE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO127_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019FE4u)

/** Alias (User Manual Name) for CAN_MO127_EDATA1.
* To use register names with standard convension, please use CAN_MO127_EDATA1.
*/
#define	CAN_EMO127DATA1	(CAN_MO127_EDATA1)

/** \brief  1FE8, Message Object  Interrupt Pointer Register */
#define CAN_MO127_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019FE8u)

/** Alias (User Manual Name) for CAN_MO127_EDATA2.
* To use register names with standard convension, please use CAN_MO127_EDATA2.
*/
#define	CAN_EMO127DATA2	(CAN_MO127_EDATA2)

/** \brief  1FEC, Message Object  Acceptance Mask Register */
#define CAN_MO127_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019FECu)

/** Alias (User Manual Name) for CAN_MO127_EDATA3.
* To use register names with standard convension, please use CAN_MO127_EDATA3.
*/
#define	CAN_EMO127DATA3	(CAN_MO127_EDATA3)

/** \brief  1FF0, Message Object  Data Register Low */
#define CAN_MO127_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019FF0u)

/** Alias (User Manual Name) for CAN_MO127_EDATA4.
* To use register names with standard convension, please use CAN_MO127_EDATA4.
*/
#define	CAN_EMO127DATA4	(CAN_MO127_EDATA4)

/** \brief  1FF4, Message Object  Data Register High */
#define CAN_MO127_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019FF4u)

/** Alias (User Manual Name) for CAN_MO127_EDATA5.
* To use register names with standard convension, please use CAN_MO127_EDATA5.
*/
#define	CAN_EMO127DATA5	(CAN_MO127_EDATA5)

/** \brief  1FF8, Message Object  Arbitration Register */
#define CAN_MO127_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019FF8u)

/** Alias (User Manual Name) for CAN_MO127_EDATA6.
* To use register names with standard convension, please use CAN_MO127_EDATA6.
*/
#define	CAN_EMO127DATA6	(CAN_MO127_EDATA6)

/** \brief  1FE0, Message Object  Function Control Register */
#define CAN_MO127_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019FE0u)

/** Alias (User Manual Name) for CAN_MO127_FCR.
* To use register names with standard convension, please use CAN_MO127_FCR.
*/
#define	CAN_MOFCR127	(CAN_MO127_FCR)

/** \brief  1FE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO127_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019FE4u)

/** Alias (User Manual Name) for CAN_MO127_FGPR.
* To use register names with standard convension, please use CAN_MO127_FGPR.
*/
#define	CAN_MOFGPR127	(CAN_MO127_FGPR)

/** \brief  1FE8, Message Object  Interrupt Pointer Register */
#define CAN_MO127_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019FE8u)

/** Alias (User Manual Name) for CAN_MO127_IPR.
* To use register names with standard convension, please use CAN_MO127_IPR.
*/
#define	CAN_MOIPR127	(CAN_MO127_IPR)

/** \brief  1FFC, Message Object  Control Register */
#define CAN_MO127_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019FFCu)

/** Alias (User Manual Name) for CAN_MO127_STAT.
* To use register names with standard convension, please use CAN_MO127_STAT.
*/
#define	CAN_MOSTAT127	(CAN_MO127_STAT)

/** \brief  200C, Message Object  Acceptance Mask Register */
#define CAN_MO128_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A00Cu)

/** Alias (User Manual Name) for CAN_MO128_AMR.
* To use register names with standard convension, please use CAN_MO128_AMR.
*/
#define	CAN_MOAMR128	(CAN_MO128_AMR)

/** \brief  2018, Message Object  Arbitration Register */
#define CAN_MO128_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A018u)

/** Alias (User Manual Name) for CAN_MO128_AR.
* To use register names with standard convension, please use CAN_MO128_AR.
*/
#define	CAN_MOAR128	(CAN_MO128_AR)

/** \brief  201C, Message Object  Control Register */
#define CAN_MO128_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A01Cu)

/** Alias (User Manual Name) for CAN_MO128_CTR.
* To use register names with standard convension, please use CAN_MO128_CTR.
*/
#define	CAN_MOCTR128	(CAN_MO128_CTR)

/** \brief  2014, Message Object  Data Register High */
#define CAN_MO128_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A014u)

/** Alias (User Manual Name) for CAN_MO128_DATAH.
* To use register names with standard convension, please use CAN_MO128_DATAH.
*/
#define	CAN_MODATAH128	(CAN_MO128_DATAH)

/** \brief  2010, Message Object  Data Register Low */
#define CAN_MO128_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A010u)

/** Alias (User Manual Name) for CAN_MO128_DATAL.
* To use register names with standard convension, please use CAN_MO128_DATAL.
*/
#define	CAN_MODATAL128	(CAN_MO128_DATAL)

/** \brief  2000, Message Object  Function Control Register */
#define CAN_MO128_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A000u)

/** Alias (User Manual Name) for CAN_MO128_EDATA0.
* To use register names with standard convension, please use CAN_MO128_EDATA0.
*/
#define	CAN_EMO128DATA0	(CAN_MO128_EDATA0)

/** \brief  2004, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO128_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A004u)

/** Alias (User Manual Name) for CAN_MO128_EDATA1.
* To use register names with standard convension, please use CAN_MO128_EDATA1.
*/
#define	CAN_EMO128DATA1	(CAN_MO128_EDATA1)

/** \brief  2008, Message Object  Interrupt Pointer Register */
#define CAN_MO128_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A008u)

/** Alias (User Manual Name) for CAN_MO128_EDATA2.
* To use register names with standard convension, please use CAN_MO128_EDATA2.
*/
#define	CAN_EMO128DATA2	(CAN_MO128_EDATA2)

