luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  200C, Message Object  Acceptance Mask Register */
#define CAN_MO128_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A00Cu)

/** Alias (User Manual Name) for CAN_MO128_EDATA3.
* To use register names with standard convension, please use CAN_MO128_EDATA3.
*/
#define	CAN_EMO128DATA3	(CAN_MO128_EDATA3)

/** \brief  2010, Message Object  Data Register Low */
#define CAN_MO128_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A010u)

/** Alias (User Manual Name) for CAN_MO128_EDATA4.
* To use register names with standard convension, please use CAN_MO128_EDATA4.
*/
#define	CAN_EMO128DATA4	(CAN_MO128_EDATA4)

/** \brief  2014, Message Object  Data Register High */
#define CAN_MO128_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A014u)

/** Alias (User Manual Name) for CAN_MO128_EDATA5.
* To use register names with standard convension, please use CAN_MO128_EDATA5.
*/
#define	CAN_EMO128DATA5	(CAN_MO128_EDATA5)

/** \brief  2018, Message Object  Arbitration Register */
#define CAN_MO128_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A018u)

/** Alias (User Manual Name) for CAN_MO128_EDATA6.
* To use register names with standard convension, please use CAN_MO128_EDATA6.
*/
#define	CAN_EMO128DATA6	(CAN_MO128_EDATA6)

/** \brief  2000, Message Object  Function Control Register */
#define CAN_MO128_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A000u)

/** Alias (User Manual Name) for CAN_MO128_FCR.
* To use register names with standard convension, please use CAN_MO128_FCR.
*/
#define	CAN_MOFCR128	(CAN_MO128_FCR)

/** \brief  2004, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO128_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A004u)

/** Alias (User Manual Name) for CAN_MO128_FGPR.
* To use register names with standard convension, please use CAN_MO128_FGPR.
*/
#define	CAN_MOFGPR128	(CAN_MO128_FGPR)

/** \brief  2008, Message Object  Interrupt Pointer Register */
#define CAN_MO128_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A008u)

/** Alias (User Manual Name) for CAN_MO128_IPR.
* To use register names with standard convension, please use CAN_MO128_IPR.
*/
#define	CAN_MOIPR128	(CAN_MO128_IPR)

/** \brief  201C, Message Object  Control Register */
#define CAN_MO128_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A01Cu)

/** Alias (User Manual Name) for CAN_MO128_STAT.
* To use register names with standard convension, please use CAN_MO128_STAT.
*/
#define	CAN_MOSTAT128	(CAN_MO128_STAT)

/** \brief  202C, Message Object  Acceptance Mask Register */
#define CAN_MO129_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A02Cu)

/** Alias (User Manual Name) for CAN_MO129_AMR.
* To use register names with standard convension, please use CAN_MO129_AMR.
*/
#define	CAN_MOAMR129	(CAN_MO129_AMR)

/** \brief  2038, Message Object  Arbitration Register */
#define CAN_MO129_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A038u)

/** Alias (User Manual Name) for CAN_MO129_AR.
* To use register names with standard convension, please use CAN_MO129_AR.
*/
#define	CAN_MOAR129	(CAN_MO129_AR)

/** \brief  203C, Message Object  Control Register */
#define CAN_MO129_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A03Cu)

/** Alias (User Manual Name) for CAN_MO129_CTR.
* To use register names with standard convension, please use CAN_MO129_CTR.
*/
#define	CAN_MOCTR129	(CAN_MO129_CTR)

/** \brief  2034, Message Object  Data Register High */
#define CAN_MO129_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A034u)

/** Alias (User Manual Name) for CAN_MO129_DATAH.
* To use register names with standard convension, please use CAN_MO129_DATAH.
*/
#define	CAN_MODATAH129	(CAN_MO129_DATAH)

/** \brief  2030, Message Object  Data Register Low */
#define CAN_MO129_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A030u)

/** Alias (User Manual Name) for CAN_MO129_DATAL.
* To use register names with standard convension, please use CAN_MO129_DATAL.
*/
#define	CAN_MODATAL129	(CAN_MO129_DATAL)

/** \brief  2020, Message Object  Function Control Register */
#define CAN_MO129_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A020u)

/** Alias (User Manual Name) for CAN_MO129_EDATA0.
* To use register names with standard convension, please use CAN_MO129_EDATA0.
*/
#define	CAN_EMO129DATA0	(CAN_MO129_EDATA0)

/** \brief  2024, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO129_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A024u)

/** Alias (User Manual Name) for CAN_MO129_EDATA1.
* To use register names with standard convension, please use CAN_MO129_EDATA1.
*/
#define	CAN_EMO129DATA1	(CAN_MO129_EDATA1)

/** \brief  2028, Message Object  Interrupt Pointer Register */
#define CAN_MO129_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A028u)

/** Alias (User Manual Name) for CAN_MO129_EDATA2.
* To use register names with standard convension, please use CAN_MO129_EDATA2.
*/
#define	CAN_EMO129DATA2	(CAN_MO129_EDATA2)

/** \brief  202C, Message Object  Acceptance Mask Register */
#define CAN_MO129_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A02Cu)

/** Alias (User Manual Name) for CAN_MO129_EDATA3.
* To use register names with standard convension, please use CAN_MO129_EDATA3.
*/
#define	CAN_EMO129DATA3	(CAN_MO129_EDATA3)

/** \brief  2030, Message Object  Data Register Low */
#define CAN_MO129_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A030u)

/** Alias (User Manual Name) for CAN_MO129_EDATA4.
* To use register names with standard convension, please use CAN_MO129_EDATA4.
*/
#define	CAN_EMO129DATA4	(CAN_MO129_EDATA4)

/** \brief  2034, Message Object  Data Register High */
#define CAN_MO129_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A034u)

/** Alias (User Manual Name) for CAN_MO129_EDATA5.
* To use register names with standard convension, please use CAN_MO129_EDATA5.
*/
#define	CAN_EMO129DATA5	(CAN_MO129_EDATA5)

/** \brief  2038, Message Object  Arbitration Register */
#define CAN_MO129_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A038u)

/** Alias (User Manual Name) for CAN_MO129_EDATA6.
* To use register names with standard convension, please use CAN_MO129_EDATA6.
*/
#define	CAN_EMO129DATA6	(CAN_MO129_EDATA6)

/** \brief  2020, Message Object  Function Control Register */
#define CAN_MO129_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A020u)

/** Alias (User Manual Name) for CAN_MO129_FCR.
* To use register names with standard convension, please use CAN_MO129_FCR.
*/
#define	CAN_MOFCR129	(CAN_MO129_FCR)

/** \brief  2024, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO129_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A024u)

/** Alias (User Manual Name) for CAN_MO129_FGPR.
* To use register names with standard convension, please use CAN_MO129_FGPR.
*/
#define	CAN_MOFGPR129	(CAN_MO129_FGPR)

/** \brief  2028, Message Object  Interrupt Pointer Register */
#define CAN_MO129_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A028u)

/** Alias (User Manual Name) for CAN_MO129_IPR.
* To use register names with standard convension, please use CAN_MO129_IPR.
*/
#define	CAN_MOIPR129	(CAN_MO129_IPR)

/** \brief  203C, Message Object  Control Register */
#define CAN_MO129_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A03Cu)

