luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO129_STAT.
* To use register names with standard convension, please use CAN_MO129_STAT.
*/
#define	CAN_MOSTAT129	(CAN_MO129_STAT)

/** \brief  118C, Message Object  Acceptance Mask Register */
#define CAN_MO12_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001918Cu)

/** Alias (User Manual Name) for CAN_MO12_AMR.
* To use register names with standard convension, please use CAN_MO12_AMR.
*/
#define	CAN_MOAMR12	(CAN_MO12_AMR)

/** \brief  1198, Message Object  Arbitration Register */
#define CAN_MO12_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019198u)

/** Alias (User Manual Name) for CAN_MO12_AR.
* To use register names with standard convension, please use CAN_MO12_AR.
*/
#define	CAN_MOAR12	(CAN_MO12_AR)

/** \brief  119C, Message Object  Control Register */
#define CAN_MO12_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001919Cu)

/** Alias (User Manual Name) for CAN_MO12_CTR.
* To use register names with standard convension, please use CAN_MO12_CTR.
*/
#define	CAN_MOCTR12	(CAN_MO12_CTR)

/** \brief  1194, Message Object  Data Register High */
#define CAN_MO12_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019194u)

/** Alias (User Manual Name) for CAN_MO12_DATAH.
* To use register names with standard convension, please use CAN_MO12_DATAH.
*/
#define	CAN_MODATAH12	(CAN_MO12_DATAH)

/** \brief  1190, Message Object  Data Register Low */
#define CAN_MO12_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019190u)

/** Alias (User Manual Name) for CAN_MO12_DATAL.
* To use register names with standard convension, please use CAN_MO12_DATAL.
*/
#define	CAN_MODATAL12	(CAN_MO12_DATAL)

/** \brief  1180, Message Object  Function Control Register */
#define CAN_MO12_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019180u)

/** Alias (User Manual Name) for CAN_MO12_EDATA0.
* To use register names with standard convension, please use CAN_MO12_EDATA0.
*/
#define	CAN_EMO12DATA0	(CAN_MO12_EDATA0)

/** \brief  1184, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO12_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019184u)

/** Alias (User Manual Name) for CAN_MO12_EDATA1.
* To use register names with standard convension, please use CAN_MO12_EDATA1.
*/
#define	CAN_EMO12DATA1	(CAN_MO12_EDATA1)

/** \brief  1188, Message Object  Interrupt Pointer Register */
#define CAN_MO12_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019188u)

/** Alias (User Manual Name) for CAN_MO12_EDATA2.
* To use register names with standard convension, please use CAN_MO12_EDATA2.
*/
#define	CAN_EMO12DATA2	(CAN_MO12_EDATA2)

/** \brief  118C, Message Object  Acceptance Mask Register */
#define CAN_MO12_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001918Cu)

/** Alias (User Manual Name) for CAN_MO12_EDATA3.
* To use register names with standard convension, please use CAN_MO12_EDATA3.
*/
#define	CAN_EMO12DATA3	(CAN_MO12_EDATA3)

/** \brief  1190, Message Object  Data Register Low */
#define CAN_MO12_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019190u)

/** Alias (User Manual Name) for CAN_MO12_EDATA4.
* To use register names with standard convension, please use CAN_MO12_EDATA4.
*/
#define	CAN_EMO12DATA4	(CAN_MO12_EDATA4)

/** \brief  1194, Message Object  Data Register High */
#define CAN_MO12_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019194u)

/** Alias (User Manual Name) for CAN_MO12_EDATA5.
* To use register names with standard convension, please use CAN_MO12_EDATA5.
*/
#define	CAN_EMO12DATA5	(CAN_MO12_EDATA5)

/** \brief  1198, Message Object  Arbitration Register */
#define CAN_MO12_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019198u)

/** Alias (User Manual Name) for CAN_MO12_EDATA6.
* To use register names with standard convension, please use CAN_MO12_EDATA6.
*/
#define	CAN_EMO12DATA6	(CAN_MO12_EDATA6)

/** \brief  1180, Message Object  Function Control Register */
#define CAN_MO12_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019180u)

/** Alias (User Manual Name) for CAN_MO12_FCR.
* To use register names with standard convension, please use CAN_MO12_FCR.
*/
#define	CAN_MOFCR12	(CAN_MO12_FCR)

/** \brief  1184, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO12_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019184u)

/** Alias (User Manual Name) for CAN_MO12_FGPR.
* To use register names with standard convension, please use CAN_MO12_FGPR.
*/
#define	CAN_MOFGPR12	(CAN_MO12_FGPR)

/** \brief  1188, Message Object  Interrupt Pointer Register */
#define CAN_MO12_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019188u)

/** Alias (User Manual Name) for CAN_MO12_IPR.
* To use register names with standard convension, please use CAN_MO12_IPR.
*/
#define	CAN_MOIPR12	(CAN_MO12_IPR)

/** \brief  119C, Message Object  Control Register */
#define CAN_MO12_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001919Cu)

/** Alias (User Manual Name) for CAN_MO12_STAT.
* To use register names with standard convension, please use CAN_MO12_STAT.
*/
#define	CAN_MOSTAT12	(CAN_MO12_STAT)

/** \brief  204C, Message Object  Acceptance Mask Register */
#define CAN_MO130_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A04Cu)

/** Alias (User Manual Name) for CAN_MO130_AMR.
* To use register names with standard convension, please use CAN_MO130_AMR.
*/
#define	CAN_MOAMR130	(CAN_MO130_AMR)

/** \brief  2058, Message Object  Arbitration Register */
#define CAN_MO130_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A058u)

/** Alias (User Manual Name) for CAN_MO130_AR.
* To use register names with standard convension, please use CAN_MO130_AR.
*/
#define	CAN_MOAR130	(CAN_MO130_AR)

/** \brief  205C, Message Object  Control Register */
#define CAN_MO130_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A05Cu)

/** Alias (User Manual Name) for CAN_MO130_CTR.
* To use register names with standard convension, please use CAN_MO130_CTR.
*/
#define	CAN_MOCTR130	(CAN_MO130_CTR)

/** \brief  2054, Message Object  Data Register High */
#define CAN_MO130_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A054u)

/** Alias (User Manual Name) for CAN_MO130_DATAH.
* To use register names with standard convension, please use CAN_MO130_DATAH.
*/
#define	CAN_MODATAH130	(CAN_MO130_DATAH)

/** \brief  2050, Message Object  Data Register Low */
#define CAN_MO130_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A050u)

/** Alias (User Manual Name) for CAN_MO130_DATAL.
* To use register names with standard convension, please use CAN_MO130_DATAL.
*/
#define	CAN_MODATAL130	(CAN_MO130_DATAL)

/** \brief  2040, Message Object  Function Control Register */
#define CAN_MO130_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A040u)

/** Alias (User Manual Name) for CAN_MO130_EDATA0.
* To use register names with standard convension, please use CAN_MO130_EDATA0.
*/
#define	CAN_EMO130DATA0	(CAN_MO130_EDATA0)

/** \brief  2044, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO130_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A044u)

