luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO130_EDATA1.
* To use register names with standard convension, please use CAN_MO130_EDATA1.
*/
#define	CAN_EMO130DATA1	(CAN_MO130_EDATA1)

/** \brief  2048, Message Object  Interrupt Pointer Register */
#define CAN_MO130_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A048u)

/** Alias (User Manual Name) for CAN_MO130_EDATA2.
* To use register names with standard convension, please use CAN_MO130_EDATA2.
*/
#define	CAN_EMO130DATA2	(CAN_MO130_EDATA2)

/** \brief  204C, Message Object  Acceptance Mask Register */
#define CAN_MO130_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A04Cu)

/** Alias (User Manual Name) for CAN_MO130_EDATA3.
* To use register names with standard convension, please use CAN_MO130_EDATA3.
*/
#define	CAN_EMO130DATA3	(CAN_MO130_EDATA3)

/** \brief  2050, Message Object  Data Register Low */
#define CAN_MO130_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A050u)

/** Alias (User Manual Name) for CAN_MO130_EDATA4.
* To use register names with standard convension, please use CAN_MO130_EDATA4.
*/
#define	CAN_EMO130DATA4	(CAN_MO130_EDATA4)

/** \brief  2054, Message Object  Data Register High */
#define CAN_MO130_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A054u)

/** Alias (User Manual Name) for CAN_MO130_EDATA5.
* To use register names with standard convension, please use CAN_MO130_EDATA5.
*/
#define	CAN_EMO130DATA5	(CAN_MO130_EDATA5)

/** \brief  2058, Message Object  Arbitration Register */
#define CAN_MO130_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A058u)

/** Alias (User Manual Name) for CAN_MO130_EDATA6.
* To use register names with standard convension, please use CAN_MO130_EDATA6.
*/
#define	CAN_EMO130DATA6	(CAN_MO130_EDATA6)

/** \brief  2040, Message Object  Function Control Register */
#define CAN_MO130_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A040u)

/** Alias (User Manual Name) for CAN_MO130_FCR.
* To use register names with standard convension, please use CAN_MO130_FCR.
*/
#define	CAN_MOFCR130	(CAN_MO130_FCR)

/** \brief  2044, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO130_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A044u)

/** Alias (User Manual Name) for CAN_MO130_FGPR.
* To use register names with standard convension, please use CAN_MO130_FGPR.
*/
#define	CAN_MOFGPR130	(CAN_MO130_FGPR)

/** \brief  2048, Message Object  Interrupt Pointer Register */
#define CAN_MO130_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A048u)

/** Alias (User Manual Name) for CAN_MO130_IPR.
* To use register names with standard convension, please use CAN_MO130_IPR.
*/
#define	CAN_MOIPR130	(CAN_MO130_IPR)

/** \brief  205C, Message Object  Control Register */
#define CAN_MO130_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A05Cu)

/** Alias (User Manual Name) for CAN_MO130_STAT.
* To use register names with standard convension, please use CAN_MO130_STAT.
*/
#define	CAN_MOSTAT130	(CAN_MO130_STAT)

/** \brief  206C, Message Object  Acceptance Mask Register */
#define CAN_MO131_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A06Cu)

/** Alias (User Manual Name) for CAN_MO131_AMR.
* To use register names with standard convension, please use CAN_MO131_AMR.
*/
#define	CAN_MOAMR131	(CAN_MO131_AMR)

/** \brief  2078, Message Object  Arbitration Register */
#define CAN_MO131_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A078u)

/** Alias (User Manual Name) for CAN_MO131_AR.
* To use register names with standard convension, please use CAN_MO131_AR.
*/
#define	CAN_MOAR131	(CAN_MO131_AR)

/** \brief  207C, Message Object  Control Register */
#define CAN_MO131_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A07Cu)

/** Alias (User Manual Name) for CAN_MO131_CTR.
* To use register names with standard convension, please use CAN_MO131_CTR.
*/
#define	CAN_MOCTR131	(CAN_MO131_CTR)

/** \brief  2074, Message Object  Data Register High */
#define CAN_MO131_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A074u)

/** Alias (User Manual Name) for CAN_MO131_DATAH.
* To use register names with standard convension, please use CAN_MO131_DATAH.
*/
#define	CAN_MODATAH131	(CAN_MO131_DATAH)

/** \brief  2070, Message Object  Data Register Low */
#define CAN_MO131_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A070u)

/** Alias (User Manual Name) for CAN_MO131_DATAL.
* To use register names with standard convension, please use CAN_MO131_DATAL.
*/
#define	CAN_MODATAL131	(CAN_MO131_DATAL)

/** \brief  2060, Message Object  Function Control Register */
#define CAN_MO131_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A060u)

/** Alias (User Manual Name) for CAN_MO131_EDATA0.
* To use register names with standard convension, please use CAN_MO131_EDATA0.
*/
#define	CAN_EMO131DATA0	(CAN_MO131_EDATA0)

/** \brief  2064, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO131_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A064u)

/** Alias (User Manual Name) for CAN_MO131_EDATA1.
* To use register names with standard convension, please use CAN_MO131_EDATA1.
*/
#define	CAN_EMO131DATA1	(CAN_MO131_EDATA1)

/** \brief  2068, Message Object  Interrupt Pointer Register */
#define CAN_MO131_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A068u)

/** Alias (User Manual Name) for CAN_MO131_EDATA2.
* To use register names with standard convension, please use CAN_MO131_EDATA2.
*/
#define	CAN_EMO131DATA2	(CAN_MO131_EDATA2)

/** \brief  206C, Message Object  Acceptance Mask Register */
#define CAN_MO131_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A06Cu)

/** Alias (User Manual Name) for CAN_MO131_EDATA3.
* To use register names with standard convension, please use CAN_MO131_EDATA3.
*/
#define	CAN_EMO131DATA3	(CAN_MO131_EDATA3)

/** \brief  2070, Message Object  Data Register Low */
#define CAN_MO131_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A070u)

/** Alias (User Manual Name) for CAN_MO131_EDATA4.
* To use register names with standard convension, please use CAN_MO131_EDATA4.
*/
#define	CAN_EMO131DATA4	(CAN_MO131_EDATA4)

/** \brief  2074, Message Object  Data Register High */
#define CAN_MO131_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A074u)

/** Alias (User Manual Name) for CAN_MO131_EDATA5.
* To use register names with standard convension, please use CAN_MO131_EDATA5.
*/
#define	CAN_EMO131DATA5	(CAN_MO131_EDATA5)

