luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2078, Message Object  Arbitration Register */
#define CAN_MO131_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A078u)

/** Alias (User Manual Name) for CAN_MO131_EDATA6.
* To use register names with standard convension, please use CAN_MO131_EDATA6.
*/
#define	CAN_EMO131DATA6	(CAN_MO131_EDATA6)

/** \brief  2060, Message Object  Function Control Register */
#define CAN_MO131_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A060u)

/** Alias (User Manual Name) for CAN_MO131_FCR.
* To use register names with standard convension, please use CAN_MO131_FCR.
*/
#define	CAN_MOFCR131	(CAN_MO131_FCR)

/** \brief  2064, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO131_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A064u)

/** Alias (User Manual Name) for CAN_MO131_FGPR.
* To use register names with standard convension, please use CAN_MO131_FGPR.
*/
#define	CAN_MOFGPR131	(CAN_MO131_FGPR)

/** \brief  2068, Message Object  Interrupt Pointer Register */
#define CAN_MO131_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A068u)

/** Alias (User Manual Name) for CAN_MO131_IPR.
* To use register names with standard convension, please use CAN_MO131_IPR.
*/
#define	CAN_MOIPR131	(CAN_MO131_IPR)

/** \brief  207C, Message Object  Control Register */
#define CAN_MO131_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A07Cu)

/** Alias (User Manual Name) for CAN_MO131_STAT.
* To use register names with standard convension, please use CAN_MO131_STAT.
*/
#define	CAN_MOSTAT131	(CAN_MO131_STAT)

/** \brief  208C, Message Object  Acceptance Mask Register */
#define CAN_MO132_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A08Cu)

/** Alias (User Manual Name) for CAN_MO132_AMR.
* To use register names with standard convension, please use CAN_MO132_AMR.
*/
#define	CAN_MOAMR132	(CAN_MO132_AMR)

/** \brief  2098, Message Object  Arbitration Register */
#define CAN_MO132_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A098u)

/** Alias (User Manual Name) for CAN_MO132_AR.
* To use register names with standard convension, please use CAN_MO132_AR.
*/
#define	CAN_MOAR132	(CAN_MO132_AR)

/** \brief  209C, Message Object  Control Register */
#define CAN_MO132_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A09Cu)

/** Alias (User Manual Name) for CAN_MO132_CTR.
* To use register names with standard convension, please use CAN_MO132_CTR.
*/
#define	CAN_MOCTR132	(CAN_MO132_CTR)

/** \brief  2094, Message Object  Data Register High */
#define CAN_MO132_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A094u)

/** Alias (User Manual Name) for CAN_MO132_DATAH.
* To use register names with standard convension, please use CAN_MO132_DATAH.
*/
#define	CAN_MODATAH132	(CAN_MO132_DATAH)

/** \brief  2090, Message Object  Data Register Low */
#define CAN_MO132_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A090u)

/** Alias (User Manual Name) for CAN_MO132_DATAL.
* To use register names with standard convension, please use CAN_MO132_DATAL.
*/
#define	CAN_MODATAL132	(CAN_MO132_DATAL)

/** \brief  2080, Message Object  Function Control Register */
#define CAN_MO132_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A080u)

/** Alias (User Manual Name) for CAN_MO132_EDATA0.
* To use register names with standard convension, please use CAN_MO132_EDATA0.
*/
#define	CAN_EMO132DATA0	(CAN_MO132_EDATA0)

/** \brief  2084, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO132_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A084u)

/** Alias (User Manual Name) for CAN_MO132_EDATA1.
* To use register names with standard convension, please use CAN_MO132_EDATA1.
*/
#define	CAN_EMO132DATA1	(CAN_MO132_EDATA1)

/** \brief  2088, Message Object  Interrupt Pointer Register */
#define CAN_MO132_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A088u)

/** Alias (User Manual Name) for CAN_MO132_EDATA2.
* To use register names with standard convension, please use CAN_MO132_EDATA2.
*/
#define	CAN_EMO132DATA2	(CAN_MO132_EDATA2)

/** \brief  208C, Message Object  Acceptance Mask Register */
#define CAN_MO132_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A08Cu)

/** Alias (User Manual Name) for CAN_MO132_EDATA3.
* To use register names with standard convension, please use CAN_MO132_EDATA3.
*/
#define	CAN_EMO132DATA3	(CAN_MO132_EDATA3)

/** \brief  2090, Message Object  Data Register Low */
#define CAN_MO132_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A090u)

/** Alias (User Manual Name) for CAN_MO132_EDATA4.
* To use register names with standard convension, please use CAN_MO132_EDATA4.
*/
#define	CAN_EMO132DATA4	(CAN_MO132_EDATA4)

/** \brief  2094, Message Object  Data Register High */
#define CAN_MO132_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A094u)

/** Alias (User Manual Name) for CAN_MO132_EDATA5.
* To use register names with standard convension, please use CAN_MO132_EDATA5.
*/
#define	CAN_EMO132DATA5	(CAN_MO132_EDATA5)

/** \brief  2098, Message Object  Arbitration Register */
#define CAN_MO132_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A098u)

/** Alias (User Manual Name) for CAN_MO132_EDATA6.
* To use register names with standard convension, please use CAN_MO132_EDATA6.
*/
#define	CAN_EMO132DATA6	(CAN_MO132_EDATA6)

/** \brief  2080, Message Object  Function Control Register */
#define CAN_MO132_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A080u)

/** Alias (User Manual Name) for CAN_MO132_FCR.
* To use register names with standard convension, please use CAN_MO132_FCR.
*/
#define	CAN_MOFCR132	(CAN_MO132_FCR)

/** \brief  2084, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO132_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A084u)

/** Alias (User Manual Name) for CAN_MO132_FGPR.
* To use register names with standard convension, please use CAN_MO132_FGPR.
*/
#define	CAN_MOFGPR132	(CAN_MO132_FGPR)

/** \brief  2088, Message Object  Interrupt Pointer Register */
#define CAN_MO132_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A088u)

/** Alias (User Manual Name) for CAN_MO132_IPR.
* To use register names with standard convension, please use CAN_MO132_IPR.
*/
#define	CAN_MOIPR132	(CAN_MO132_IPR)

/** \brief  209C, Message Object  Control Register */
#define CAN_MO132_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A09Cu)

