luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO132_STAT.
* To use register names with standard convension, please use CAN_MO132_STAT.
*/
#define	CAN_MOSTAT132	(CAN_MO132_STAT)

/** \brief  20AC, Message Object  Acceptance Mask Register */
#define CAN_MO133_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A0ACu)

/** Alias (User Manual Name) for CAN_MO133_AMR.
* To use register names with standard convension, please use CAN_MO133_AMR.
*/
#define	CAN_MOAMR133	(CAN_MO133_AMR)

/** \brief  20B8, Message Object  Arbitration Register */
#define CAN_MO133_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A0B8u)

/** Alias (User Manual Name) for CAN_MO133_AR.
* To use register names with standard convension, please use CAN_MO133_AR.
*/
#define	CAN_MOAR133	(CAN_MO133_AR)

/** \brief  20BC, Message Object  Control Register */
#define CAN_MO133_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A0BCu)

/** Alias (User Manual Name) for CAN_MO133_CTR.
* To use register names with standard convension, please use CAN_MO133_CTR.
*/
#define	CAN_MOCTR133	(CAN_MO133_CTR)

/** \brief  20B4, Message Object  Data Register High */
#define CAN_MO133_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A0B4u)

/** Alias (User Manual Name) for CAN_MO133_DATAH.
* To use register names with standard convension, please use CAN_MO133_DATAH.
*/
#define	CAN_MODATAH133	(CAN_MO133_DATAH)

/** \brief  20B0, Message Object  Data Register Low */
#define CAN_MO133_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A0B0u)

/** Alias (User Manual Name) for CAN_MO133_DATAL.
* To use register names with standard convension, please use CAN_MO133_DATAL.
*/
#define	CAN_MODATAL133	(CAN_MO133_DATAL)

/** \brief  20A0, Message Object  Function Control Register */
#define CAN_MO133_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A0A0u)

/** Alias (User Manual Name) for CAN_MO133_EDATA0.
* To use register names with standard convension, please use CAN_MO133_EDATA0.
*/
#define	CAN_EMO133DATA0	(CAN_MO133_EDATA0)

/** \brief  20A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO133_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A0A4u)

/** Alias (User Manual Name) for CAN_MO133_EDATA1.
* To use register names with standard convension, please use CAN_MO133_EDATA1.
*/
#define	CAN_EMO133DATA1	(CAN_MO133_EDATA1)

/** \brief  20A8, Message Object  Interrupt Pointer Register */
#define CAN_MO133_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A0A8u)

/** Alias (User Manual Name) for CAN_MO133_EDATA2.
* To use register names with standard convension, please use CAN_MO133_EDATA2.
*/
#define	CAN_EMO133DATA2	(CAN_MO133_EDATA2)

/** \brief  20AC, Message Object  Acceptance Mask Register */
#define CAN_MO133_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A0ACu)

/** Alias (User Manual Name) for CAN_MO133_EDATA3.
* To use register names with standard convension, please use CAN_MO133_EDATA3.
*/
#define	CAN_EMO133DATA3	(CAN_MO133_EDATA3)

/** \brief  20B0, Message Object  Data Register Low */
#define CAN_MO133_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A0B0u)

/** Alias (User Manual Name) for CAN_MO133_EDATA4.
* To use register names with standard convension, please use CAN_MO133_EDATA4.
*/
#define	CAN_EMO133DATA4	(CAN_MO133_EDATA4)

/** \brief  20B4, Message Object  Data Register High */
#define CAN_MO133_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A0B4u)

/** Alias (User Manual Name) for CAN_MO133_EDATA5.
* To use register names with standard convension, please use CAN_MO133_EDATA5.
*/
#define	CAN_EMO133DATA5	(CAN_MO133_EDATA5)

/** \brief  20B8, Message Object  Arbitration Register */
#define CAN_MO133_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A0B8u)

/** Alias (User Manual Name) for CAN_MO133_EDATA6.
* To use register names with standard convension, please use CAN_MO133_EDATA6.
*/
#define	CAN_EMO133DATA6	(CAN_MO133_EDATA6)

/** \brief  20A0, Message Object  Function Control Register */
#define CAN_MO133_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A0A0u)

/** Alias (User Manual Name) for CAN_MO133_FCR.
* To use register names with standard convension, please use CAN_MO133_FCR.
*/
#define	CAN_MOFCR133	(CAN_MO133_FCR)

/** \brief  20A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO133_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A0A4u)

/** Alias (User Manual Name) for CAN_MO133_FGPR.
* To use register names with standard convension, please use CAN_MO133_FGPR.
*/
#define	CAN_MOFGPR133	(CAN_MO133_FGPR)

/** \brief  20A8, Message Object  Interrupt Pointer Register */
#define CAN_MO133_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A0A8u)

/** Alias (User Manual Name) for CAN_MO133_IPR.
* To use register names with standard convension, please use CAN_MO133_IPR.
*/
#define	CAN_MOIPR133	(CAN_MO133_IPR)

/** \brief  20BC, Message Object  Control Register */
#define CAN_MO133_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A0BCu)

/** Alias (User Manual Name) for CAN_MO133_STAT.
* To use register names with standard convension, please use CAN_MO133_STAT.
*/
#define	CAN_MOSTAT133	(CAN_MO133_STAT)

/** \brief  20CC, Message Object  Acceptance Mask Register */
#define CAN_MO134_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A0CCu)

/** Alias (User Manual Name) for CAN_MO134_AMR.
* To use register names with standard convension, please use CAN_MO134_AMR.
*/
#define	CAN_MOAMR134	(CAN_MO134_AMR)

/** \brief  20D8, Message Object  Arbitration Register */
#define CAN_MO134_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A0D8u)

/** Alias (User Manual Name) for CAN_MO134_AR.
* To use register names with standard convension, please use CAN_MO134_AR.
*/
#define	CAN_MOAR134	(CAN_MO134_AR)

/** \brief  20DC, Message Object  Control Register */
#define CAN_MO134_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A0DCu)

/** Alias (User Manual Name) for CAN_MO134_CTR.
* To use register names with standard convension, please use CAN_MO134_CTR.
*/
#define	CAN_MOCTR134	(CAN_MO134_CTR)

/** \brief  20D4, Message Object  Data Register High */
#define CAN_MO134_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A0D4u)

