luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO134_DATAH.
* To use register names with standard convension, please use CAN_MO134_DATAH.
*/
#define	CAN_MODATAH134	(CAN_MO134_DATAH)

/** \brief  20D0, Message Object  Data Register Low */
#define CAN_MO134_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A0D0u)

/** Alias (User Manual Name) for CAN_MO134_DATAL.
* To use register names with standard convension, please use CAN_MO134_DATAL.
*/
#define	CAN_MODATAL134	(CAN_MO134_DATAL)

/** \brief  20C0, Message Object  Function Control Register */
#define CAN_MO134_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A0C0u)

/** Alias (User Manual Name) for CAN_MO134_EDATA0.
* To use register names with standard convension, please use CAN_MO134_EDATA0.
*/
#define	CAN_EMO134DATA0	(CAN_MO134_EDATA0)

/** \brief  20C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO134_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A0C4u)

/** Alias (User Manual Name) for CAN_MO134_EDATA1.
* To use register names with standard convension, please use CAN_MO134_EDATA1.
*/
#define	CAN_EMO134DATA1	(CAN_MO134_EDATA1)

/** \brief  20C8, Message Object  Interrupt Pointer Register */
#define CAN_MO134_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A0C8u)

/** Alias (User Manual Name) for CAN_MO134_EDATA2.
* To use register names with standard convension, please use CAN_MO134_EDATA2.
*/
#define	CAN_EMO134DATA2	(CAN_MO134_EDATA2)

/** \brief  20CC, Message Object  Acceptance Mask Register */
#define CAN_MO134_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A0CCu)

/** Alias (User Manual Name) for CAN_MO134_EDATA3.
* To use register names with standard convension, please use CAN_MO134_EDATA3.
*/
#define	CAN_EMO134DATA3	(CAN_MO134_EDATA3)

/** \brief  20D0, Message Object  Data Register Low */
#define CAN_MO134_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A0D0u)

/** Alias (User Manual Name) for CAN_MO134_EDATA4.
* To use register names with standard convension, please use CAN_MO134_EDATA4.
*/
#define	CAN_EMO134DATA4	(CAN_MO134_EDATA4)

/** \brief  20D4, Message Object  Data Register High */
#define CAN_MO134_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A0D4u)

/** Alias (User Manual Name) for CAN_MO134_EDATA5.
* To use register names with standard convension, please use CAN_MO134_EDATA5.
*/
#define	CAN_EMO134DATA5	(CAN_MO134_EDATA5)

/** \brief  20D8, Message Object  Arbitration Register */
#define CAN_MO134_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A0D8u)

/** Alias (User Manual Name) for CAN_MO134_EDATA6.
* To use register names with standard convension, please use CAN_MO134_EDATA6.
*/
#define	CAN_EMO134DATA6	(CAN_MO134_EDATA6)

/** \brief  20C0, Message Object  Function Control Register */
#define CAN_MO134_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A0C0u)

/** Alias (User Manual Name) for CAN_MO134_FCR.
* To use register names with standard convension, please use CAN_MO134_FCR.
*/
#define	CAN_MOFCR134	(CAN_MO134_FCR)

/** \brief  20C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO134_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A0C4u)

/** Alias (User Manual Name) for CAN_MO134_FGPR.
* To use register names with standard convension, please use CAN_MO134_FGPR.
*/
#define	CAN_MOFGPR134	(CAN_MO134_FGPR)

/** \brief  20C8, Message Object  Interrupt Pointer Register */
#define CAN_MO134_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A0C8u)

/** Alias (User Manual Name) for CAN_MO134_IPR.
* To use register names with standard convension, please use CAN_MO134_IPR.
*/
#define	CAN_MOIPR134	(CAN_MO134_IPR)

/** \brief  20DC, Message Object  Control Register */
#define CAN_MO134_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A0DCu)

/** Alias (User Manual Name) for CAN_MO134_STAT.
* To use register names with standard convension, please use CAN_MO134_STAT.
*/
#define	CAN_MOSTAT134	(CAN_MO134_STAT)

/** \brief  20EC, Message Object  Acceptance Mask Register */
#define CAN_MO135_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A0ECu)

/** Alias (User Manual Name) for CAN_MO135_AMR.
* To use register names with standard convension, please use CAN_MO135_AMR.
*/
#define	CAN_MOAMR135	(CAN_MO135_AMR)

/** \brief  20F8, Message Object  Arbitration Register */
#define CAN_MO135_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A0F8u)

/** Alias (User Manual Name) for CAN_MO135_AR.
* To use register names with standard convension, please use CAN_MO135_AR.
*/
#define	CAN_MOAR135	(CAN_MO135_AR)

/** \brief  20FC, Message Object  Control Register */
#define CAN_MO135_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A0FCu)

/** Alias (User Manual Name) for CAN_MO135_CTR.
* To use register names with standard convension, please use CAN_MO135_CTR.
*/
#define	CAN_MOCTR135	(CAN_MO135_CTR)

/** \brief  20F4, Message Object  Data Register High */
#define CAN_MO135_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A0F4u)

/** Alias (User Manual Name) for CAN_MO135_DATAH.
* To use register names with standard convension, please use CAN_MO135_DATAH.
*/
#define	CAN_MODATAH135	(CAN_MO135_DATAH)

/** \brief  20F0, Message Object  Data Register Low */
#define CAN_MO135_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A0F0u)

/** Alias (User Manual Name) for CAN_MO135_DATAL.
* To use register names with standard convension, please use CAN_MO135_DATAL.
*/
#define	CAN_MODATAL135	(CAN_MO135_DATAL)

/** \brief  20E0, Message Object  Function Control Register */
#define CAN_MO135_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A0E0u)

/** Alias (User Manual Name) for CAN_MO135_EDATA0.
* To use register names with standard convension, please use CAN_MO135_EDATA0.
*/
#define	CAN_EMO135DATA0	(CAN_MO135_EDATA0)

/** \brief  20E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO135_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A0E4u)

/** Alias (User Manual Name) for CAN_MO135_EDATA1.
* To use register names with standard convension, please use CAN_MO135_EDATA1.
*/
#define	CAN_EMO135DATA1	(CAN_MO135_EDATA1)

