luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  20E8, Message Object  Interrupt Pointer Register */
#define CAN_MO135_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A0E8u)

/** Alias (User Manual Name) for CAN_MO135_EDATA2.
* To use register names with standard convension, please use CAN_MO135_EDATA2.
*/
#define	CAN_EMO135DATA2	(CAN_MO135_EDATA2)

/** \brief  20EC, Message Object  Acceptance Mask Register */
#define CAN_MO135_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A0ECu)

/** Alias (User Manual Name) for CAN_MO135_EDATA3.
* To use register names with standard convension, please use CAN_MO135_EDATA3.
*/
#define	CAN_EMO135DATA3	(CAN_MO135_EDATA3)

/** \brief  20F0, Message Object  Data Register Low */
#define CAN_MO135_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A0F0u)

/** Alias (User Manual Name) for CAN_MO135_EDATA4.
* To use register names with standard convension, please use CAN_MO135_EDATA4.
*/
#define	CAN_EMO135DATA4	(CAN_MO135_EDATA4)

/** \brief  20F4, Message Object  Data Register High */
#define CAN_MO135_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A0F4u)

/** Alias (User Manual Name) for CAN_MO135_EDATA5.
* To use register names with standard convension, please use CAN_MO135_EDATA5.
*/
#define	CAN_EMO135DATA5	(CAN_MO135_EDATA5)

/** \brief  20F8, Message Object  Arbitration Register */
#define CAN_MO135_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A0F8u)

/** Alias (User Manual Name) for CAN_MO135_EDATA6.
* To use register names with standard convension, please use CAN_MO135_EDATA6.
*/
#define	CAN_EMO135DATA6	(CAN_MO135_EDATA6)

/** \brief  20E0, Message Object  Function Control Register */
#define CAN_MO135_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A0E0u)

/** Alias (User Manual Name) for CAN_MO135_FCR.
* To use register names with standard convension, please use CAN_MO135_FCR.
*/
#define	CAN_MOFCR135	(CAN_MO135_FCR)

/** \brief  20E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO135_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A0E4u)

/** Alias (User Manual Name) for CAN_MO135_FGPR.
* To use register names with standard convension, please use CAN_MO135_FGPR.
*/
#define	CAN_MOFGPR135	(CAN_MO135_FGPR)

/** \brief  20E8, Message Object  Interrupt Pointer Register */
#define CAN_MO135_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A0E8u)

/** Alias (User Manual Name) for CAN_MO135_IPR.
* To use register names with standard convension, please use CAN_MO135_IPR.
*/
#define	CAN_MOIPR135	(CAN_MO135_IPR)

/** \brief  20FC, Message Object  Control Register */
#define CAN_MO135_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A0FCu)

/** Alias (User Manual Name) for CAN_MO135_STAT.
* To use register names with standard convension, please use CAN_MO135_STAT.
*/
#define	CAN_MOSTAT135	(CAN_MO135_STAT)

/** \brief  210C, Message Object  Acceptance Mask Register */
#define CAN_MO136_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A10Cu)

/** Alias (User Manual Name) for CAN_MO136_AMR.
* To use register names with standard convension, please use CAN_MO136_AMR.
*/
#define	CAN_MOAMR136	(CAN_MO136_AMR)

/** \brief  2118, Message Object  Arbitration Register */
#define CAN_MO136_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A118u)

/** Alias (User Manual Name) for CAN_MO136_AR.
* To use register names with standard convension, please use CAN_MO136_AR.
*/
#define	CAN_MOAR136	(CAN_MO136_AR)

/** \brief  211C, Message Object  Control Register */
#define CAN_MO136_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A11Cu)

/** Alias (User Manual Name) for CAN_MO136_CTR.
* To use register names with standard convension, please use CAN_MO136_CTR.
*/
#define	CAN_MOCTR136	(CAN_MO136_CTR)

/** \brief  2114, Message Object  Data Register High */
#define CAN_MO136_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A114u)

/** Alias (User Manual Name) for CAN_MO136_DATAH.
* To use register names with standard convension, please use CAN_MO136_DATAH.
*/
#define	CAN_MODATAH136	(CAN_MO136_DATAH)

/** \brief  2110, Message Object  Data Register Low */
#define CAN_MO136_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A110u)

/** Alias (User Manual Name) for CAN_MO136_DATAL.
* To use register names with standard convension, please use CAN_MO136_DATAL.
*/
#define	CAN_MODATAL136	(CAN_MO136_DATAL)

/** \brief  2100, Message Object  Function Control Register */
#define CAN_MO136_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A100u)

/** Alias (User Manual Name) for CAN_MO136_EDATA0.
* To use register names with standard convension, please use CAN_MO136_EDATA0.
*/
#define	CAN_EMO136DATA0	(CAN_MO136_EDATA0)

/** \brief  2104, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO136_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A104u)

/** Alias (User Manual Name) for CAN_MO136_EDATA1.
* To use register names with standard convension, please use CAN_MO136_EDATA1.
*/
#define	CAN_EMO136DATA1	(CAN_MO136_EDATA1)

/** \brief  2108, Message Object  Interrupt Pointer Register */
#define CAN_MO136_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A108u)

/** Alias (User Manual Name) for CAN_MO136_EDATA2.
* To use register names with standard convension, please use CAN_MO136_EDATA2.
*/
#define	CAN_EMO136DATA2	(CAN_MO136_EDATA2)

/** \brief  210C, Message Object  Acceptance Mask Register */
#define CAN_MO136_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A10Cu)

/** Alias (User Manual Name) for CAN_MO136_EDATA3.
* To use register names with standard convension, please use CAN_MO136_EDATA3.
*/
#define	CAN_EMO136DATA3	(CAN_MO136_EDATA3)

/** \brief  2110, Message Object  Data Register Low */
#define CAN_MO136_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A110u)

/** Alias (User Manual Name) for CAN_MO136_EDATA4.
* To use register names with standard convension, please use CAN_MO136_EDATA4.
*/
#define	CAN_EMO136DATA4	(CAN_MO136_EDATA4)

/** \brief  2114, Message Object  Data Register High */
#define CAN_MO136_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A114u)

/** Alias (User Manual Name) for CAN_MO136_EDATA5.
* To use register names with standard convension, please use CAN_MO136_EDATA5.
*/
#define	CAN_EMO136DATA5	(CAN_MO136_EDATA5)

/** \brief  2118, Message Object  Arbitration Register */
#define CAN_MO136_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A118u)

/** Alias (User Manual Name) for CAN_MO136_EDATA6.
* To use register names with standard convension, please use CAN_MO136_EDATA6.
*/
#define	CAN_EMO136DATA6	(CAN_MO136_EDATA6)

/** \brief  2100, Message Object  Function Control Register */
#define CAN_MO136_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A100u)

