luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO136_FCR.
* To use register names with standard convension, please use CAN_MO136_FCR.
*/
#define	CAN_MOFCR136	(CAN_MO136_FCR)

/** \brief  2104, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO136_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A104u)

/** Alias (User Manual Name) for CAN_MO136_FGPR.
* To use register names with standard convension, please use CAN_MO136_FGPR.
*/
#define	CAN_MOFGPR136	(CAN_MO136_FGPR)

/** \brief  2108, Message Object  Interrupt Pointer Register */
#define CAN_MO136_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A108u)

/** Alias (User Manual Name) for CAN_MO136_IPR.
* To use register names with standard convension, please use CAN_MO136_IPR.
*/
#define	CAN_MOIPR136	(CAN_MO136_IPR)

/** \brief  211C, Message Object  Control Register */
#define CAN_MO136_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A11Cu)

/** Alias (User Manual Name) for CAN_MO136_STAT.
* To use register names with standard convension, please use CAN_MO136_STAT.
*/
#define	CAN_MOSTAT136	(CAN_MO136_STAT)

/** \brief  212C, Message Object  Acceptance Mask Register */
#define CAN_MO137_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A12Cu)

/** Alias (User Manual Name) for CAN_MO137_AMR.
* To use register names with standard convension, please use CAN_MO137_AMR.
*/
#define	CAN_MOAMR137	(CAN_MO137_AMR)

/** \brief  2138, Message Object  Arbitration Register */
#define CAN_MO137_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A138u)

/** Alias (User Manual Name) for CAN_MO137_AR.
* To use register names with standard convension, please use CAN_MO137_AR.
*/
#define	CAN_MOAR137	(CAN_MO137_AR)

/** \brief  213C, Message Object  Control Register */
#define CAN_MO137_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A13Cu)

/** Alias (User Manual Name) for CAN_MO137_CTR.
* To use register names with standard convension, please use CAN_MO137_CTR.
*/
#define	CAN_MOCTR137	(CAN_MO137_CTR)

/** \brief  2134, Message Object  Data Register High */
#define CAN_MO137_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A134u)

/** Alias (User Manual Name) for CAN_MO137_DATAH.
* To use register names with standard convension, please use CAN_MO137_DATAH.
*/
#define	CAN_MODATAH137	(CAN_MO137_DATAH)

/** \brief  2130, Message Object  Data Register Low */
#define CAN_MO137_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A130u)

/** Alias (User Manual Name) for CAN_MO137_DATAL.
* To use register names with standard convension, please use CAN_MO137_DATAL.
*/
#define	CAN_MODATAL137	(CAN_MO137_DATAL)

/** \brief  2120, Message Object  Function Control Register */
#define CAN_MO137_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A120u)

/** Alias (User Manual Name) for CAN_MO137_EDATA0.
* To use register names with standard convension, please use CAN_MO137_EDATA0.
*/
#define	CAN_EMO137DATA0	(CAN_MO137_EDATA0)

/** \brief  2124, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO137_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A124u)

/** Alias (User Manual Name) for CAN_MO137_EDATA1.
* To use register names with standard convension, please use CAN_MO137_EDATA1.
*/
#define	CAN_EMO137DATA1	(CAN_MO137_EDATA1)

/** \brief  2128, Message Object  Interrupt Pointer Register */
#define CAN_MO137_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A128u)

/** Alias (User Manual Name) for CAN_MO137_EDATA2.
* To use register names with standard convension, please use CAN_MO137_EDATA2.
*/
#define	CAN_EMO137DATA2	(CAN_MO137_EDATA2)

/** \brief  212C, Message Object  Acceptance Mask Register */
#define CAN_MO137_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A12Cu)

/** Alias (User Manual Name) for CAN_MO137_EDATA3.
* To use register names with standard convension, please use CAN_MO137_EDATA3.
*/
#define	CAN_EMO137DATA3	(CAN_MO137_EDATA3)

/** \brief  2130, Message Object  Data Register Low */
#define CAN_MO137_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A130u)

/** Alias (User Manual Name) for CAN_MO137_EDATA4.
* To use register names with standard convension, please use CAN_MO137_EDATA4.
*/
#define	CAN_EMO137DATA4	(CAN_MO137_EDATA4)

/** \brief  2134, Message Object  Data Register High */
#define CAN_MO137_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A134u)

/** Alias (User Manual Name) for CAN_MO137_EDATA5.
* To use register names with standard convension, please use CAN_MO137_EDATA5.
*/
#define	CAN_EMO137DATA5	(CAN_MO137_EDATA5)

/** \brief  2138, Message Object  Arbitration Register */
#define CAN_MO137_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A138u)

/** Alias (User Manual Name) for CAN_MO137_EDATA6.
* To use register names with standard convension, please use CAN_MO137_EDATA6.
*/
#define	CAN_EMO137DATA6	(CAN_MO137_EDATA6)

/** \brief  2120, Message Object  Function Control Register */
#define CAN_MO137_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A120u)

/** Alias (User Manual Name) for CAN_MO137_FCR.
* To use register names with standard convension, please use CAN_MO137_FCR.
*/
#define	CAN_MOFCR137	(CAN_MO137_FCR)

/** \brief  2124, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO137_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A124u)

/** Alias (User Manual Name) for CAN_MO137_FGPR.
* To use register names with standard convension, please use CAN_MO137_FGPR.
*/
#define	CAN_MOFGPR137	(CAN_MO137_FGPR)

/** \brief  2128, Message Object  Interrupt Pointer Register */
#define CAN_MO137_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A128u)

/** Alias (User Manual Name) for CAN_MO137_IPR.
* To use register names with standard convension, please use CAN_MO137_IPR.
*/
#define	CAN_MOIPR137	(CAN_MO137_IPR)

/** \brief  213C, Message Object  Control Register */
#define CAN_MO137_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A13Cu)

/** Alias (User Manual Name) for CAN_MO137_STAT.
* To use register names with standard convension, please use CAN_MO137_STAT.
*/
#define	CAN_MOSTAT137	(CAN_MO137_STAT)

/** \brief  214C, Message Object  Acceptance Mask Register */
#define CAN_MO138_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A14Cu)

/** Alias (User Manual Name) for CAN_MO138_AMR.
* To use register names with standard convension, please use CAN_MO138_AMR.
*/
#define	CAN_MOAMR138	(CAN_MO138_AMR)

