luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2158, Message Object  Arbitration Register */
#define CAN_MO138_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A158u)

/** Alias (User Manual Name) for CAN_MO138_AR.
* To use register names with standard convension, please use CAN_MO138_AR.
*/
#define	CAN_MOAR138	(CAN_MO138_AR)

/** \brief  215C, Message Object  Control Register */
#define CAN_MO138_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A15Cu)

/** Alias (User Manual Name) for CAN_MO138_CTR.
* To use register names with standard convension, please use CAN_MO138_CTR.
*/
#define	CAN_MOCTR138	(CAN_MO138_CTR)

/** \brief  2154, Message Object  Data Register High */
#define CAN_MO138_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A154u)

/** Alias (User Manual Name) for CAN_MO138_DATAH.
* To use register names with standard convension, please use CAN_MO138_DATAH.
*/
#define	CAN_MODATAH138	(CAN_MO138_DATAH)

/** \brief  2150, Message Object  Data Register Low */
#define CAN_MO138_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A150u)

/** Alias (User Manual Name) for CAN_MO138_DATAL.
* To use register names with standard convension, please use CAN_MO138_DATAL.
*/
#define	CAN_MODATAL138	(CAN_MO138_DATAL)

/** \brief  2140, Message Object  Function Control Register */
#define CAN_MO138_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A140u)

/** Alias (User Manual Name) for CAN_MO138_EDATA0.
* To use register names with standard convension, please use CAN_MO138_EDATA0.
*/
#define	CAN_EMO138DATA0	(CAN_MO138_EDATA0)

/** \brief  2144, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO138_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A144u)

/** Alias (User Manual Name) for CAN_MO138_EDATA1.
* To use register names with standard convension, please use CAN_MO138_EDATA1.
*/
#define	CAN_EMO138DATA1	(CAN_MO138_EDATA1)

/** \brief  2148, Message Object  Interrupt Pointer Register */
#define CAN_MO138_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A148u)

/** Alias (User Manual Name) for CAN_MO138_EDATA2.
* To use register names with standard convension, please use CAN_MO138_EDATA2.
*/
#define	CAN_EMO138DATA2	(CAN_MO138_EDATA2)

/** \brief  214C, Message Object  Acceptance Mask Register */
#define CAN_MO138_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A14Cu)

/** Alias (User Manual Name) for CAN_MO138_EDATA3.
* To use register names with standard convension, please use CAN_MO138_EDATA3.
*/
#define	CAN_EMO138DATA3	(CAN_MO138_EDATA3)

/** \brief  2150, Message Object  Data Register Low */
#define CAN_MO138_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A150u)

/** Alias (User Manual Name) for CAN_MO138_EDATA4.
* To use register names with standard convension, please use CAN_MO138_EDATA4.
*/
#define	CAN_EMO138DATA4	(CAN_MO138_EDATA4)

/** \brief  2154, Message Object  Data Register High */
#define CAN_MO138_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A154u)

/** Alias (User Manual Name) for CAN_MO138_EDATA5.
* To use register names with standard convension, please use CAN_MO138_EDATA5.
*/
#define	CAN_EMO138DATA5	(CAN_MO138_EDATA5)

/** \brief  2158, Message Object  Arbitration Register */
#define CAN_MO138_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A158u)

/** Alias (User Manual Name) for CAN_MO138_EDATA6.
* To use register names with standard convension, please use CAN_MO138_EDATA6.
*/
#define	CAN_EMO138DATA6	(CAN_MO138_EDATA6)

/** \brief  2140, Message Object  Function Control Register */
#define CAN_MO138_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A140u)

/** Alias (User Manual Name) for CAN_MO138_FCR.
* To use register names with standard convension, please use CAN_MO138_FCR.
*/
#define	CAN_MOFCR138	(CAN_MO138_FCR)

/** \brief  2144, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO138_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A144u)

/** Alias (User Manual Name) for CAN_MO138_FGPR.
* To use register names with standard convension, please use CAN_MO138_FGPR.
*/
#define	CAN_MOFGPR138	(CAN_MO138_FGPR)

/** \brief  2148, Message Object  Interrupt Pointer Register */
#define CAN_MO138_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A148u)

/** Alias (User Manual Name) for CAN_MO138_IPR.
* To use register names with standard convension, please use CAN_MO138_IPR.
*/
#define	CAN_MOIPR138	(CAN_MO138_IPR)

/** \brief  215C, Message Object  Control Register */
#define CAN_MO138_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A15Cu)

/** Alias (User Manual Name) for CAN_MO138_STAT.
* To use register names with standard convension, please use CAN_MO138_STAT.
*/
#define	CAN_MOSTAT138	(CAN_MO138_STAT)

/** \brief  216C, Message Object  Acceptance Mask Register */
#define CAN_MO139_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A16Cu)

/** Alias (User Manual Name) for CAN_MO139_AMR.
* To use register names with standard convension, please use CAN_MO139_AMR.
*/
#define	CAN_MOAMR139	(CAN_MO139_AMR)

/** \brief  2178, Message Object  Arbitration Register */
#define CAN_MO139_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A178u)

/** Alias (User Manual Name) for CAN_MO139_AR.
* To use register names with standard convension, please use CAN_MO139_AR.
*/
#define	CAN_MOAR139	(CAN_MO139_AR)

/** \brief  217C, Message Object  Control Register */
#define CAN_MO139_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A17Cu)

/** Alias (User Manual Name) for CAN_MO139_CTR.
* To use register names with standard convension, please use CAN_MO139_CTR.
*/
#define	CAN_MOCTR139	(CAN_MO139_CTR)

/** \brief  2174, Message Object  Data Register High */
#define CAN_MO139_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A174u)

/** Alias (User Manual Name) for CAN_MO139_DATAH.
* To use register names with standard convension, please use CAN_MO139_DATAH.
*/
#define	CAN_MODATAH139	(CAN_MO139_DATAH)

/** \brief  2170, Message Object  Data Register Low */
#define CAN_MO139_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A170u)

/** Alias (User Manual Name) for CAN_MO139_DATAL.
* To use register names with standard convension, please use CAN_MO139_DATAL.
*/
#define	CAN_MODATAL139	(CAN_MO139_DATAL)

/** \brief  2160, Message Object  Function Control Register */
#define CAN_MO139_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A160u)

/** Alias (User Manual Name) for CAN_MO139_EDATA0.
* To use register names with standard convension, please use CAN_MO139_EDATA0.
*/
#define	CAN_EMO139DATA0	(CAN_MO139_EDATA0)

/** \brief  2164, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO139_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A164u)

/** Alias (User Manual Name) for CAN_MO139_EDATA1.
* To use register names with standard convension, please use CAN_MO139_EDATA1.
*/
#define	CAN_EMO139DATA1	(CAN_MO139_EDATA1)

