luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2168, Message Object  Interrupt Pointer Register */
#define CAN_MO139_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A168u)

/** Alias (User Manual Name) for CAN_MO139_EDATA2.
* To use register names with standard convension, please use CAN_MO139_EDATA2.
*/
#define	CAN_EMO139DATA2	(CAN_MO139_EDATA2)

/** \brief  216C, Message Object  Acceptance Mask Register */
#define CAN_MO139_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A16Cu)

/** Alias (User Manual Name) for CAN_MO139_EDATA3.
* To use register names with standard convension, please use CAN_MO139_EDATA3.
*/
#define	CAN_EMO139DATA3	(CAN_MO139_EDATA3)

/** \brief  2170, Message Object  Data Register Low */
#define CAN_MO139_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A170u)

/** Alias (User Manual Name) for CAN_MO139_EDATA4.
* To use register names with standard convension, please use CAN_MO139_EDATA4.
*/
#define	CAN_EMO139DATA4	(CAN_MO139_EDATA4)

/** \brief  2174, Message Object  Data Register High */
#define CAN_MO139_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A174u)

/** Alias (User Manual Name) for CAN_MO139_EDATA5.
* To use register names with standard convension, please use CAN_MO139_EDATA5.
*/
#define	CAN_EMO139DATA5	(CAN_MO139_EDATA5)

/** \brief  2178, Message Object  Arbitration Register */
#define CAN_MO139_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A178u)

/** Alias (User Manual Name) for CAN_MO139_EDATA6.
* To use register names with standard convension, please use CAN_MO139_EDATA6.
*/
#define	CAN_EMO139DATA6	(CAN_MO139_EDATA6)

/** \brief  2160, Message Object  Function Control Register */
#define CAN_MO139_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A160u)

/** Alias (User Manual Name) for CAN_MO139_FCR.
* To use register names with standard convension, please use CAN_MO139_FCR.
*/
#define	CAN_MOFCR139	(CAN_MO139_FCR)

/** \brief  2164, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO139_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A164u)

/** Alias (User Manual Name) for CAN_MO139_FGPR.
* To use register names with standard convension, please use CAN_MO139_FGPR.
*/
#define	CAN_MOFGPR139	(CAN_MO139_FGPR)

/** \brief  2168, Message Object  Interrupt Pointer Register */
#define CAN_MO139_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A168u)

/** Alias (User Manual Name) for CAN_MO139_IPR.
* To use register names with standard convension, please use CAN_MO139_IPR.
*/
#define	CAN_MOIPR139	(CAN_MO139_IPR)

/** \brief  217C, Message Object  Control Register */
#define CAN_MO139_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A17Cu)

/** Alias (User Manual Name) for CAN_MO139_STAT.
* To use register names with standard convension, please use CAN_MO139_STAT.
*/
#define	CAN_MOSTAT139	(CAN_MO139_STAT)

/** \brief  11AC, Message Object  Acceptance Mask Register */
#define CAN_MO13_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00191ACu)

/** Alias (User Manual Name) for CAN_MO13_AMR.
* To use register names with standard convension, please use CAN_MO13_AMR.
*/
#define	CAN_MOAMR13	(CAN_MO13_AMR)

/** \brief  11B8, Message Object  Arbitration Register */
#define CAN_MO13_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00191B8u)

/** Alias (User Manual Name) for CAN_MO13_AR.
* To use register names with standard convension, please use CAN_MO13_AR.
*/
#define	CAN_MOAR13	(CAN_MO13_AR)

/** \brief  11BC, Message Object  Control Register */
#define CAN_MO13_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00191BCu)

/** Alias (User Manual Name) for CAN_MO13_CTR.
* To use register names with standard convension, please use CAN_MO13_CTR.
*/
#define	CAN_MOCTR13	(CAN_MO13_CTR)

/** \brief  11B4, Message Object  Data Register High */
#define CAN_MO13_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00191B4u)

/** Alias (User Manual Name) for CAN_MO13_DATAH.
* To use register names with standard convension, please use CAN_MO13_DATAH.
*/
#define	CAN_MODATAH13	(CAN_MO13_DATAH)

/** \brief  11B0, Message Object  Data Register Low */
#define CAN_MO13_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00191B0u)

/** Alias (User Manual Name) for CAN_MO13_DATAL.
* To use register names with standard convension, please use CAN_MO13_DATAL.
*/
#define	CAN_MODATAL13	(CAN_MO13_DATAL)

/** \brief  11A0, Message Object  Function Control Register */
#define CAN_MO13_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00191A0u)

/** Alias (User Manual Name) for CAN_MO13_EDATA0.
* To use register names with standard convension, please use CAN_MO13_EDATA0.
*/
#define	CAN_EMO13DATA0	(CAN_MO13_EDATA0)

/** \brief  11A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO13_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00191A4u)

/** Alias (User Manual Name) for CAN_MO13_EDATA1.
* To use register names with standard convension, please use CAN_MO13_EDATA1.
*/
#define	CAN_EMO13DATA1	(CAN_MO13_EDATA1)

/** \brief  11A8, Message Object  Interrupt Pointer Register */
#define CAN_MO13_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00191A8u)

/** Alias (User Manual Name) for CAN_MO13_EDATA2.
* To use register names with standard convension, please use CAN_MO13_EDATA2.
*/
#define	CAN_EMO13DATA2	(CAN_MO13_EDATA2)

/** \brief  11AC, Message Object  Acceptance Mask Register */
#define CAN_MO13_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00191ACu)

/** Alias (User Manual Name) for CAN_MO13_EDATA3.
* To use register names with standard convension, please use CAN_MO13_EDATA3.
*/
#define	CAN_EMO13DATA3	(CAN_MO13_EDATA3)

/** \brief  11B0, Message Object  Data Register Low */
#define CAN_MO13_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00191B0u)

/** Alias (User Manual Name) for CAN_MO13_EDATA4.
* To use register names with standard convension, please use CAN_MO13_EDATA4.
*/
#define	CAN_EMO13DATA4	(CAN_MO13_EDATA4)

/** \brief  11B4, Message Object  Data Register High */
#define CAN_MO13_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00191B4u)

/** Alias (User Manual Name) for CAN_MO13_EDATA5.
* To use register names with standard convension, please use CAN_MO13_EDATA5.
*/
#define	CAN_EMO13DATA5	(CAN_MO13_EDATA5)

/** \brief  11B8, Message Object  Arbitration Register */
#define CAN_MO13_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00191B8u)

/** Alias (User Manual Name) for CAN_MO13_EDATA6.
* To use register names with standard convension, please use CAN_MO13_EDATA6.
*/
#define	CAN_EMO13DATA6	(CAN_MO13_EDATA6)

