luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  11A0, Message Object  Function Control Register */
#define CAN_MO13_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00191A0u)

/** Alias (User Manual Name) for CAN_MO13_FCR.
* To use register names with standard convension, please use CAN_MO13_FCR.
*/
#define	CAN_MOFCR13	(CAN_MO13_FCR)

/** \brief  11A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO13_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00191A4u)

/** Alias (User Manual Name) for CAN_MO13_FGPR.
* To use register names with standard convension, please use CAN_MO13_FGPR.
*/
#define	CAN_MOFGPR13	(CAN_MO13_FGPR)

/** \brief  11A8, Message Object  Interrupt Pointer Register */
#define CAN_MO13_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00191A8u)

/** Alias (User Manual Name) for CAN_MO13_IPR.
* To use register names with standard convension, please use CAN_MO13_IPR.
*/
#define	CAN_MOIPR13	(CAN_MO13_IPR)

/** \brief  11BC, Message Object  Control Register */
#define CAN_MO13_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00191BCu)

/** Alias (User Manual Name) for CAN_MO13_STAT.
* To use register names with standard convension, please use CAN_MO13_STAT.
*/
#define	CAN_MOSTAT13	(CAN_MO13_STAT)

/** \brief  218C, Message Object  Acceptance Mask Register */
#define CAN_MO140_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A18Cu)

/** Alias (User Manual Name) for CAN_MO140_AMR.
* To use register names with standard convension, please use CAN_MO140_AMR.
*/
#define	CAN_MOAMR140	(CAN_MO140_AMR)

/** \brief  2198, Message Object  Arbitration Register */
#define CAN_MO140_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A198u)

/** Alias (User Manual Name) for CAN_MO140_AR.
* To use register names with standard convension, please use CAN_MO140_AR.
*/
#define	CAN_MOAR140	(CAN_MO140_AR)

/** \brief  219C, Message Object  Control Register */
#define CAN_MO140_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A19Cu)

/** Alias (User Manual Name) for CAN_MO140_CTR.
* To use register names with standard convension, please use CAN_MO140_CTR.
*/
#define	CAN_MOCTR140	(CAN_MO140_CTR)

/** \brief  2194, Message Object  Data Register High */
#define CAN_MO140_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A194u)

/** Alias (User Manual Name) for CAN_MO140_DATAH.
* To use register names with standard convension, please use CAN_MO140_DATAH.
*/
#define	CAN_MODATAH140	(CAN_MO140_DATAH)

/** \brief  2190, Message Object  Data Register Low */
#define CAN_MO140_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A190u)

/** Alias (User Manual Name) for CAN_MO140_DATAL.
* To use register names with standard convension, please use CAN_MO140_DATAL.
*/
#define	CAN_MODATAL140	(CAN_MO140_DATAL)

/** \brief  2180, Message Object  Function Control Register */
#define CAN_MO140_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A180u)

/** Alias (User Manual Name) for CAN_MO140_EDATA0.
* To use register names with standard convension, please use CAN_MO140_EDATA0.
*/
#define	CAN_EMO140DATA0	(CAN_MO140_EDATA0)

/** \brief  2184, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO140_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A184u)

/** Alias (User Manual Name) for CAN_MO140_EDATA1.
* To use register names with standard convension, please use CAN_MO140_EDATA1.
*/
#define	CAN_EMO140DATA1	(CAN_MO140_EDATA1)

/** \brief  2188, Message Object  Interrupt Pointer Register */
#define CAN_MO140_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A188u)

/** Alias (User Manual Name) for CAN_MO140_EDATA2.
* To use register names with standard convension, please use CAN_MO140_EDATA2.
*/
#define	CAN_EMO140DATA2	(CAN_MO140_EDATA2)

/** \brief  218C, Message Object  Acceptance Mask Register */
#define CAN_MO140_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A18Cu)

/** Alias (User Manual Name) for CAN_MO140_EDATA3.
* To use register names with standard convension, please use CAN_MO140_EDATA3.
*/
#define	CAN_EMO140DATA3	(CAN_MO140_EDATA3)

/** \brief  2190, Message Object  Data Register Low */
#define CAN_MO140_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A190u)

/** Alias (User Manual Name) for CAN_MO140_EDATA4.
* To use register names with standard convension, please use CAN_MO140_EDATA4.
*/
#define	CAN_EMO140DATA4	(CAN_MO140_EDATA4)

/** \brief  2194, Message Object  Data Register High */
#define CAN_MO140_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A194u)

/** Alias (User Manual Name) for CAN_MO140_EDATA5.
* To use register names with standard convension, please use CAN_MO140_EDATA5.
*/
#define	CAN_EMO140DATA5	(CAN_MO140_EDATA5)

/** \brief  2198, Message Object  Arbitration Register */
#define CAN_MO140_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A198u)

/** Alias (User Manual Name) for CAN_MO140_EDATA6.
* To use register names with standard convension, please use CAN_MO140_EDATA6.
*/
#define	CAN_EMO140DATA6	(CAN_MO140_EDATA6)

/** \brief  2180, Message Object  Function Control Register */
#define CAN_MO140_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A180u)

/** Alias (User Manual Name) for CAN_MO140_FCR.
* To use register names with standard convension, please use CAN_MO140_FCR.
*/
#define	CAN_MOFCR140	(CAN_MO140_FCR)

/** \brief  2184, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO140_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A184u)

/** Alias (User Manual Name) for CAN_MO140_FGPR.
* To use register names with standard convension, please use CAN_MO140_FGPR.
*/
#define	CAN_MOFGPR140	(CAN_MO140_FGPR)

/** \brief  2188, Message Object  Interrupt Pointer Register */
#define CAN_MO140_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A188u)

/** Alias (User Manual Name) for CAN_MO140_IPR.
* To use register names with standard convension, please use CAN_MO140_IPR.
*/
#define	CAN_MOIPR140	(CAN_MO140_IPR)

/** \brief  219C, Message Object  Control Register */
#define CAN_MO140_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A19Cu)

