luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO140_STAT.
* To use register names with standard convension, please use CAN_MO140_STAT.
*/
#define	CAN_MOSTAT140	(CAN_MO140_STAT)

/** \brief  21AC, Message Object  Acceptance Mask Register */
#define CAN_MO141_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A1ACu)

/** Alias (User Manual Name) for CAN_MO141_AMR.
* To use register names with standard convension, please use CAN_MO141_AMR.
*/
#define	CAN_MOAMR141	(CAN_MO141_AMR)

/** \brief  21B8, Message Object  Arbitration Register */
#define CAN_MO141_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A1B8u)

/** Alias (User Manual Name) for CAN_MO141_AR.
* To use register names with standard convension, please use CAN_MO141_AR.
*/
#define	CAN_MOAR141	(CAN_MO141_AR)

/** \brief  21BC, Message Object  Control Register */
#define CAN_MO141_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A1BCu)

/** Alias (User Manual Name) for CAN_MO141_CTR.
* To use register names with standard convension, please use CAN_MO141_CTR.
*/
#define	CAN_MOCTR141	(CAN_MO141_CTR)

/** \brief  21B4, Message Object  Data Register High */
#define CAN_MO141_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A1B4u)

/** Alias (User Manual Name) for CAN_MO141_DATAH.
* To use register names with standard convension, please use CAN_MO141_DATAH.
*/
#define	CAN_MODATAH141	(CAN_MO141_DATAH)

/** \brief  21B0, Message Object  Data Register Low */
#define CAN_MO141_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A1B0u)

/** Alias (User Manual Name) for CAN_MO141_DATAL.
* To use register names with standard convension, please use CAN_MO141_DATAL.
*/
#define	CAN_MODATAL141	(CAN_MO141_DATAL)

/** \brief  21A0, Message Object  Function Control Register */
#define CAN_MO141_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A1A0u)

/** Alias (User Manual Name) for CAN_MO141_EDATA0.
* To use register names with standard convension, please use CAN_MO141_EDATA0.
*/
#define	CAN_EMO141DATA0	(CAN_MO141_EDATA0)

/** \brief  21A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO141_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A1A4u)

/** Alias (User Manual Name) for CAN_MO141_EDATA1.
* To use register names with standard convension, please use CAN_MO141_EDATA1.
*/
#define	CAN_EMO141DATA1	(CAN_MO141_EDATA1)

/** \brief  21A8, Message Object  Interrupt Pointer Register */
#define CAN_MO141_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A1A8u)

/** Alias (User Manual Name) for CAN_MO141_EDATA2.
* To use register names with standard convension, please use CAN_MO141_EDATA2.
*/
#define	CAN_EMO141DATA2	(CAN_MO141_EDATA2)

/** \brief  21AC, Message Object  Acceptance Mask Register */
#define CAN_MO141_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A1ACu)

/** Alias (User Manual Name) for CAN_MO141_EDATA3.
* To use register names with standard convension, please use CAN_MO141_EDATA3.
*/
#define	CAN_EMO141DATA3	(CAN_MO141_EDATA3)

/** \brief  21B0, Message Object  Data Register Low */
#define CAN_MO141_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A1B0u)

/** Alias (User Manual Name) for CAN_MO141_EDATA4.
* To use register names with standard convension, please use CAN_MO141_EDATA4.
*/
#define	CAN_EMO141DATA4	(CAN_MO141_EDATA4)

/** \brief  21B4, Message Object  Data Register High */
#define CAN_MO141_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A1B4u)

/** Alias (User Manual Name) for CAN_MO141_EDATA5.
* To use register names with standard convension, please use CAN_MO141_EDATA5.
*/
#define	CAN_EMO141DATA5	(CAN_MO141_EDATA5)

/** \brief  21B8, Message Object  Arbitration Register */
#define CAN_MO141_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A1B8u)

/** Alias (User Manual Name) for CAN_MO141_EDATA6.
* To use register names with standard convension, please use CAN_MO141_EDATA6.
*/
#define	CAN_EMO141DATA6	(CAN_MO141_EDATA6)

/** \brief  21A0, Message Object  Function Control Register */
#define CAN_MO141_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A1A0u)

/** Alias (User Manual Name) for CAN_MO141_FCR.
* To use register names with standard convension, please use CAN_MO141_FCR.
*/
#define	CAN_MOFCR141	(CAN_MO141_FCR)

/** \brief  21A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO141_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A1A4u)

/** Alias (User Manual Name) for CAN_MO141_FGPR.
* To use register names with standard convension, please use CAN_MO141_FGPR.
*/
#define	CAN_MOFGPR141	(CAN_MO141_FGPR)

/** \brief  21A8, Message Object  Interrupt Pointer Register */
#define CAN_MO141_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A1A8u)

/** Alias (User Manual Name) for CAN_MO141_IPR.
* To use register names with standard convension, please use CAN_MO141_IPR.
*/
#define	CAN_MOIPR141	(CAN_MO141_IPR)

/** \brief  21BC, Message Object  Control Register */
#define CAN_MO141_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A1BCu)

/** Alias (User Manual Name) for CAN_MO141_STAT.
* To use register names with standard convension, please use CAN_MO141_STAT.
*/
#define	CAN_MOSTAT141	(CAN_MO141_STAT)

/** \brief  21CC, Message Object  Acceptance Mask Register */
#define CAN_MO142_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A1CCu)

/** Alias (User Manual Name) for CAN_MO142_AMR.
* To use register names with standard convension, please use CAN_MO142_AMR.
*/
#define	CAN_MOAMR142	(CAN_MO142_AMR)

/** \brief  21D8, Message Object  Arbitration Register */
#define CAN_MO142_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A1D8u)

/** Alias (User Manual Name) for CAN_MO142_AR.
* To use register names with standard convension, please use CAN_MO142_AR.
*/
#define	CAN_MOAR142	(CAN_MO142_AR)

/** \brief  21DC, Message Object  Control Register */
#define CAN_MO142_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A1DCu)

/** Alias (User Manual Name) for CAN_MO142_CTR.
* To use register names with standard convension, please use CAN_MO142_CTR.
*/
#define	CAN_MOCTR142	(CAN_MO142_CTR)

