luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  21D4, Message Object  Data Register High */
#define CAN_MO142_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A1D4u)

/** Alias (User Manual Name) for CAN_MO142_DATAH.
* To use register names with standard convension, please use CAN_MO142_DATAH.
*/
#define	CAN_MODATAH142	(CAN_MO142_DATAH)

/** \brief  21D0, Message Object  Data Register Low */
#define CAN_MO142_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A1D0u)

/** Alias (User Manual Name) for CAN_MO142_DATAL.
* To use register names with standard convension, please use CAN_MO142_DATAL.
*/
#define	CAN_MODATAL142	(CAN_MO142_DATAL)

/** \brief  21C0, Message Object  Function Control Register */
#define CAN_MO142_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A1C0u)

/** Alias (User Manual Name) for CAN_MO142_EDATA0.
* To use register names with standard convension, please use CAN_MO142_EDATA0.
*/
#define	CAN_EMO142DATA0	(CAN_MO142_EDATA0)

/** \brief  21C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO142_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A1C4u)

/** Alias (User Manual Name) for CAN_MO142_EDATA1.
* To use register names with standard convension, please use CAN_MO142_EDATA1.
*/
#define	CAN_EMO142DATA1	(CAN_MO142_EDATA1)

/** \brief  21C8, Message Object  Interrupt Pointer Register */
#define CAN_MO142_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A1C8u)

/** Alias (User Manual Name) for CAN_MO142_EDATA2.
* To use register names with standard convension, please use CAN_MO142_EDATA2.
*/
#define	CAN_EMO142DATA2	(CAN_MO142_EDATA2)

/** \brief  21CC, Message Object  Acceptance Mask Register */
#define CAN_MO142_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A1CCu)

/** Alias (User Manual Name) for CAN_MO142_EDATA3.
* To use register names with standard convension, please use CAN_MO142_EDATA3.
*/
#define	CAN_EMO142DATA3	(CAN_MO142_EDATA3)

/** \brief  21D0, Message Object  Data Register Low */
#define CAN_MO142_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A1D0u)

/** Alias (User Manual Name) for CAN_MO142_EDATA4.
* To use register names with standard convension, please use CAN_MO142_EDATA4.
*/
#define	CAN_EMO142DATA4	(CAN_MO142_EDATA4)

/** \brief  21D4, Message Object  Data Register High */
#define CAN_MO142_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A1D4u)

/** Alias (User Manual Name) for CAN_MO142_EDATA5.
* To use register names with standard convension, please use CAN_MO142_EDATA5.
*/
#define	CAN_EMO142DATA5	(CAN_MO142_EDATA5)

/** \brief  21D8, Message Object  Arbitration Register */
#define CAN_MO142_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A1D8u)

/** Alias (User Manual Name) for CAN_MO142_EDATA6.
* To use register names with standard convension, please use CAN_MO142_EDATA6.
*/
#define	CAN_EMO142DATA6	(CAN_MO142_EDATA6)

/** \brief  21C0, Message Object  Function Control Register */
#define CAN_MO142_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A1C0u)

/** Alias (User Manual Name) for CAN_MO142_FCR.
* To use register names with standard convension, please use CAN_MO142_FCR.
*/
#define	CAN_MOFCR142	(CAN_MO142_FCR)

/** \brief  21C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO142_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A1C4u)

/** Alias (User Manual Name) for CAN_MO142_FGPR.
* To use register names with standard convension, please use CAN_MO142_FGPR.
*/
#define	CAN_MOFGPR142	(CAN_MO142_FGPR)

/** \brief  21C8, Message Object  Interrupt Pointer Register */
#define CAN_MO142_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A1C8u)

/** Alias (User Manual Name) for CAN_MO142_IPR.
* To use register names with standard convension, please use CAN_MO142_IPR.
*/
#define	CAN_MOIPR142	(CAN_MO142_IPR)

/** \brief  21DC, Message Object  Control Register */
#define CAN_MO142_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A1DCu)

/** Alias (User Manual Name) for CAN_MO142_STAT.
* To use register names with standard convension, please use CAN_MO142_STAT.
*/
#define	CAN_MOSTAT142	(CAN_MO142_STAT)

/** \brief  21EC, Message Object  Acceptance Mask Register */
#define CAN_MO143_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A1ECu)

/** Alias (User Manual Name) for CAN_MO143_AMR.
* To use register names with standard convension, please use CAN_MO143_AMR.
*/
#define	CAN_MOAMR143	(CAN_MO143_AMR)

/** \brief  21F8, Message Object  Arbitration Register */
#define CAN_MO143_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A1F8u)

/** Alias (User Manual Name) for CAN_MO143_AR.
* To use register names with standard convension, please use CAN_MO143_AR.
*/
#define	CAN_MOAR143	(CAN_MO143_AR)

/** \brief  21FC, Message Object  Control Register */
#define CAN_MO143_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A1FCu)

/** Alias (User Manual Name) for CAN_MO143_CTR.
* To use register names with standard convension, please use CAN_MO143_CTR.
*/
#define	CAN_MOCTR143	(CAN_MO143_CTR)

/** \brief  21F4, Message Object  Data Register High */
#define CAN_MO143_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A1F4u)

/** Alias (User Manual Name) for CAN_MO143_DATAH.
* To use register names with standard convension, please use CAN_MO143_DATAH.
*/
#define	CAN_MODATAH143	(CAN_MO143_DATAH)

/** \brief  21F0, Message Object  Data Register Low */
#define CAN_MO143_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A1F0u)

/** Alias (User Manual Name) for CAN_MO143_DATAL.
* To use register names with standard convension, please use CAN_MO143_DATAL.
*/
#define	CAN_MODATAL143	(CAN_MO143_DATAL)

/** \brief  21E0, Message Object  Function Control Register */
#define CAN_MO143_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A1E0u)

/** Alias (User Manual Name) for CAN_MO143_EDATA0.
* To use register names with standard convension, please use CAN_MO143_EDATA0.
*/
#define	CAN_EMO143DATA0	(CAN_MO143_EDATA0)

/** \brief  21E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO143_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A1E4u)

