luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO143_EDATA1.
* To use register names with standard convension, please use CAN_MO143_EDATA1.
*/
#define	CAN_EMO143DATA1	(CAN_MO143_EDATA1)

/** \brief  21E8, Message Object  Interrupt Pointer Register */
#define CAN_MO143_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A1E8u)

/** Alias (User Manual Name) for CAN_MO143_EDATA2.
* To use register names with standard convension, please use CAN_MO143_EDATA2.
*/
#define	CAN_EMO143DATA2	(CAN_MO143_EDATA2)

/** \brief  21EC, Message Object  Acceptance Mask Register */
#define CAN_MO143_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A1ECu)

/** Alias (User Manual Name) for CAN_MO143_EDATA3.
* To use register names with standard convension, please use CAN_MO143_EDATA3.
*/
#define	CAN_EMO143DATA3	(CAN_MO143_EDATA3)

/** \brief  21F0, Message Object  Data Register Low */
#define CAN_MO143_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A1F0u)

/** Alias (User Manual Name) for CAN_MO143_EDATA4.
* To use register names with standard convension, please use CAN_MO143_EDATA4.
*/
#define	CAN_EMO143DATA4	(CAN_MO143_EDATA4)

/** \brief  21F4, Message Object  Data Register High */
#define CAN_MO143_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A1F4u)

/** Alias (User Manual Name) for CAN_MO143_EDATA5.
* To use register names with standard convension, please use CAN_MO143_EDATA5.
*/
#define	CAN_EMO143DATA5	(CAN_MO143_EDATA5)

/** \brief  21F8, Message Object  Arbitration Register */
#define CAN_MO143_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A1F8u)

/** Alias (User Manual Name) for CAN_MO143_EDATA6.
* To use register names with standard convension, please use CAN_MO143_EDATA6.
*/
#define	CAN_EMO143DATA6	(CAN_MO143_EDATA6)

/** \brief  21E0, Message Object  Function Control Register */
#define CAN_MO143_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A1E0u)

/** Alias (User Manual Name) for CAN_MO143_FCR.
* To use register names with standard convension, please use CAN_MO143_FCR.
*/
#define	CAN_MOFCR143	(CAN_MO143_FCR)

/** \brief  21E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO143_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A1E4u)

/** Alias (User Manual Name) for CAN_MO143_FGPR.
* To use register names with standard convension, please use CAN_MO143_FGPR.
*/
#define	CAN_MOFGPR143	(CAN_MO143_FGPR)

/** \brief  21E8, Message Object  Interrupt Pointer Register */
#define CAN_MO143_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A1E8u)

/** Alias (User Manual Name) for CAN_MO143_IPR.
* To use register names with standard convension, please use CAN_MO143_IPR.
*/
#define	CAN_MOIPR143	(CAN_MO143_IPR)

/** \brief  21FC, Message Object  Control Register */
#define CAN_MO143_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A1FCu)

/** Alias (User Manual Name) for CAN_MO143_STAT.
* To use register names with standard convension, please use CAN_MO143_STAT.
*/
#define	CAN_MOSTAT143	(CAN_MO143_STAT)

/** \brief  220C, Message Object  Acceptance Mask Register */
#define CAN_MO144_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A20Cu)

/** Alias (User Manual Name) for CAN_MO144_AMR.
* To use register names with standard convension, please use CAN_MO144_AMR.
*/
#define	CAN_MOAMR144	(CAN_MO144_AMR)

/** \brief  2218, Message Object  Arbitration Register */
#define CAN_MO144_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A218u)

/** Alias (User Manual Name) for CAN_MO144_AR.
* To use register names with standard convension, please use CAN_MO144_AR.
*/
#define	CAN_MOAR144	(CAN_MO144_AR)

/** \brief  221C, Message Object  Control Register */
#define CAN_MO144_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A21Cu)

/** Alias (User Manual Name) for CAN_MO144_CTR.
* To use register names with standard convension, please use CAN_MO144_CTR.
*/
#define	CAN_MOCTR144	(CAN_MO144_CTR)

/** \brief  2214, Message Object  Data Register High */
#define CAN_MO144_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A214u)

/** Alias (User Manual Name) for CAN_MO144_DATAH.
* To use register names with standard convension, please use CAN_MO144_DATAH.
*/
#define	CAN_MODATAH144	(CAN_MO144_DATAH)

/** \brief  2210, Message Object  Data Register Low */
#define CAN_MO144_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A210u)

/** Alias (User Manual Name) for CAN_MO144_DATAL.
* To use register names with standard convension, please use CAN_MO144_DATAL.
*/
#define	CAN_MODATAL144	(CAN_MO144_DATAL)

/** \brief  2200, Message Object  Function Control Register */
#define CAN_MO144_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A200u)

/** Alias (User Manual Name) for CAN_MO144_EDATA0.
* To use register names with standard convension, please use CAN_MO144_EDATA0.
*/
#define	CAN_EMO144DATA0	(CAN_MO144_EDATA0)

/** \brief  2204, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO144_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A204u)

/** Alias (User Manual Name) for CAN_MO144_EDATA1.
* To use register names with standard convension, please use CAN_MO144_EDATA1.
*/
#define	CAN_EMO144DATA1	(CAN_MO144_EDATA1)

/** \brief  2208, Message Object  Interrupt Pointer Register */
#define CAN_MO144_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A208u)

/** Alias (User Manual Name) for CAN_MO144_EDATA2.
* To use register names with standard convension, please use CAN_MO144_EDATA2.
*/
#define	CAN_EMO144DATA2	(CAN_MO144_EDATA2)

/** \brief  220C, Message Object  Acceptance Mask Register */
#define CAN_MO144_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A20Cu)

/** Alias (User Manual Name) for CAN_MO144_EDATA3.
* To use register names with standard convension, please use CAN_MO144_EDATA3.
*/
#define	CAN_EMO144DATA3	(CAN_MO144_EDATA3)

/** \brief  2210, Message Object  Data Register Low */
#define CAN_MO144_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A210u)

