luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO144_EDATA4.
* To use register names with standard convension, please use CAN_MO144_EDATA4.
*/
#define	CAN_EMO144DATA4	(CAN_MO144_EDATA4)

/** \brief  2214, Message Object  Data Register High */
#define CAN_MO144_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A214u)

/** Alias (User Manual Name) for CAN_MO144_EDATA5.
* To use register names with standard convension, please use CAN_MO144_EDATA5.
*/
#define	CAN_EMO144DATA5	(CAN_MO144_EDATA5)

/** \brief  2218, Message Object  Arbitration Register */
#define CAN_MO144_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A218u)

/** Alias (User Manual Name) for CAN_MO144_EDATA6.
* To use register names with standard convension, please use CAN_MO144_EDATA6.
*/
#define	CAN_EMO144DATA6	(CAN_MO144_EDATA6)

/** \brief  2200, Message Object  Function Control Register */
#define CAN_MO144_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A200u)

/** Alias (User Manual Name) for CAN_MO144_FCR.
* To use register names with standard convension, please use CAN_MO144_FCR.
*/
#define	CAN_MOFCR144	(CAN_MO144_FCR)

/** \brief  2204, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO144_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A204u)

/** Alias (User Manual Name) for CAN_MO144_FGPR.
* To use register names with standard convension, please use CAN_MO144_FGPR.
*/
#define	CAN_MOFGPR144	(CAN_MO144_FGPR)

/** \brief  2208, Message Object  Interrupt Pointer Register */
#define CAN_MO144_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A208u)

/** Alias (User Manual Name) for CAN_MO144_IPR.
* To use register names with standard convension, please use CAN_MO144_IPR.
*/
#define	CAN_MOIPR144	(CAN_MO144_IPR)

/** \brief  221C, Message Object  Control Register */
#define CAN_MO144_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A21Cu)

/** Alias (User Manual Name) for CAN_MO144_STAT.
* To use register names with standard convension, please use CAN_MO144_STAT.
*/
#define	CAN_MOSTAT144	(CAN_MO144_STAT)

/** \brief  222C, Message Object  Acceptance Mask Register */
#define CAN_MO145_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A22Cu)

/** Alias (User Manual Name) for CAN_MO145_AMR.
* To use register names with standard convension, please use CAN_MO145_AMR.
*/
#define	CAN_MOAMR145	(CAN_MO145_AMR)

/** \brief  2238, Message Object  Arbitration Register */
#define CAN_MO145_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A238u)

/** Alias (User Manual Name) for CAN_MO145_AR.
* To use register names with standard convension, please use CAN_MO145_AR.
*/
#define	CAN_MOAR145	(CAN_MO145_AR)

/** \brief  223C, Message Object  Control Register */
#define CAN_MO145_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A23Cu)

/** Alias (User Manual Name) for CAN_MO145_CTR.
* To use register names with standard convension, please use CAN_MO145_CTR.
*/
#define	CAN_MOCTR145	(CAN_MO145_CTR)

/** \brief  2234, Message Object  Data Register High */
#define CAN_MO145_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A234u)

/** Alias (User Manual Name) for CAN_MO145_DATAH.
* To use register names with standard convension, please use CAN_MO145_DATAH.
*/
#define	CAN_MODATAH145	(CAN_MO145_DATAH)

/** \brief  2230, Message Object  Data Register Low */
#define CAN_MO145_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A230u)

/** Alias (User Manual Name) for CAN_MO145_DATAL.
* To use register names with standard convension, please use CAN_MO145_DATAL.
*/
#define	CAN_MODATAL145	(CAN_MO145_DATAL)

/** \brief  2220, Message Object  Function Control Register */
#define CAN_MO145_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A220u)

/** Alias (User Manual Name) for CAN_MO145_EDATA0.
* To use register names with standard convension, please use CAN_MO145_EDATA0.
*/
#define	CAN_EMO145DATA0	(CAN_MO145_EDATA0)

/** \brief  2224, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO145_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A224u)

/** Alias (User Manual Name) for CAN_MO145_EDATA1.
* To use register names with standard convension, please use CAN_MO145_EDATA1.
*/
#define	CAN_EMO145DATA1	(CAN_MO145_EDATA1)

/** \brief  2228, Message Object  Interrupt Pointer Register */
#define CAN_MO145_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A228u)

/** Alias (User Manual Name) for CAN_MO145_EDATA2.
* To use register names with standard convension, please use CAN_MO145_EDATA2.
*/
#define	CAN_EMO145DATA2	(CAN_MO145_EDATA2)

/** \brief  222C, Message Object  Acceptance Mask Register */
#define CAN_MO145_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A22Cu)

/** Alias (User Manual Name) for CAN_MO145_EDATA3.
* To use register names with standard convension, please use CAN_MO145_EDATA3.
*/
#define	CAN_EMO145DATA3	(CAN_MO145_EDATA3)

/** \brief  2230, Message Object  Data Register Low */
#define CAN_MO145_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A230u)

/** Alias (User Manual Name) for CAN_MO145_EDATA4.
* To use register names with standard convension, please use CAN_MO145_EDATA4.
*/
#define	CAN_EMO145DATA4	(CAN_MO145_EDATA4)

/** \brief  2234, Message Object  Data Register High */
#define CAN_MO145_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A234u)

/** Alias (User Manual Name) for CAN_MO145_EDATA5.
* To use register names with standard convension, please use CAN_MO145_EDATA5.
*/
#define	CAN_EMO145DATA5	(CAN_MO145_EDATA5)

/** \brief  2238, Message Object  Arbitration Register */
#define CAN_MO145_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A238u)

/** Alias (User Manual Name) for CAN_MO145_EDATA6.
* To use register names with standard convension, please use CAN_MO145_EDATA6.
*/
#define	CAN_EMO145DATA6	(CAN_MO145_EDATA6)

/** \brief  2220, Message Object  Function Control Register */
#define CAN_MO145_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A220u)

