luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO145_FCR.
* To use register names with standard convension, please use CAN_MO145_FCR.
*/
#define	CAN_MOFCR145	(CAN_MO145_FCR)

/** \brief  2224, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO145_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A224u)

/** Alias (User Manual Name) for CAN_MO145_FGPR.
* To use register names with standard convension, please use CAN_MO145_FGPR.
*/
#define	CAN_MOFGPR145	(CAN_MO145_FGPR)

/** \brief  2228, Message Object  Interrupt Pointer Register */
#define CAN_MO145_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A228u)

/** Alias (User Manual Name) for CAN_MO145_IPR.
* To use register names with standard convension, please use CAN_MO145_IPR.
*/
#define	CAN_MOIPR145	(CAN_MO145_IPR)

/** \brief  223C, Message Object  Control Register */
#define CAN_MO145_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A23Cu)

/** Alias (User Manual Name) for CAN_MO145_STAT.
* To use register names with standard convension, please use CAN_MO145_STAT.
*/
#define	CAN_MOSTAT145	(CAN_MO145_STAT)

/** \brief  224C, Message Object  Acceptance Mask Register */
#define CAN_MO146_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A24Cu)

/** Alias (User Manual Name) for CAN_MO146_AMR.
* To use register names with standard convension, please use CAN_MO146_AMR.
*/
#define	CAN_MOAMR146	(CAN_MO146_AMR)

/** \brief  2258, Message Object  Arbitration Register */
#define CAN_MO146_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A258u)

/** Alias (User Manual Name) for CAN_MO146_AR.
* To use register names with standard convension, please use CAN_MO146_AR.
*/
#define	CAN_MOAR146	(CAN_MO146_AR)

/** \brief  225C, Message Object  Control Register */
#define CAN_MO146_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A25Cu)

/** Alias (User Manual Name) for CAN_MO146_CTR.
* To use register names with standard convension, please use CAN_MO146_CTR.
*/
#define	CAN_MOCTR146	(CAN_MO146_CTR)

/** \brief  2254, Message Object  Data Register High */
#define CAN_MO146_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A254u)

/** Alias (User Manual Name) for CAN_MO146_DATAH.
* To use register names with standard convension, please use CAN_MO146_DATAH.
*/
#define	CAN_MODATAH146	(CAN_MO146_DATAH)

/** \brief  2250, Message Object  Data Register Low */
#define CAN_MO146_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A250u)

/** Alias (User Manual Name) for CAN_MO146_DATAL.
* To use register names with standard convension, please use CAN_MO146_DATAL.
*/
#define	CAN_MODATAL146	(CAN_MO146_DATAL)

/** \brief  2240, Message Object  Function Control Register */
#define CAN_MO146_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A240u)

/** Alias (User Manual Name) for CAN_MO146_EDATA0.
* To use register names with standard convension, please use CAN_MO146_EDATA0.
*/
#define	CAN_EMO146DATA0	(CAN_MO146_EDATA0)

/** \brief  2244, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO146_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A244u)

/** Alias (User Manual Name) for CAN_MO146_EDATA1.
* To use register names with standard convension, please use CAN_MO146_EDATA1.
*/
#define	CAN_EMO146DATA1	(CAN_MO146_EDATA1)

/** \brief  2248, Message Object  Interrupt Pointer Register */
#define CAN_MO146_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A248u)

/** Alias (User Manual Name) for CAN_MO146_EDATA2.
* To use register names with standard convension, please use CAN_MO146_EDATA2.
*/
#define	CAN_EMO146DATA2	(CAN_MO146_EDATA2)

/** \brief  224C, Message Object  Acceptance Mask Register */
#define CAN_MO146_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A24Cu)

/** Alias (User Manual Name) for CAN_MO146_EDATA3.
* To use register names with standard convension, please use CAN_MO146_EDATA3.
*/
#define	CAN_EMO146DATA3	(CAN_MO146_EDATA3)

/** \brief  2250, Message Object  Data Register Low */
#define CAN_MO146_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A250u)

/** Alias (User Manual Name) for CAN_MO146_EDATA4.
* To use register names with standard convension, please use CAN_MO146_EDATA4.
*/
#define	CAN_EMO146DATA4	(CAN_MO146_EDATA4)

/** \brief  2254, Message Object  Data Register High */
#define CAN_MO146_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A254u)

/** Alias (User Manual Name) for CAN_MO146_EDATA5.
* To use register names with standard convension, please use CAN_MO146_EDATA5.
*/
#define	CAN_EMO146DATA5	(CAN_MO146_EDATA5)

/** \brief  2258, Message Object  Arbitration Register */
#define CAN_MO146_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A258u)

/** Alias (User Manual Name) for CAN_MO146_EDATA6.
* To use register names with standard convension, please use CAN_MO146_EDATA6.
*/
#define	CAN_EMO146DATA6	(CAN_MO146_EDATA6)

/** \brief  2240, Message Object  Function Control Register */
#define CAN_MO146_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A240u)

/** Alias (User Manual Name) for CAN_MO146_FCR.
* To use register names with standard convension, please use CAN_MO146_FCR.
*/
#define	CAN_MOFCR146	(CAN_MO146_FCR)

/** \brief  2244, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO146_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A244u)

/** Alias (User Manual Name) for CAN_MO146_FGPR.
* To use register names with standard convension, please use CAN_MO146_FGPR.
*/
#define	CAN_MOFGPR146	(CAN_MO146_FGPR)

/** \brief  2248, Message Object  Interrupt Pointer Register */
#define CAN_MO146_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A248u)

/** Alias (User Manual Name) for CAN_MO146_IPR.
* To use register names with standard convension, please use CAN_MO146_IPR.
*/
#define	CAN_MOIPR146	(CAN_MO146_IPR)

/** \brief  225C, Message Object  Control Register */
#define CAN_MO146_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A25Cu)

/** Alias (User Manual Name) for CAN_MO146_STAT.
* To use register names with standard convension, please use CAN_MO146_STAT.
*/
#define	CAN_MOSTAT146	(CAN_MO146_STAT)

/** \brief  226C, Message Object  Acceptance Mask Register */
#define CAN_MO147_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A26Cu)

