luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO147_AMR.
* To use register names with standard convension, please use CAN_MO147_AMR.
*/
#define	CAN_MOAMR147	(CAN_MO147_AMR)

/** \brief  2278, Message Object  Arbitration Register */
#define CAN_MO147_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A278u)

/** Alias (User Manual Name) for CAN_MO147_AR.
* To use register names with standard convension, please use CAN_MO147_AR.
*/
#define	CAN_MOAR147	(CAN_MO147_AR)

/** \brief  227C, Message Object  Control Register */
#define CAN_MO147_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A27Cu)

/** Alias (User Manual Name) for CAN_MO147_CTR.
* To use register names with standard convension, please use CAN_MO147_CTR.
*/
#define	CAN_MOCTR147	(CAN_MO147_CTR)

/** \brief  2274, Message Object  Data Register High */
#define CAN_MO147_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A274u)

/** Alias (User Manual Name) for CAN_MO147_DATAH.
* To use register names with standard convension, please use CAN_MO147_DATAH.
*/
#define	CAN_MODATAH147	(CAN_MO147_DATAH)

/** \brief  2270, Message Object  Data Register Low */
#define CAN_MO147_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A270u)

/** Alias (User Manual Name) for CAN_MO147_DATAL.
* To use register names with standard convension, please use CAN_MO147_DATAL.
*/
#define	CAN_MODATAL147	(CAN_MO147_DATAL)

/** \brief  2260, Message Object  Function Control Register */
#define CAN_MO147_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A260u)

/** Alias (User Manual Name) for CAN_MO147_EDATA0.
* To use register names with standard convension, please use CAN_MO147_EDATA0.
*/
#define	CAN_EMO147DATA0	(CAN_MO147_EDATA0)

/** \brief  2264, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO147_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A264u)

/** Alias (User Manual Name) for CAN_MO147_EDATA1.
* To use register names with standard convension, please use CAN_MO147_EDATA1.
*/
#define	CAN_EMO147DATA1	(CAN_MO147_EDATA1)

/** \brief  2268, Message Object  Interrupt Pointer Register */
#define CAN_MO147_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A268u)

/** Alias (User Manual Name) for CAN_MO147_EDATA2.
* To use register names with standard convension, please use CAN_MO147_EDATA2.
*/
#define	CAN_EMO147DATA2	(CAN_MO147_EDATA2)

/** \brief  226C, Message Object  Acceptance Mask Register */
#define CAN_MO147_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A26Cu)

/** Alias (User Manual Name) for CAN_MO147_EDATA3.
* To use register names with standard convension, please use CAN_MO147_EDATA3.
*/
#define	CAN_EMO147DATA3	(CAN_MO147_EDATA3)

/** \brief  2270, Message Object  Data Register Low */
#define CAN_MO147_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A270u)

/** Alias (User Manual Name) for CAN_MO147_EDATA4.
* To use register names with standard convension, please use CAN_MO147_EDATA4.
*/
#define	CAN_EMO147DATA4	(CAN_MO147_EDATA4)

/** \brief  2274, Message Object  Data Register High */
#define CAN_MO147_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A274u)

/** Alias (User Manual Name) for CAN_MO147_EDATA5.
* To use register names with standard convension, please use CAN_MO147_EDATA5.
*/
#define	CAN_EMO147DATA5	(CAN_MO147_EDATA5)

/** \brief  2278, Message Object  Arbitration Register */
#define CAN_MO147_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A278u)

/** Alias (User Manual Name) for CAN_MO147_EDATA6.
* To use register names with standard convension, please use CAN_MO147_EDATA6.
*/
#define	CAN_EMO147DATA6	(CAN_MO147_EDATA6)

/** \brief  2260, Message Object  Function Control Register */
#define CAN_MO147_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A260u)

/** Alias (User Manual Name) for CAN_MO147_FCR.
* To use register names with standard convension, please use CAN_MO147_FCR.
*/
#define	CAN_MOFCR147	(CAN_MO147_FCR)

/** \brief  2264, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO147_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A264u)

/** Alias (User Manual Name) for CAN_MO147_FGPR.
* To use register names with standard convension, please use CAN_MO147_FGPR.
*/
#define	CAN_MOFGPR147	(CAN_MO147_FGPR)

/** \brief  2268, Message Object  Interrupt Pointer Register */
#define CAN_MO147_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A268u)

/** Alias (User Manual Name) for CAN_MO147_IPR.
* To use register names with standard convension, please use CAN_MO147_IPR.
*/
#define	CAN_MOIPR147	(CAN_MO147_IPR)

/** \brief  227C, Message Object  Control Register */
#define CAN_MO147_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A27Cu)

/** Alias (User Manual Name) for CAN_MO147_STAT.
* To use register names with standard convension, please use CAN_MO147_STAT.
*/
#define	CAN_MOSTAT147	(CAN_MO147_STAT)

/** \brief  228C, Message Object  Acceptance Mask Register */
#define CAN_MO148_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A28Cu)

/** Alias (User Manual Name) for CAN_MO148_AMR.
* To use register names with standard convension, please use CAN_MO148_AMR.
*/
#define	CAN_MOAMR148	(CAN_MO148_AMR)

/** \brief  2298, Message Object  Arbitration Register */
#define CAN_MO148_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A298u)

/** Alias (User Manual Name) for CAN_MO148_AR.
* To use register names with standard convension, please use CAN_MO148_AR.
*/
#define	CAN_MOAR148	(CAN_MO148_AR)

/** \brief  229C, Message Object  Control Register */
#define CAN_MO148_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A29Cu)

/** Alias (User Manual Name) for CAN_MO148_CTR.
* To use register names with standard convension, please use CAN_MO148_CTR.
*/
#define	CAN_MOCTR148	(CAN_MO148_CTR)

/** \brief  2294, Message Object  Data Register High */
#define CAN_MO148_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A294u)

/** Alias (User Manual Name) for CAN_MO148_DATAH.
* To use register names with standard convension, please use CAN_MO148_DATAH.
*/
#define	CAN_MODATAH148	(CAN_MO148_DATAH)

