luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2290, Message Object  Data Register Low */
#define CAN_MO148_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A290u)

/** Alias (User Manual Name) for CAN_MO148_DATAL.
* To use register names with standard convension, please use CAN_MO148_DATAL.
*/
#define	CAN_MODATAL148	(CAN_MO148_DATAL)

/** \brief  2280, Message Object  Function Control Register */
#define CAN_MO148_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A280u)

/** Alias (User Manual Name) for CAN_MO148_EDATA0.
* To use register names with standard convension, please use CAN_MO148_EDATA0.
*/
#define	CAN_EMO148DATA0	(CAN_MO148_EDATA0)

/** \brief  2284, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO148_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A284u)

/** Alias (User Manual Name) for CAN_MO148_EDATA1.
* To use register names with standard convension, please use CAN_MO148_EDATA1.
*/
#define	CAN_EMO148DATA1	(CAN_MO148_EDATA1)

/** \brief  2288, Message Object  Interrupt Pointer Register */
#define CAN_MO148_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A288u)

/** Alias (User Manual Name) for CAN_MO148_EDATA2.
* To use register names with standard convension, please use CAN_MO148_EDATA2.
*/
#define	CAN_EMO148DATA2	(CAN_MO148_EDATA2)

/** \brief  228C, Message Object  Acceptance Mask Register */
#define CAN_MO148_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A28Cu)

/** Alias (User Manual Name) for CAN_MO148_EDATA3.
* To use register names with standard convension, please use CAN_MO148_EDATA3.
*/
#define	CAN_EMO148DATA3	(CAN_MO148_EDATA3)

/** \brief  2290, Message Object  Data Register Low */
#define CAN_MO148_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A290u)

/** Alias (User Manual Name) for CAN_MO148_EDATA4.
* To use register names with standard convension, please use CAN_MO148_EDATA4.
*/
#define	CAN_EMO148DATA4	(CAN_MO148_EDATA4)

/** \brief  2294, Message Object  Data Register High */
#define CAN_MO148_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A294u)

/** Alias (User Manual Name) for CAN_MO148_EDATA5.
* To use register names with standard convension, please use CAN_MO148_EDATA5.
*/
#define	CAN_EMO148DATA5	(CAN_MO148_EDATA5)

/** \brief  2298, Message Object  Arbitration Register */
#define CAN_MO148_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A298u)

/** Alias (User Manual Name) for CAN_MO148_EDATA6.
* To use register names with standard convension, please use CAN_MO148_EDATA6.
*/
#define	CAN_EMO148DATA6	(CAN_MO148_EDATA6)

/** \brief  2280, Message Object  Function Control Register */
#define CAN_MO148_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A280u)

/** Alias (User Manual Name) for CAN_MO148_FCR.
* To use register names with standard convension, please use CAN_MO148_FCR.
*/
#define	CAN_MOFCR148	(CAN_MO148_FCR)

/** \brief  2284, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO148_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A284u)

/** Alias (User Manual Name) for CAN_MO148_FGPR.
* To use register names with standard convension, please use CAN_MO148_FGPR.
*/
#define	CAN_MOFGPR148	(CAN_MO148_FGPR)

/** \brief  2288, Message Object  Interrupt Pointer Register */
#define CAN_MO148_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A288u)

/** Alias (User Manual Name) for CAN_MO148_IPR.
* To use register names with standard convension, please use CAN_MO148_IPR.
*/
#define	CAN_MOIPR148	(CAN_MO148_IPR)

/** \brief  229C, Message Object  Control Register */
#define CAN_MO148_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A29Cu)

/** Alias (User Manual Name) for CAN_MO148_STAT.
* To use register names with standard convension, please use CAN_MO148_STAT.
*/
#define	CAN_MOSTAT148	(CAN_MO148_STAT)

/** \brief  22AC, Message Object  Acceptance Mask Register */
#define CAN_MO149_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A2ACu)

/** Alias (User Manual Name) for CAN_MO149_AMR.
* To use register names with standard convension, please use CAN_MO149_AMR.
*/
#define	CAN_MOAMR149	(CAN_MO149_AMR)

/** \brief  22B8, Message Object  Arbitration Register */
#define CAN_MO149_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A2B8u)

/** Alias (User Manual Name) for CAN_MO149_AR.
* To use register names with standard convension, please use CAN_MO149_AR.
*/
#define	CAN_MOAR149	(CAN_MO149_AR)

/** \brief  22BC, Message Object  Control Register */
#define CAN_MO149_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A2BCu)

/** Alias (User Manual Name) for CAN_MO149_CTR.
* To use register names with standard convension, please use CAN_MO149_CTR.
*/
#define	CAN_MOCTR149	(CAN_MO149_CTR)

/** \brief  22B4, Message Object  Data Register High */
#define CAN_MO149_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A2B4u)

/** Alias (User Manual Name) for CAN_MO149_DATAH.
* To use register names with standard convension, please use CAN_MO149_DATAH.
*/
#define	CAN_MODATAH149	(CAN_MO149_DATAH)

/** \brief  22B0, Message Object  Data Register Low */
#define CAN_MO149_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A2B0u)

/** Alias (User Manual Name) for CAN_MO149_DATAL.
* To use register names with standard convension, please use CAN_MO149_DATAL.
*/
#define	CAN_MODATAL149	(CAN_MO149_DATAL)

/** \brief  22A0, Message Object  Function Control Register */
#define CAN_MO149_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A2A0u)

/** Alias (User Manual Name) for CAN_MO149_EDATA0.
* To use register names with standard convension, please use CAN_MO149_EDATA0.
*/
#define	CAN_EMO149DATA0	(CAN_MO149_EDATA0)

/** \brief  22A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO149_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A2A4u)

/** Alias (User Manual Name) for CAN_MO149_EDATA1.
* To use register names with standard convension, please use CAN_MO149_EDATA1.
*/
#define	CAN_EMO149DATA1	(CAN_MO149_EDATA1)

