luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  22A8, Message Object  Interrupt Pointer Register */
#define CAN_MO149_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A2A8u)

/** Alias (User Manual Name) for CAN_MO149_EDATA2.
* To use register names with standard convension, please use CAN_MO149_EDATA2.
*/
#define	CAN_EMO149DATA2	(CAN_MO149_EDATA2)

/** \brief  22AC, Message Object  Acceptance Mask Register */
#define CAN_MO149_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A2ACu)

/** Alias (User Manual Name) for CAN_MO149_EDATA3.
* To use register names with standard convension, please use CAN_MO149_EDATA3.
*/
#define	CAN_EMO149DATA3	(CAN_MO149_EDATA3)

/** \brief  22B0, Message Object  Data Register Low */
#define CAN_MO149_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A2B0u)

/** Alias (User Manual Name) for CAN_MO149_EDATA4.
* To use register names with standard convension, please use CAN_MO149_EDATA4.
*/
#define	CAN_EMO149DATA4	(CAN_MO149_EDATA4)

/** \brief  22B4, Message Object  Data Register High */
#define CAN_MO149_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A2B4u)

/** Alias (User Manual Name) for CAN_MO149_EDATA5.
* To use register names with standard convension, please use CAN_MO149_EDATA5.
*/
#define	CAN_EMO149DATA5	(CAN_MO149_EDATA5)

/** \brief  22B8, Message Object  Arbitration Register */
#define CAN_MO149_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A2B8u)

/** Alias (User Manual Name) for CAN_MO149_EDATA6.
* To use register names with standard convension, please use CAN_MO149_EDATA6.
*/
#define	CAN_EMO149DATA6	(CAN_MO149_EDATA6)

/** \brief  22A0, Message Object  Function Control Register */
#define CAN_MO149_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A2A0u)

/** Alias (User Manual Name) for CAN_MO149_FCR.
* To use register names with standard convension, please use CAN_MO149_FCR.
*/
#define	CAN_MOFCR149	(CAN_MO149_FCR)

/** \brief  22A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO149_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A2A4u)

/** Alias (User Manual Name) for CAN_MO149_FGPR.
* To use register names with standard convension, please use CAN_MO149_FGPR.
*/
#define	CAN_MOFGPR149	(CAN_MO149_FGPR)

/** \brief  22A8, Message Object  Interrupt Pointer Register */
#define CAN_MO149_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A2A8u)

/** Alias (User Manual Name) for CAN_MO149_IPR.
* To use register names with standard convension, please use CAN_MO149_IPR.
*/
#define	CAN_MOIPR149	(CAN_MO149_IPR)

/** \brief  22BC, Message Object  Control Register */
#define CAN_MO149_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A2BCu)

/** Alias (User Manual Name) for CAN_MO149_STAT.
* To use register names with standard convension, please use CAN_MO149_STAT.
*/
#define	CAN_MOSTAT149	(CAN_MO149_STAT)

/** \brief  11CC, Message Object  Acceptance Mask Register */
#define CAN_MO14_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00191CCu)

/** Alias (User Manual Name) for CAN_MO14_AMR.
* To use register names with standard convension, please use CAN_MO14_AMR.
*/
#define	CAN_MOAMR14	(CAN_MO14_AMR)

/** \brief  11D8, Message Object  Arbitration Register */
#define CAN_MO14_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00191D8u)

/** Alias (User Manual Name) for CAN_MO14_AR.
* To use register names with standard convension, please use CAN_MO14_AR.
*/
#define	CAN_MOAR14	(CAN_MO14_AR)

/** \brief  11DC, Message Object  Control Register */
#define CAN_MO14_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00191DCu)

/** Alias (User Manual Name) for CAN_MO14_CTR.
* To use register names with standard convension, please use CAN_MO14_CTR.
*/
#define	CAN_MOCTR14	(CAN_MO14_CTR)

/** \brief  11D4, Message Object  Data Register High */
#define CAN_MO14_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00191D4u)

/** Alias (User Manual Name) for CAN_MO14_DATAH.
* To use register names with standard convension, please use CAN_MO14_DATAH.
*/
#define	CAN_MODATAH14	(CAN_MO14_DATAH)

/** \brief  11D0, Message Object  Data Register Low */
#define CAN_MO14_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00191D0u)

/** Alias (User Manual Name) for CAN_MO14_DATAL.
* To use register names with standard convension, please use CAN_MO14_DATAL.
*/
#define	CAN_MODATAL14	(CAN_MO14_DATAL)

/** \brief  11C0, Message Object  Function Control Register */
#define CAN_MO14_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00191C0u)

/** Alias (User Manual Name) for CAN_MO14_EDATA0.
* To use register names with standard convension, please use CAN_MO14_EDATA0.
*/
#define	CAN_EMO14DATA0	(CAN_MO14_EDATA0)

/** \brief  11C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO14_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00191C4u)

/** Alias (User Manual Name) for CAN_MO14_EDATA1.
* To use register names with standard convension, please use CAN_MO14_EDATA1.
*/
#define	CAN_EMO14DATA1	(CAN_MO14_EDATA1)

/** \brief  11C8, Message Object  Interrupt Pointer Register */
#define CAN_MO14_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00191C8u)

/** Alias (User Manual Name) for CAN_MO14_EDATA2.
* To use register names with standard convension, please use CAN_MO14_EDATA2.
*/
#define	CAN_EMO14DATA2	(CAN_MO14_EDATA2)

/** \brief  11CC, Message Object  Acceptance Mask Register */
#define CAN_MO14_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00191CCu)

/** Alias (User Manual Name) for CAN_MO14_EDATA3.
* To use register names with standard convension, please use CAN_MO14_EDATA3.
*/
#define	CAN_EMO14DATA3	(CAN_MO14_EDATA3)

/** \brief  11D0, Message Object  Data Register Low */
#define CAN_MO14_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00191D0u)

/** Alias (User Manual Name) for CAN_MO14_EDATA4.
* To use register names with standard convension, please use CAN_MO14_EDATA4.
*/
#define	CAN_EMO14DATA4	(CAN_MO14_EDATA4)

/** \brief  11D4, Message Object  Data Register High */
#define CAN_MO14_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00191D4u)

/** Alias (User Manual Name) for CAN_MO14_EDATA5.
* To use register names with standard convension, please use CAN_MO14_EDATA5.
*/
#define	CAN_EMO14DATA5	(CAN_MO14_EDATA5)

/** \brief  11D8, Message Object  Arbitration Register */
#define CAN_MO14_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00191D8u)

