luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO14_EDATA6.
* To use register names with standard convension, please use CAN_MO14_EDATA6.
*/
#define	CAN_EMO14DATA6	(CAN_MO14_EDATA6)

/** \brief  11C0, Message Object  Function Control Register */
#define CAN_MO14_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00191C0u)

/** Alias (User Manual Name) for CAN_MO14_FCR.
* To use register names with standard convension, please use CAN_MO14_FCR.
*/
#define	CAN_MOFCR14	(CAN_MO14_FCR)

/** \brief  11C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO14_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00191C4u)

/** Alias (User Manual Name) for CAN_MO14_FGPR.
* To use register names with standard convension, please use CAN_MO14_FGPR.
*/
#define	CAN_MOFGPR14	(CAN_MO14_FGPR)

/** \brief  11C8, Message Object  Interrupt Pointer Register */
#define CAN_MO14_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00191C8u)

/** Alias (User Manual Name) for CAN_MO14_IPR.
* To use register names with standard convension, please use CAN_MO14_IPR.
*/
#define	CAN_MOIPR14	(CAN_MO14_IPR)

/** \brief  11DC, Message Object  Control Register */
#define CAN_MO14_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00191DCu)

/** Alias (User Manual Name) for CAN_MO14_STAT.
* To use register names with standard convension, please use CAN_MO14_STAT.
*/
#define	CAN_MOSTAT14	(CAN_MO14_STAT)

/** \brief  22CC, Message Object  Acceptance Mask Register */
#define CAN_MO150_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A2CCu)

/** Alias (User Manual Name) for CAN_MO150_AMR.
* To use register names with standard convension, please use CAN_MO150_AMR.
*/
#define	CAN_MOAMR150	(CAN_MO150_AMR)

/** \brief  22D8, Message Object  Arbitration Register */
#define CAN_MO150_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A2D8u)

/** Alias (User Manual Name) for CAN_MO150_AR.
* To use register names with standard convension, please use CAN_MO150_AR.
*/
#define	CAN_MOAR150	(CAN_MO150_AR)

/** \brief  22DC, Message Object  Control Register */
#define CAN_MO150_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A2DCu)

/** Alias (User Manual Name) for CAN_MO150_CTR.
* To use register names with standard convension, please use CAN_MO150_CTR.
*/
#define	CAN_MOCTR150	(CAN_MO150_CTR)

/** \brief  22D4, Message Object  Data Register High */
#define CAN_MO150_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A2D4u)

/** Alias (User Manual Name) for CAN_MO150_DATAH.
* To use register names with standard convension, please use CAN_MO150_DATAH.
*/
#define	CAN_MODATAH150	(CAN_MO150_DATAH)

/** \brief  22D0, Message Object  Data Register Low */
#define CAN_MO150_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A2D0u)

/** Alias (User Manual Name) for CAN_MO150_DATAL.
* To use register names with standard convension, please use CAN_MO150_DATAL.
*/
#define	CAN_MODATAL150	(CAN_MO150_DATAL)

/** \brief  22C0, Message Object  Function Control Register */
#define CAN_MO150_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A2C0u)

/** Alias (User Manual Name) for CAN_MO150_EDATA0.
* To use register names with standard convension, please use CAN_MO150_EDATA0.
*/
#define	CAN_EMO150DATA0	(CAN_MO150_EDATA0)

/** \brief  22C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO150_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A2C4u)

/** Alias (User Manual Name) for CAN_MO150_EDATA1.
* To use register names with standard convension, please use CAN_MO150_EDATA1.
*/
#define	CAN_EMO150DATA1	(CAN_MO150_EDATA1)

/** \brief  22C8, Message Object  Interrupt Pointer Register */
#define CAN_MO150_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A2C8u)

/** Alias (User Manual Name) for CAN_MO150_EDATA2.
* To use register names with standard convension, please use CAN_MO150_EDATA2.
*/
#define	CAN_EMO150DATA2	(CAN_MO150_EDATA2)

/** \brief  22CC, Message Object  Acceptance Mask Register */
#define CAN_MO150_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A2CCu)

/** Alias (User Manual Name) for CAN_MO150_EDATA3.
* To use register names with standard convension, please use CAN_MO150_EDATA3.
*/
#define	CAN_EMO150DATA3	(CAN_MO150_EDATA3)

/** \brief  22D0, Message Object  Data Register Low */
#define CAN_MO150_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A2D0u)

/** Alias (User Manual Name) for CAN_MO150_EDATA4.
* To use register names with standard convension, please use CAN_MO150_EDATA4.
*/
#define	CAN_EMO150DATA4	(CAN_MO150_EDATA4)

/** \brief  22D4, Message Object  Data Register High */
#define CAN_MO150_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A2D4u)

/** Alias (User Manual Name) for CAN_MO150_EDATA5.
* To use register names with standard convension, please use CAN_MO150_EDATA5.
*/
#define	CAN_EMO150DATA5	(CAN_MO150_EDATA5)

/** \brief  22D8, Message Object  Arbitration Register */
#define CAN_MO150_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A2D8u)

/** Alias (User Manual Name) for CAN_MO150_EDATA6.
* To use register names with standard convension, please use CAN_MO150_EDATA6.
*/
#define	CAN_EMO150DATA6	(CAN_MO150_EDATA6)

/** \brief  22C0, Message Object  Function Control Register */
#define CAN_MO150_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A2C0u)

/** Alias (User Manual Name) for CAN_MO150_FCR.
* To use register names with standard convension, please use CAN_MO150_FCR.
*/
#define	CAN_MOFCR150	(CAN_MO150_FCR)

/** \brief  22C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO150_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A2C4u)

/** Alias (User Manual Name) for CAN_MO150_FGPR.
* To use register names with standard convension, please use CAN_MO150_FGPR.
*/
#define	CAN_MOFGPR150	(CAN_MO150_FGPR)

/** \brief  22C8, Message Object  Interrupt Pointer Register */
#define CAN_MO150_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A2C8u)

/** Alias (User Manual Name) for CAN_MO150_IPR.
* To use register names with standard convension, please use CAN_MO150_IPR.
*/
#define	CAN_MOIPR150	(CAN_MO150_IPR)

/** \brief  22DC, Message Object  Control Register */
#define CAN_MO150_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A2DCu)

/** Alias (User Manual Name) for CAN_MO150_STAT.
* To use register names with standard convension, please use CAN_MO150_STAT.
*/
#define	CAN_MOSTAT150	(CAN_MO150_STAT)

/** \brief  22EC, Message Object  Acceptance Mask Register */
#define CAN_MO151_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A2ECu)

/** Alias (User Manual Name) for CAN_MO151_AMR.
* To use register names with standard convension, please use CAN_MO151_AMR.
*/
#define	CAN_MOAMR151	(CAN_MO151_AMR)

/** \brief  22F8, Message Object  Arbitration Register */
#define CAN_MO151_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A2F8u)

/** Alias (User Manual Name) for CAN_MO151_AR.
* To use register names with standard convension, please use CAN_MO151_AR.
*/
#define	CAN_MOAR151	(CAN_MO151_AR)

/** \brief  22FC, Message Object  Control Register */
#define CAN_MO151_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A2FCu)

/** Alias (User Manual Name) for CAN_MO151_CTR.
* To use register names with standard convension, please use CAN_MO151_CTR.
*/
#define	CAN_MOCTR151	(CAN_MO151_CTR)

