luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2304, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO152_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A304u)

/** Alias (User Manual Name) for CAN_MO152_EDATA1.
* To use register names with standard convension, please use CAN_MO152_EDATA1.
*/
#define	CAN_EMO152DATA1	(CAN_MO152_EDATA1)

/** \brief  2308, Message Object  Interrupt Pointer Register */
#define CAN_MO152_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A308u)

/** Alias (User Manual Name) for CAN_MO152_EDATA2.
* To use register names with standard convension, please use CAN_MO152_EDATA2.
*/
#define	CAN_EMO152DATA2	(CAN_MO152_EDATA2)

/** \brief  230C, Message Object  Acceptance Mask Register */
#define CAN_MO152_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A30Cu)

/** Alias (User Manual Name) for CAN_MO152_EDATA3.
* To use register names with standard convension, please use CAN_MO152_EDATA3.
*/
#define	CAN_EMO152DATA3	(CAN_MO152_EDATA3)

/** \brief  2310, Message Object  Data Register Low */
#define CAN_MO152_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A310u)

/** Alias (User Manual Name) for CAN_MO152_EDATA4.
* To use register names with standard convension, please use CAN_MO152_EDATA4.
*/
#define	CAN_EMO152DATA4	(CAN_MO152_EDATA4)

/** \brief  2314, Message Object  Data Register High */
#define CAN_MO152_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A314u)

/** Alias (User Manual Name) for CAN_MO152_EDATA5.
* To use register names with standard convension, please use CAN_MO152_EDATA5.
*/
#define	CAN_EMO152DATA5	(CAN_MO152_EDATA5)

/** \brief  2318, Message Object  Arbitration Register */
#define CAN_MO152_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A318u)

/** Alias (User Manual Name) for CAN_MO152_EDATA6.
* To use register names with standard convension, please use CAN_MO152_EDATA6.
*/
#define	CAN_EMO152DATA6	(CAN_MO152_EDATA6)

/** \brief  2300, Message Object  Function Control Register */
#define CAN_MO152_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A300u)

/** Alias (User Manual Name) for CAN_MO152_FCR.
* To use register names with standard convension, please use CAN_MO152_FCR.
*/
#define	CAN_MOFCR152	(CAN_MO152_FCR)

/** \brief  2304, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO152_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A304u)

/** Alias (User Manual Name) for CAN_MO152_FGPR.
* To use register names with standard convension, please use CAN_MO152_FGPR.
*/
#define	CAN_MOFGPR152	(CAN_MO152_FGPR)

/** \brief  2308, Message Object  Interrupt Pointer Register */
#define CAN_MO152_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A308u)

/** Alias (User Manual Name) for CAN_MO152_IPR.
* To use register names with standard convension, please use CAN_MO152_IPR.
*/
#define	CAN_MOIPR152	(CAN_MO152_IPR)

/** \brief  231C, Message Object  Control Register */
#define CAN_MO152_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A31Cu)

/** Alias (User Manual Name) for CAN_MO152_STAT.
* To use register names with standard convension, please use CAN_MO152_STAT.
*/
#define	CAN_MOSTAT152	(CAN_MO152_STAT)

/** \brief  232C, Message Object  Acceptance Mask Register */
#define CAN_MO153_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A32Cu)

/** Alias (User Manual Name) for CAN_MO153_AMR.
* To use register names with standard convension, please use CAN_MO153_AMR.
*/
#define	CAN_MOAMR153	(CAN_MO153_AMR)

/** \brief  2338, Message Object  Arbitration Register */
#define CAN_MO153_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A338u)

/** Alias (User Manual Name) for CAN_MO153_AR.
* To use register names with standard convension, please use CAN_MO153_AR.
*/
#define	CAN_MOAR153	(CAN_MO153_AR)

/** \brief  233C, Message Object  Control Register */
#define CAN_MO153_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A33Cu)

/** Alias (User Manual Name) for CAN_MO153_CTR.
* To use register names with standard convension, please use CAN_MO153_CTR.
*/
#define	CAN_MOCTR153	(CAN_MO153_CTR)

/** \brief  2334, Message Object  Data Register High */
#define CAN_MO153_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A334u)

/** Alias (User Manual Name) for CAN_MO153_DATAH.
* To use register names with standard convension, please use CAN_MO153_DATAH.
*/
#define	CAN_MODATAH153	(CAN_MO153_DATAH)

/** \brief  2330, Message Object  Data Register Low */
#define CAN_MO153_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A330u)

/** Alias (User Manual Name) for CAN_MO153_DATAL.
* To use register names with standard convension, please use CAN_MO153_DATAL.
*/
#define	CAN_MODATAL153	(CAN_MO153_DATAL)

/** \brief  2320, Message Object  Function Control Register */
#define CAN_MO153_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A320u)

/** Alias (User Manual Name) for CAN_MO153_EDATA0.
* To use register names with standard convension, please use CAN_MO153_EDATA0.
*/
#define	CAN_EMO153DATA0	(CAN_MO153_EDATA0)

/** \brief  2324, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO153_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A324u)

/** Alias (User Manual Name) for CAN_MO153_EDATA1.
* To use register names with standard convension, please use CAN_MO153_EDATA1.
*/
#define	CAN_EMO153DATA1	(CAN_MO153_EDATA1)

/** \brief  2328, Message Object  Interrupt Pointer Register */
#define CAN_MO153_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A328u)

/** Alias (User Manual Name) for CAN_MO153_EDATA2.
* To use register names with standard convension, please use CAN_MO153_EDATA2.
*/
#define	CAN_EMO153DATA2	(CAN_MO153_EDATA2)

/** \brief  232C, Message Object  Acceptance Mask Register */
#define CAN_MO153_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A32Cu)

/** Alias (User Manual Name) for CAN_MO153_EDATA3.
* To use register names with standard convension, please use CAN_MO153_EDATA3.
*/
#define	CAN_EMO153DATA3	(CAN_MO153_EDATA3)

/** \brief  2330, Message Object  Data Register Low */
#define CAN_MO153_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A330u)

/** Alias (User Manual Name) for CAN_MO153_EDATA4.
* To use register names with standard convension, please use CAN_MO153_EDATA4.
*/
#define	CAN_EMO153DATA4	(CAN_MO153_EDATA4)

