luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2334, Message Object  Data Register High */
#define CAN_MO153_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A334u)

/** Alias (User Manual Name) for CAN_MO153_EDATA5.
* To use register names with standard convension, please use CAN_MO153_EDATA5.
*/
#define	CAN_EMO153DATA5	(CAN_MO153_EDATA5)

/** \brief  2338, Message Object  Arbitration Register */
#define CAN_MO153_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A338u)

/** Alias (User Manual Name) for CAN_MO153_EDATA6.
* To use register names with standard convension, please use CAN_MO153_EDATA6.
*/
#define	CAN_EMO153DATA6	(CAN_MO153_EDATA6)

/** \brief  2320, Message Object  Function Control Register */
#define CAN_MO153_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A320u)

/** Alias (User Manual Name) for CAN_MO153_FCR.
* To use register names with standard convension, please use CAN_MO153_FCR.
*/
#define	CAN_MOFCR153	(CAN_MO153_FCR)

/** \brief  2324, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO153_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A324u)

/** Alias (User Manual Name) for CAN_MO153_FGPR.
* To use register names with standard convension, please use CAN_MO153_FGPR.
*/
#define	CAN_MOFGPR153	(CAN_MO153_FGPR)

/** \brief  2328, Message Object  Interrupt Pointer Register */
#define CAN_MO153_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A328u)

/** Alias (User Manual Name) for CAN_MO153_IPR.
* To use register names with standard convension, please use CAN_MO153_IPR.
*/
#define	CAN_MOIPR153	(CAN_MO153_IPR)

/** \brief  233C, Message Object  Control Register */
#define CAN_MO153_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A33Cu)

/** Alias (User Manual Name) for CAN_MO153_STAT.
* To use register names with standard convension, please use CAN_MO153_STAT.
*/
#define	CAN_MOSTAT153	(CAN_MO153_STAT)

/** \brief  234C, Message Object  Acceptance Mask Register */
#define CAN_MO154_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A34Cu)

/** Alias (User Manual Name) for CAN_MO154_AMR.
* To use register names with standard convension, please use CAN_MO154_AMR.
*/
#define	CAN_MOAMR154	(CAN_MO154_AMR)

/** \brief  2358, Message Object  Arbitration Register */
#define CAN_MO154_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A358u)

/** Alias (User Manual Name) for CAN_MO154_AR.
* To use register names with standard convension, please use CAN_MO154_AR.
*/
#define	CAN_MOAR154	(CAN_MO154_AR)

/** \brief  235C, Message Object  Control Register */
#define CAN_MO154_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A35Cu)

/** Alias (User Manual Name) for CAN_MO154_CTR.
* To use register names with standard convension, please use CAN_MO154_CTR.
*/
#define	CAN_MOCTR154	(CAN_MO154_CTR)

/** \brief  2354, Message Object  Data Register High */
#define CAN_MO154_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A354u)

/** Alias (User Manual Name) for CAN_MO154_DATAH.
* To use register names with standard convension, please use CAN_MO154_DATAH.
*/
#define	CAN_MODATAH154	(CAN_MO154_DATAH)

/** \brief  2350, Message Object  Data Register Low */
#define CAN_MO154_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A350u)

/** Alias (User Manual Name) for CAN_MO154_DATAL.
* To use register names with standard convension, please use CAN_MO154_DATAL.
*/
#define	CAN_MODATAL154	(CAN_MO154_DATAL)

/** \brief  2340, Message Object  Function Control Register */
#define CAN_MO154_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A340u)

/** Alias (User Manual Name) for CAN_MO154_EDATA0.
* To use register names with standard convension, please use CAN_MO154_EDATA0.
*/
#define	CAN_EMO154DATA0	(CAN_MO154_EDATA0)

/** \brief  2344, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO154_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A344u)

/** Alias (User Manual Name) for CAN_MO154_EDATA1.
* To use register names with standard convension, please use CAN_MO154_EDATA1.
*/
#define	CAN_EMO154DATA1	(CAN_MO154_EDATA1)

/** \brief  2348, Message Object  Interrupt Pointer Register */
#define CAN_MO154_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A348u)

/** Alias (User Manual Name) for CAN_MO154_EDATA2.
* To use register names with standard convension, please use CAN_MO154_EDATA2.
*/
#define	CAN_EMO154DATA2	(CAN_MO154_EDATA2)

/** \brief  234C, Message Object  Acceptance Mask Register */
#define CAN_MO154_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A34Cu)

/** Alias (User Manual Name) for CAN_MO154_EDATA3.
* To use register names with standard convension, please use CAN_MO154_EDATA3.
*/
#define	CAN_EMO154DATA3	(CAN_MO154_EDATA3)

/** \brief  2350, Message Object  Data Register Low */
#define CAN_MO154_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A350u)

/** Alias (User Manual Name) for CAN_MO154_EDATA4.
* To use register names with standard convension, please use CAN_MO154_EDATA4.
*/
#define	CAN_EMO154DATA4	(CAN_MO154_EDATA4)

/** \brief  2354, Message Object  Data Register High */
#define CAN_MO154_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A354u)

/** Alias (User Manual Name) for CAN_MO154_EDATA5.
* To use register names with standard convension, please use CAN_MO154_EDATA5.
*/
#define	CAN_EMO154DATA5	(CAN_MO154_EDATA5)

/** \brief  2358, Message Object  Arbitration Register */
#define CAN_MO154_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A358u)

/** Alias (User Manual Name) for CAN_MO154_EDATA6.
* To use register names with standard convension, please use CAN_MO154_EDATA6.
*/
#define	CAN_EMO154DATA6	(CAN_MO154_EDATA6)

/** \brief  2340, Message Object  Function Control Register */
#define CAN_MO154_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A340u)

/** Alias (User Manual Name) for CAN_MO154_FCR.
* To use register names with standard convension, please use CAN_MO154_FCR.
*/
#define	CAN_MOFCR154	(CAN_MO154_FCR)

/** \brief  2344, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO154_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A344u)

/** Alias (User Manual Name) for CAN_MO154_FGPR.
* To use register names with standard convension, please use CAN_MO154_FGPR.
*/
#define	CAN_MOFGPR154	(CAN_MO154_FGPR)

