luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO156_EDATA0.
* To use register names with standard convension, please use CAN_MO156_EDATA0.
*/
#define	CAN_EMO156DATA0	(CAN_MO156_EDATA0)

/** \brief  2384, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO156_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A384u)

/** Alias (User Manual Name) for CAN_MO156_EDATA1.
* To use register names with standard convension, please use CAN_MO156_EDATA1.
*/
#define	CAN_EMO156DATA1	(CAN_MO156_EDATA1)

/** \brief  2388, Message Object  Interrupt Pointer Register */
#define CAN_MO156_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A388u)

/** Alias (User Manual Name) for CAN_MO156_EDATA2.
* To use register names with standard convension, please use CAN_MO156_EDATA2.
*/
#define	CAN_EMO156DATA2	(CAN_MO156_EDATA2)

/** \brief  238C, Message Object  Acceptance Mask Register */
#define CAN_MO156_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A38Cu)

/** Alias (User Manual Name) for CAN_MO156_EDATA3.
* To use register names with standard convension, please use CAN_MO156_EDATA3.
*/
#define	CAN_EMO156DATA3	(CAN_MO156_EDATA3)

/** \brief  2390, Message Object  Data Register Low */
#define CAN_MO156_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A390u)

/** Alias (User Manual Name) for CAN_MO156_EDATA4.
* To use register names with standard convension, please use CAN_MO156_EDATA4.
*/
#define	CAN_EMO156DATA4	(CAN_MO156_EDATA4)

/** \brief  2394, Message Object  Data Register High */
#define CAN_MO156_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A394u)

/** Alias (User Manual Name) for CAN_MO156_EDATA5.
* To use register names with standard convension, please use CAN_MO156_EDATA5.
*/
#define	CAN_EMO156DATA5	(CAN_MO156_EDATA5)

/** \brief  2398, Message Object  Arbitration Register */
#define CAN_MO156_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A398u)

/** Alias (User Manual Name) for CAN_MO156_EDATA6.
* To use register names with standard convension, please use CAN_MO156_EDATA6.
*/
#define	CAN_EMO156DATA6	(CAN_MO156_EDATA6)

/** \brief  2380, Message Object  Function Control Register */
#define CAN_MO156_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A380u)

/** Alias (User Manual Name) for CAN_MO156_FCR.
* To use register names with standard convension, please use CAN_MO156_FCR.
*/
#define	CAN_MOFCR156	(CAN_MO156_FCR)

/** \brief  2384, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO156_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A384u)

/** Alias (User Manual Name) for CAN_MO156_FGPR.
* To use register names with standard convension, please use CAN_MO156_FGPR.
*/
#define	CAN_MOFGPR156	(CAN_MO156_FGPR)

/** \brief  2388, Message Object  Interrupt Pointer Register */
#define CAN_MO156_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A388u)

/** Alias (User Manual Name) for CAN_MO156_IPR.
* To use register names with standard convension, please use CAN_MO156_IPR.
*/
#define	CAN_MOIPR156	(CAN_MO156_IPR)

/** \brief  239C, Message Object  Control Register */
#define CAN_MO156_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A39Cu)

/** Alias (User Manual Name) for CAN_MO156_STAT.
* To use register names with standard convension, please use CAN_MO156_STAT.
*/
#define	CAN_MOSTAT156	(CAN_MO156_STAT)

/** \brief  23AC, Message Object  Acceptance Mask Register */
#define CAN_MO157_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A3ACu)

/** Alias (User Manual Name) for CAN_MO157_AMR.
* To use register names with standard convension, please use CAN_MO157_AMR.
*/
#define	CAN_MOAMR157	(CAN_MO157_AMR)

/** \brief  23B8, Message Object  Arbitration Register */
#define CAN_MO157_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A3B8u)

/** Alias (User Manual Name) for CAN_MO157_AR.
* To use register names with standard convension, please use CAN_MO157_AR.
*/
#define	CAN_MOAR157	(CAN_MO157_AR)

/** \brief  23BC, Message Object  Control Register */
#define CAN_MO157_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A3BCu)

/** Alias (User Manual Name) for CAN_MO157_CTR.
* To use register names with standard convension, please use CAN_MO157_CTR.
*/
#define	CAN_MOCTR157	(CAN_MO157_CTR)

/** \brief  23B4, Message Object  Data Register High */
#define CAN_MO157_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A3B4u)

/** Alias (User Manual Name) for CAN_MO157_DATAH.
* To use register names with standard convension, please use CAN_MO157_DATAH.
*/
#define	CAN_MODATAH157	(CAN_MO157_DATAH)

/** \brief  23B0, Message Object  Data Register Low */
#define CAN_MO157_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A3B0u)

/** Alias (User Manual Name) for CAN_MO157_DATAL.
* To use register names with standard convension, please use CAN_MO157_DATAL.
*/
#define	CAN_MODATAL157	(CAN_MO157_DATAL)

/** \brief  23A0, Message Object  Function Control Register */
#define CAN_MO157_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A3A0u)

/** Alias (User Manual Name) for CAN_MO157_EDATA0.
* To use register names with standard convension, please use CAN_MO157_EDATA0.
*/
#define	CAN_EMO157DATA0	(CAN_MO157_EDATA0)

/** \brief  23A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO157_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A3A4u)

/** Alias (User Manual Name) for CAN_MO157_EDATA1.
* To use register names with standard convension, please use CAN_MO157_EDATA1.
*/
#define	CAN_EMO157DATA1	(CAN_MO157_EDATA1)

/** \brief  23A8, Message Object  Interrupt Pointer Register */
#define CAN_MO157_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A3A8u)

/** Alias (User Manual Name) for CAN_MO157_EDATA2.
* To use register names with standard convension, please use CAN_MO157_EDATA2.
*/
#define	CAN_EMO157DATA2	(CAN_MO157_EDATA2)

/** \brief  23AC, Message Object  Acceptance Mask Register */
#define CAN_MO157_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A3ACu)

