luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO157_EDATA3.
* To use register names with standard convension, please use CAN_MO157_EDATA3.
*/
#define	CAN_EMO157DATA3	(CAN_MO157_EDATA3)

/** \brief  23B0, Message Object  Data Register Low */
#define CAN_MO157_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A3B0u)

/** Alias (User Manual Name) for CAN_MO157_EDATA4.
* To use register names with standard convension, please use CAN_MO157_EDATA4.
*/
#define	CAN_EMO157DATA4	(CAN_MO157_EDATA4)

/** \brief  23B4, Message Object  Data Register High */
#define CAN_MO157_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A3B4u)

/** Alias (User Manual Name) for CAN_MO157_EDATA5.
* To use register names with standard convension, please use CAN_MO157_EDATA5.
*/
#define	CAN_EMO157DATA5	(CAN_MO157_EDATA5)

/** \brief  23B8, Message Object  Arbitration Register */
#define CAN_MO157_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A3B8u)

/** Alias (User Manual Name) for CAN_MO157_EDATA6.
* To use register names with standard convension, please use CAN_MO157_EDATA6.
*/
#define	CAN_EMO157DATA6	(CAN_MO157_EDATA6)

/** \brief  23A0, Message Object  Function Control Register */
#define CAN_MO157_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A3A0u)

/** Alias (User Manual Name) for CAN_MO157_FCR.
* To use register names with standard convension, please use CAN_MO157_FCR.
*/
#define	CAN_MOFCR157	(CAN_MO157_FCR)

/** \brief  23A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO157_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A3A4u)

/** Alias (User Manual Name) for CAN_MO157_FGPR.
* To use register names with standard convension, please use CAN_MO157_FGPR.
*/
#define	CAN_MOFGPR157	(CAN_MO157_FGPR)

/** \brief  23A8, Message Object  Interrupt Pointer Register */
#define CAN_MO157_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A3A8u)

/** Alias (User Manual Name) for CAN_MO157_IPR.
* To use register names with standard convension, please use CAN_MO157_IPR.
*/
#define	CAN_MOIPR157	(CAN_MO157_IPR)

/** \brief  23BC, Message Object  Control Register */
#define CAN_MO157_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A3BCu)

/** Alias (User Manual Name) for CAN_MO157_STAT.
* To use register names with standard convension, please use CAN_MO157_STAT.
*/
#define	CAN_MOSTAT157	(CAN_MO157_STAT)

/** \brief  23CC, Message Object  Acceptance Mask Register */
#define CAN_MO158_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A3CCu)

/** Alias (User Manual Name) for CAN_MO158_AMR.
* To use register names with standard convension, please use CAN_MO158_AMR.
*/
#define	CAN_MOAMR158	(CAN_MO158_AMR)

/** \brief  23D8, Message Object  Arbitration Register */
#define CAN_MO158_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A3D8u)

/** Alias (User Manual Name) for CAN_MO158_AR.
* To use register names with standard convension, please use CAN_MO158_AR.
*/
#define	CAN_MOAR158	(CAN_MO158_AR)

/** \brief  23DC, Message Object  Control Register */
#define CAN_MO158_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A3DCu)

/** Alias (User Manual Name) for CAN_MO158_CTR.
* To use register names with standard convension, please use CAN_MO158_CTR.
*/
#define	CAN_MOCTR158	(CAN_MO158_CTR)

/** \brief  23D4, Message Object  Data Register High */
#define CAN_MO158_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A3D4u)

/** Alias (User Manual Name) for CAN_MO158_DATAH.
* To use register names with standard convension, please use CAN_MO158_DATAH.
*/
#define	CAN_MODATAH158	(CAN_MO158_DATAH)

/** \brief  23D0, Message Object  Data Register Low */
#define CAN_MO158_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A3D0u)

/** Alias (User Manual Name) for CAN_MO158_DATAL.
* To use register names with standard convension, please use CAN_MO158_DATAL.
*/
#define	CAN_MODATAL158	(CAN_MO158_DATAL)

/** \brief  23C0, Message Object  Function Control Register */
#define CAN_MO158_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A3C0u)

/** Alias (User Manual Name) for CAN_MO158_EDATA0.
* To use register names with standard convension, please use CAN_MO158_EDATA0.
*/
#define	CAN_EMO158DATA0	(CAN_MO158_EDATA0)

/** \brief  23C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO158_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A3C4u)

/** Alias (User Manual Name) for CAN_MO158_EDATA1.
* To use register names with standard convension, please use CAN_MO158_EDATA1.
*/
#define	CAN_EMO158DATA1	(CAN_MO158_EDATA1)

/** \brief  23C8, Message Object  Interrupt Pointer Register */
#define CAN_MO158_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A3C8u)

/** Alias (User Manual Name) for CAN_MO158_EDATA2.
* To use register names with standard convension, please use CAN_MO158_EDATA2.
*/
#define	CAN_EMO158DATA2	(CAN_MO158_EDATA2)

/** \brief  23CC, Message Object  Acceptance Mask Register */
#define CAN_MO158_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A3CCu)

/** Alias (User Manual Name) for CAN_MO158_EDATA3.
* To use register names with standard convension, please use CAN_MO158_EDATA3.
*/
#define	CAN_EMO158DATA3	(CAN_MO158_EDATA3)

/** \brief  23D0, Message Object  Data Register Low */
#define CAN_MO158_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A3D0u)

/** Alias (User Manual Name) for CAN_MO158_EDATA4.
* To use register names with standard convension, please use CAN_MO158_EDATA4.
*/
#define	CAN_EMO158DATA4	(CAN_MO158_EDATA4)

/** \brief  23D4, Message Object  Data Register High */
#define CAN_MO158_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A3D4u)

/** Alias (User Manual Name) for CAN_MO158_EDATA5.
* To use register names with standard convension, please use CAN_MO158_EDATA5.
*/
#define	CAN_EMO158DATA5	(CAN_MO158_EDATA5)

/** \brief  23D8, Message Object  Arbitration Register */
#define CAN_MO158_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A3D8u)

