luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO158_EDATA6.
* To use register names with standard convension, please use CAN_MO158_EDATA6.
*/
#define	CAN_EMO158DATA6	(CAN_MO158_EDATA6)

/** \brief  23C0, Message Object  Function Control Register */
#define CAN_MO158_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A3C0u)

/** Alias (User Manual Name) for CAN_MO158_FCR.
* To use register names with standard convension, please use CAN_MO158_FCR.
*/
#define	CAN_MOFCR158	(CAN_MO158_FCR)

/** \brief  23C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO158_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A3C4u)

/** Alias (User Manual Name) for CAN_MO158_FGPR.
* To use register names with standard convension, please use CAN_MO158_FGPR.
*/
#define	CAN_MOFGPR158	(CAN_MO158_FGPR)

/** \brief  23C8, Message Object  Interrupt Pointer Register */
#define CAN_MO158_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A3C8u)

/** Alias (User Manual Name) for CAN_MO158_IPR.
* To use register names with standard convension, please use CAN_MO158_IPR.
*/
#define	CAN_MOIPR158	(CAN_MO158_IPR)

/** \brief  23DC, Message Object  Control Register */
#define CAN_MO158_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A3DCu)

/** Alias (User Manual Name) for CAN_MO158_STAT.
* To use register names with standard convension, please use CAN_MO158_STAT.
*/
#define	CAN_MOSTAT158	(CAN_MO158_STAT)

/** \brief  23EC, Message Object  Acceptance Mask Register */
#define CAN_MO159_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A3ECu)

/** Alias (User Manual Name) for CAN_MO159_AMR.
* To use register names with standard convension, please use CAN_MO159_AMR.
*/
#define	CAN_MOAMR159	(CAN_MO159_AMR)

/** \brief  23F8, Message Object  Arbitration Register */
#define CAN_MO159_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A3F8u)

/** Alias (User Manual Name) for CAN_MO159_AR.
* To use register names with standard convension, please use CAN_MO159_AR.
*/
#define	CAN_MOAR159	(CAN_MO159_AR)

/** \brief  23FC, Message Object  Control Register */
#define CAN_MO159_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A3FCu)

/** Alias (User Manual Name) for CAN_MO159_CTR.
* To use register names with standard convension, please use CAN_MO159_CTR.
*/
#define	CAN_MOCTR159	(CAN_MO159_CTR)

/** \brief  23F4, Message Object  Data Register High */
#define CAN_MO159_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A3F4u)

/** Alias (User Manual Name) for CAN_MO159_DATAH.
* To use register names with standard convension, please use CAN_MO159_DATAH.
*/
#define	CAN_MODATAH159	(CAN_MO159_DATAH)

/** \brief  23F0, Message Object  Data Register Low */
#define CAN_MO159_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A3F0u)

/** Alias (User Manual Name) for CAN_MO159_DATAL.
* To use register names with standard convension, please use CAN_MO159_DATAL.
*/
#define	CAN_MODATAL159	(CAN_MO159_DATAL)

/** \brief  23E0, Message Object  Function Control Register */
#define CAN_MO159_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A3E0u)

/** Alias (User Manual Name) for CAN_MO159_EDATA0.
* To use register names with standard convension, please use CAN_MO159_EDATA0.
*/
#define	CAN_EMO159DATA0	(CAN_MO159_EDATA0)

/** \brief  23E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO159_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A3E4u)

/** Alias (User Manual Name) for CAN_MO159_EDATA1.
* To use register names with standard convension, please use CAN_MO159_EDATA1.
*/
#define	CAN_EMO159DATA1	(CAN_MO159_EDATA1)

/** \brief  23E8, Message Object  Interrupt Pointer Register */
#define CAN_MO159_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A3E8u)

/** Alias (User Manual Name) for CAN_MO159_EDATA2.
* To use register names with standard convension, please use CAN_MO159_EDATA2.
*/
#define	CAN_EMO159DATA2	(CAN_MO159_EDATA2)

/** \brief  23EC, Message Object  Acceptance Mask Register */
#define CAN_MO159_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A3ECu)

/** Alias (User Manual Name) for CAN_MO159_EDATA3.
* To use register names with standard convension, please use CAN_MO159_EDATA3.
*/
#define	CAN_EMO159DATA3	(CAN_MO159_EDATA3)

/** \brief  23F0, Message Object  Data Register Low */
#define CAN_MO159_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A3F0u)

/** Alias (User Manual Name) for CAN_MO159_EDATA4.
* To use register names with standard convension, please use CAN_MO159_EDATA4.
*/
#define	CAN_EMO159DATA4	(CAN_MO159_EDATA4)

/** \brief  23F4, Message Object  Data Register High */
#define CAN_MO159_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A3F4u)

/** Alias (User Manual Name) for CAN_MO159_EDATA5.
* To use register names with standard convension, please use CAN_MO159_EDATA5.
*/
#define	CAN_EMO159DATA5	(CAN_MO159_EDATA5)

/** \brief  23F8, Message Object  Arbitration Register */
#define CAN_MO159_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A3F8u)

/** Alias (User Manual Name) for CAN_MO159_EDATA6.
* To use register names with standard convension, please use CAN_MO159_EDATA6.
*/
#define	CAN_EMO159DATA6	(CAN_MO159_EDATA6)

/** \brief  23E0, Message Object  Function Control Register */
#define CAN_MO159_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A3E0u)

/** Alias (User Manual Name) for CAN_MO159_FCR.
* To use register names with standard convension, please use CAN_MO159_FCR.
*/
#define	CAN_MOFCR159	(CAN_MO159_FCR)

/** \brief  23E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO159_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A3E4u)

/** Alias (User Manual Name) for CAN_MO159_FGPR.
* To use register names with standard convension, please use CAN_MO159_FGPR.
*/
#define	CAN_MOFGPR159	(CAN_MO159_FGPR)

/** \brief  23E8, Message Object  Interrupt Pointer Register */
#define CAN_MO159_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A3E8u)

