luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO159_IPR.
* To use register names with standard convension, please use CAN_MO159_IPR.
*/
#define	CAN_MOIPR159	(CAN_MO159_IPR)

/** \brief  23FC, Message Object  Control Register */
#define CAN_MO159_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A3FCu)

/** Alias (User Manual Name) for CAN_MO159_STAT.
* To use register names with standard convension, please use CAN_MO159_STAT.
*/
#define	CAN_MOSTAT159	(CAN_MO159_STAT)

/** \brief  11EC, Message Object  Acceptance Mask Register */
#define CAN_MO15_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00191ECu)

/** Alias (User Manual Name) for CAN_MO15_AMR.
* To use register names with standard convension, please use CAN_MO15_AMR.
*/
#define	CAN_MOAMR15	(CAN_MO15_AMR)

/** \brief  11F8, Message Object  Arbitration Register */
#define CAN_MO15_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00191F8u)

/** Alias (User Manual Name) for CAN_MO15_AR.
* To use register names with standard convension, please use CAN_MO15_AR.
*/
#define	CAN_MOAR15	(CAN_MO15_AR)

/** \brief  11FC, Message Object  Control Register */
#define CAN_MO15_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00191FCu)

/** Alias (User Manual Name) for CAN_MO15_CTR.
* To use register names with standard convension, please use CAN_MO15_CTR.
*/
#define	CAN_MOCTR15	(CAN_MO15_CTR)

/** \brief  11F4, Message Object  Data Register High */
#define CAN_MO15_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00191F4u)

/** Alias (User Manual Name) for CAN_MO15_DATAH.
* To use register names with standard convension, please use CAN_MO15_DATAH.
*/
#define	CAN_MODATAH15	(CAN_MO15_DATAH)

/** \brief  11F0, Message Object  Data Register Low */
#define CAN_MO15_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00191F0u)

/** Alias (User Manual Name) for CAN_MO15_DATAL.
* To use register names with standard convension, please use CAN_MO15_DATAL.
*/
#define	CAN_MODATAL15	(CAN_MO15_DATAL)

/** \brief  11E0, Message Object  Function Control Register */
#define CAN_MO15_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00191E0u)

/** Alias (User Manual Name) for CAN_MO15_EDATA0.
* To use register names with standard convension, please use CAN_MO15_EDATA0.
*/
#define	CAN_EMO15DATA0	(CAN_MO15_EDATA0)

/** \brief  11E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO15_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00191E4u)

/** Alias (User Manual Name) for CAN_MO15_EDATA1.
* To use register names with standard convension, please use CAN_MO15_EDATA1.
*/
#define	CAN_EMO15DATA1	(CAN_MO15_EDATA1)

/** \brief  11E8, Message Object  Interrupt Pointer Register */
#define CAN_MO15_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00191E8u)

/** Alias (User Manual Name) for CAN_MO15_EDATA2.
* To use register names with standard convension, please use CAN_MO15_EDATA2.
*/
#define	CAN_EMO15DATA2	(CAN_MO15_EDATA2)

/** \brief  11EC, Message Object  Acceptance Mask Register */
#define CAN_MO15_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00191ECu)

/** Alias (User Manual Name) for CAN_MO15_EDATA3.
* To use register names with standard convension, please use CAN_MO15_EDATA3.
*/
#define	CAN_EMO15DATA3	(CAN_MO15_EDATA3)

/** \brief  11F0, Message Object  Data Register Low */
#define CAN_MO15_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00191F0u)

/** Alias (User Manual Name) for CAN_MO15_EDATA4.
* To use register names with standard convension, please use CAN_MO15_EDATA4.
*/
#define	CAN_EMO15DATA4	(CAN_MO15_EDATA4)

/** \brief  11F4, Message Object  Data Register High */
#define CAN_MO15_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00191F4u)

/** Alias (User Manual Name) for CAN_MO15_EDATA5.
* To use register names with standard convension, please use CAN_MO15_EDATA5.
*/
#define	CAN_EMO15DATA5	(CAN_MO15_EDATA5)

/** \brief  11F8, Message Object  Arbitration Register */
#define CAN_MO15_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00191F8u)

/** Alias (User Manual Name) for CAN_MO15_EDATA6.
* To use register names with standard convension, please use CAN_MO15_EDATA6.
*/
#define	CAN_EMO15DATA6	(CAN_MO15_EDATA6)

/** \brief  11E0, Message Object  Function Control Register */
#define CAN_MO15_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00191E0u)

/** Alias (User Manual Name) for CAN_MO15_FCR.
* To use register names with standard convension, please use CAN_MO15_FCR.
*/
#define	CAN_MOFCR15	(CAN_MO15_FCR)

/** \brief  11E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO15_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00191E4u)

/** Alias (User Manual Name) for CAN_MO15_FGPR.
* To use register names with standard convension, please use CAN_MO15_FGPR.
*/
#define	CAN_MOFGPR15	(CAN_MO15_FGPR)

/** \brief  11E8, Message Object  Interrupt Pointer Register */
#define CAN_MO15_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00191E8u)

/** Alias (User Manual Name) for CAN_MO15_IPR.
* To use register names with standard convension, please use CAN_MO15_IPR.
*/
#define	CAN_MOIPR15	(CAN_MO15_IPR)

/** \brief  11FC, Message Object  Control Register */
#define CAN_MO15_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00191FCu)

/** Alias (User Manual Name) for CAN_MO15_STAT.
* To use register names with standard convension, please use CAN_MO15_STAT.
*/
#define	CAN_MOSTAT15	(CAN_MO15_STAT)

/** \brief  240C, Message Object  Acceptance Mask Register */
#define CAN_MO160_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A40Cu)

/** Alias (User Manual Name) for CAN_MO160_AMR.
* To use register names with standard convension, please use CAN_MO160_AMR.
*/
#define	CAN_MOAMR160	(CAN_MO160_AMR)

/** \brief  2418, Message Object  Arbitration Register */
#define CAN_MO160_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A418u)

/** Alias (User Manual Name) for CAN_MO160_AR.
* To use register names with standard convension, please use CAN_MO160_AR.
*/
#define	CAN_MOAR160	(CAN_MO160_AR)

/** \brief  241C, Message Object  Control Register */
#define CAN_MO160_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A41Cu)

/** Alias (User Manual Name) for CAN_MO160_CTR.
* To use register names with standard convension, please use CAN_MO160_CTR.
*/
#define	CAN_MOCTR160	(CAN_MO160_CTR)

/** \brief  2414, Message Object  Data Register High */
#define CAN_MO160_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A414u)

/** Alias (User Manual Name) for CAN_MO160_DATAH.
* To use register names with standard convension, please use CAN_MO160_DATAH.
*/
#define	CAN_MODATAH160	(CAN_MO160_DATAH)

/** \brief  2410, Message Object  Data Register Low */
#define CAN_MO160_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A410u)

/** Alias (User Manual Name) for CAN_MO160_DATAL.
* To use register names with standard convension, please use CAN_MO160_DATAL.
*/
#define	CAN_MODATAL160	(CAN_MO160_DATAL)

/** \brief  2400, Message Object  Function Control Register */
#define CAN_MO160_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A400u)

/** Alias (User Manual Name) for CAN_MO160_EDATA0.
* To use register names with standard convension, please use CAN_MO160_EDATA0.
*/
#define	CAN_EMO160DATA0	(CAN_MO160_EDATA0)

/** \brief  2404, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO160_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A404u)

