luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO160_EDATA1.
* To use register names with standard convension, please use CAN_MO160_EDATA1.
*/
#define	CAN_EMO160DATA1	(CAN_MO160_EDATA1)

/** \brief  2408, Message Object  Interrupt Pointer Register */
#define CAN_MO160_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A408u)

/** Alias (User Manual Name) for CAN_MO160_EDATA2.
* To use register names with standard convension, please use CAN_MO160_EDATA2.
*/
#define	CAN_EMO160DATA2	(CAN_MO160_EDATA2)

/** \brief  240C, Message Object  Acceptance Mask Register */
#define CAN_MO160_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A40Cu)

/** Alias (User Manual Name) for CAN_MO160_EDATA3.
* To use register names with standard convension, please use CAN_MO160_EDATA3.
*/
#define	CAN_EMO160DATA3	(CAN_MO160_EDATA3)

/** \brief  2410, Message Object  Data Register Low */
#define CAN_MO160_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A410u)

/** Alias (User Manual Name) for CAN_MO160_EDATA4.
* To use register names with standard convension, please use CAN_MO160_EDATA4.
*/
#define	CAN_EMO160DATA4	(CAN_MO160_EDATA4)

/** \brief  2414, Message Object  Data Register High */
#define CAN_MO160_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A414u)

/** Alias (User Manual Name) for CAN_MO160_EDATA5.
* To use register names with standard convension, please use CAN_MO160_EDATA5.
*/
#define	CAN_EMO160DATA5	(CAN_MO160_EDATA5)

/** \brief  2418, Message Object  Arbitration Register */
#define CAN_MO160_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A418u)

/** Alias (User Manual Name) for CAN_MO160_EDATA6.
* To use register names with standard convension, please use CAN_MO160_EDATA6.
*/
#define	CAN_EMO160DATA6	(CAN_MO160_EDATA6)

/** \brief  2400, Message Object  Function Control Register */
#define CAN_MO160_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A400u)

/** Alias (User Manual Name) for CAN_MO160_FCR.
* To use register names with standard convension, please use CAN_MO160_FCR.
*/
#define	CAN_MOFCR160	(CAN_MO160_FCR)

/** \brief  2404, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO160_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A404u)

/** Alias (User Manual Name) for CAN_MO160_FGPR.
* To use register names with standard convension, please use CAN_MO160_FGPR.
*/
#define	CAN_MOFGPR160	(CAN_MO160_FGPR)

/** \brief  2408, Message Object  Interrupt Pointer Register */
#define CAN_MO160_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A408u)

/** Alias (User Manual Name) for CAN_MO160_IPR.
* To use register names with standard convension, please use CAN_MO160_IPR.
*/
#define	CAN_MOIPR160	(CAN_MO160_IPR)

/** \brief  241C, Message Object  Control Register */
#define CAN_MO160_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A41Cu)

/** Alias (User Manual Name) for CAN_MO160_STAT.
* To use register names with standard convension, please use CAN_MO160_STAT.
*/
#define	CAN_MOSTAT160	(CAN_MO160_STAT)

/** \brief  242C, Message Object  Acceptance Mask Register */
#define CAN_MO161_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A42Cu)

/** Alias (User Manual Name) for CAN_MO161_AMR.
* To use register names with standard convension, please use CAN_MO161_AMR.
*/
#define	CAN_MOAMR161	(CAN_MO161_AMR)

/** \brief  2438, Message Object  Arbitration Register */
#define CAN_MO161_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A438u)

/** Alias (User Manual Name) for CAN_MO161_AR.
* To use register names with standard convension, please use CAN_MO161_AR.
*/
#define	CAN_MOAR161	(CAN_MO161_AR)

/** \brief  243C, Message Object  Control Register */
#define CAN_MO161_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A43Cu)

/** Alias (User Manual Name) for CAN_MO161_CTR.
* To use register names with standard convension, please use CAN_MO161_CTR.
*/
#define	CAN_MOCTR161	(CAN_MO161_CTR)

/** \brief  2434, Message Object  Data Register High */
#define CAN_MO161_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A434u)

/** Alias (User Manual Name) for CAN_MO161_DATAH.
* To use register names with standard convension, please use CAN_MO161_DATAH.
*/
#define	CAN_MODATAH161	(CAN_MO161_DATAH)

/** \brief  2430, Message Object  Data Register Low */
#define CAN_MO161_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A430u)

/** Alias (User Manual Name) for CAN_MO161_DATAL.
* To use register names with standard convension, please use CAN_MO161_DATAL.
*/
#define	CAN_MODATAL161	(CAN_MO161_DATAL)

/** \brief  2420, Message Object  Function Control Register */
#define CAN_MO161_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A420u)

/** Alias (User Manual Name) for CAN_MO161_EDATA0.
* To use register names with standard convension, please use CAN_MO161_EDATA0.
*/
#define	CAN_EMO161DATA0	(CAN_MO161_EDATA0)

/** \brief  2424, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO161_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A424u)

/** Alias (User Manual Name) for CAN_MO161_EDATA1.
* To use register names with standard convension, please use CAN_MO161_EDATA1.
*/
#define	CAN_EMO161DATA1	(CAN_MO161_EDATA1)

/** \brief  2428, Message Object  Interrupt Pointer Register */
#define CAN_MO161_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A428u)

/** Alias (User Manual Name) for CAN_MO161_EDATA2.
* To use register names with standard convension, please use CAN_MO161_EDATA2.
*/
#define	CAN_EMO161DATA2	(CAN_MO161_EDATA2)

/** \brief  242C, Message Object  Acceptance Mask Register */
#define CAN_MO161_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A42Cu)

/** Alias (User Manual Name) for CAN_MO161_EDATA3.
* To use register names with standard convension, please use CAN_MO161_EDATA3.
*/
#define	CAN_EMO161DATA3	(CAN_MO161_EDATA3)

/** \brief  2430, Message Object  Data Register Low */
#define CAN_MO161_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A430u)

/** Alias (User Manual Name) for CAN_MO161_EDATA4.
* To use register names with standard convension, please use CAN_MO161_EDATA4.
*/
#define	CAN_EMO161DATA4	(CAN_MO161_EDATA4)

