luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2434, Message Object  Data Register High */
#define CAN_MO161_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A434u)

/** Alias (User Manual Name) for CAN_MO161_EDATA5.
* To use register names with standard convension, please use CAN_MO161_EDATA5.
*/
#define	CAN_EMO161DATA5	(CAN_MO161_EDATA5)

/** \brief  2438, Message Object  Arbitration Register */
#define CAN_MO161_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A438u)

/** Alias (User Manual Name) for CAN_MO161_EDATA6.
* To use register names with standard convension, please use CAN_MO161_EDATA6.
*/
#define	CAN_EMO161DATA6	(CAN_MO161_EDATA6)

/** \brief  2420, Message Object  Function Control Register */
#define CAN_MO161_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A420u)

/** Alias (User Manual Name) for CAN_MO161_FCR.
* To use register names with standard convension, please use CAN_MO161_FCR.
*/
#define	CAN_MOFCR161	(CAN_MO161_FCR)

/** \brief  2424, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO161_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A424u)

/** Alias (User Manual Name) for CAN_MO161_FGPR.
* To use register names with standard convension, please use CAN_MO161_FGPR.
*/
#define	CAN_MOFGPR161	(CAN_MO161_FGPR)

/** \brief  2428, Message Object  Interrupt Pointer Register */
#define CAN_MO161_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A428u)

/** Alias (User Manual Name) for CAN_MO161_IPR.
* To use register names with standard convension, please use CAN_MO161_IPR.
*/
#define	CAN_MOIPR161	(CAN_MO161_IPR)

/** \brief  243C, Message Object  Control Register */
#define CAN_MO161_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A43Cu)

/** Alias (User Manual Name) for CAN_MO161_STAT.
* To use register names with standard convension, please use CAN_MO161_STAT.
*/
#define	CAN_MOSTAT161	(CAN_MO161_STAT)

/** \brief  244C, Message Object  Acceptance Mask Register */
#define CAN_MO162_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A44Cu)

/** Alias (User Manual Name) for CAN_MO162_AMR.
* To use register names with standard convension, please use CAN_MO162_AMR.
*/
#define	CAN_MOAMR162	(CAN_MO162_AMR)

/** \brief  2458, Message Object  Arbitration Register */
#define CAN_MO162_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A458u)

/** Alias (User Manual Name) for CAN_MO162_AR.
* To use register names with standard convension, please use CAN_MO162_AR.
*/
#define	CAN_MOAR162	(CAN_MO162_AR)

/** \brief  245C, Message Object  Control Register */
#define CAN_MO162_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A45Cu)

/** Alias (User Manual Name) for CAN_MO162_CTR.
* To use register names with standard convension, please use CAN_MO162_CTR.
*/
#define	CAN_MOCTR162	(CAN_MO162_CTR)

/** \brief  2454, Message Object  Data Register High */
#define CAN_MO162_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A454u)

/** Alias (User Manual Name) for CAN_MO162_DATAH.
* To use register names with standard convension, please use CAN_MO162_DATAH.
*/
#define	CAN_MODATAH162	(CAN_MO162_DATAH)

/** \brief  2450, Message Object  Data Register Low */
#define CAN_MO162_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A450u)

/** Alias (User Manual Name) for CAN_MO162_DATAL.
* To use register names with standard convension, please use CAN_MO162_DATAL.
*/
#define	CAN_MODATAL162	(CAN_MO162_DATAL)

/** \brief  2440, Message Object  Function Control Register */
#define CAN_MO162_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A440u)

/** Alias (User Manual Name) for CAN_MO162_EDATA0.
* To use register names with standard convension, please use CAN_MO162_EDATA0.
*/
#define	CAN_EMO162DATA0	(CAN_MO162_EDATA0)

/** \brief  2444, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO162_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A444u)

/** Alias (User Manual Name) for CAN_MO162_EDATA1.
* To use register names with standard convension, please use CAN_MO162_EDATA1.
*/
#define	CAN_EMO162DATA1	(CAN_MO162_EDATA1)

/** \brief  2448, Message Object  Interrupt Pointer Register */
#define CAN_MO162_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A448u)

/** Alias (User Manual Name) for CAN_MO162_EDATA2.
* To use register names with standard convension, please use CAN_MO162_EDATA2.
*/
#define	CAN_EMO162DATA2	(CAN_MO162_EDATA2)

/** \brief  244C, Message Object  Acceptance Mask Register */
#define CAN_MO162_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A44Cu)

/** Alias (User Manual Name) for CAN_MO162_EDATA3.
* To use register names with standard convension, please use CAN_MO162_EDATA3.
*/
#define	CAN_EMO162DATA3	(CAN_MO162_EDATA3)

/** \brief  2450, Message Object  Data Register Low */
#define CAN_MO162_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A450u)

/** Alias (User Manual Name) for CAN_MO162_EDATA4.
* To use register names with standard convension, please use CAN_MO162_EDATA4.
*/
#define	CAN_EMO162DATA4	(CAN_MO162_EDATA4)

/** \brief  2454, Message Object  Data Register High */
#define CAN_MO162_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A454u)

/** Alias (User Manual Name) for CAN_MO162_EDATA5.
* To use register names with standard convension, please use CAN_MO162_EDATA5.
*/
#define	CAN_EMO162DATA5	(CAN_MO162_EDATA5)

/** \brief  2458, Message Object  Arbitration Register */
#define CAN_MO162_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A458u)

/** Alias (User Manual Name) for CAN_MO162_EDATA6.
* To use register names with standard convension, please use CAN_MO162_EDATA6.
*/
#define	CAN_EMO162DATA6	(CAN_MO162_EDATA6)

/** \brief  2440, Message Object  Function Control Register */
#define CAN_MO162_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A440u)

/** Alias (User Manual Name) for CAN_MO162_FCR.
* To use register names with standard convension, please use CAN_MO162_FCR.
*/
#define	CAN_MOFCR162	(CAN_MO162_FCR)

/** \brief  2444, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO162_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A444u)

/** Alias (User Manual Name) for CAN_MO162_FGPR.
* To use register names with standard convension, please use CAN_MO162_FGPR.
*/
#define	CAN_MOFGPR162	(CAN_MO162_FGPR)

/** \brief  2448, Message Object  Interrupt Pointer Register */
#define CAN_MO162_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A448u)

/** Alias (User Manual Name) for CAN_MO162_IPR.
* To use register names with standard convension, please use CAN_MO162_IPR.
*/
#define	CAN_MOIPR162	(CAN_MO162_IPR)

/** \brief  245C, Message Object  Control Register */
#define CAN_MO162_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A45Cu)

