luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO162_STAT.
* To use register names with standard convension, please use CAN_MO162_STAT.
*/
#define	CAN_MOSTAT162	(CAN_MO162_STAT)

/** \brief  246C, Message Object  Acceptance Mask Register */
#define CAN_MO163_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A46Cu)

/** Alias (User Manual Name) for CAN_MO163_AMR.
* To use register names with standard convension, please use CAN_MO163_AMR.
*/
#define	CAN_MOAMR163	(CAN_MO163_AMR)

/** \brief  2478, Message Object  Arbitration Register */
#define CAN_MO163_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A478u)

/** Alias (User Manual Name) for CAN_MO163_AR.
* To use register names with standard convension, please use CAN_MO163_AR.
*/
#define	CAN_MOAR163	(CAN_MO163_AR)

/** \brief  247C, Message Object  Control Register */
#define CAN_MO163_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A47Cu)

/** Alias (User Manual Name) for CAN_MO163_CTR.
* To use register names with standard convension, please use CAN_MO163_CTR.
*/
#define	CAN_MOCTR163	(CAN_MO163_CTR)

/** \brief  2474, Message Object  Data Register High */
#define CAN_MO163_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A474u)

/** Alias (User Manual Name) for CAN_MO163_DATAH.
* To use register names with standard convension, please use CAN_MO163_DATAH.
*/
#define	CAN_MODATAH163	(CAN_MO163_DATAH)

/** \brief  2470, Message Object  Data Register Low */
#define CAN_MO163_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A470u)

/** Alias (User Manual Name) for CAN_MO163_DATAL.
* To use register names with standard convension, please use CAN_MO163_DATAL.
*/
#define	CAN_MODATAL163	(CAN_MO163_DATAL)

/** \brief  2460, Message Object  Function Control Register */
#define CAN_MO163_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A460u)

/** Alias (User Manual Name) for CAN_MO163_EDATA0.
* To use register names with standard convension, please use CAN_MO163_EDATA0.
*/
#define	CAN_EMO163DATA0	(CAN_MO163_EDATA0)

/** \brief  2464, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO163_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A464u)

/** Alias (User Manual Name) for CAN_MO163_EDATA1.
* To use register names with standard convension, please use CAN_MO163_EDATA1.
*/
#define	CAN_EMO163DATA1	(CAN_MO163_EDATA1)

/** \brief  2468, Message Object  Interrupt Pointer Register */
#define CAN_MO163_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A468u)

/** Alias (User Manual Name) for CAN_MO163_EDATA2.
* To use register names with standard convension, please use CAN_MO163_EDATA2.
*/
#define	CAN_EMO163DATA2	(CAN_MO163_EDATA2)

/** \brief  246C, Message Object  Acceptance Mask Register */
#define CAN_MO163_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A46Cu)

/** Alias (User Manual Name) for CAN_MO163_EDATA3.
* To use register names with standard convension, please use CAN_MO163_EDATA3.
*/
#define	CAN_EMO163DATA3	(CAN_MO163_EDATA3)

/** \brief  2470, Message Object  Data Register Low */
#define CAN_MO163_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A470u)

/** Alias (User Manual Name) for CAN_MO163_EDATA4.
* To use register names with standard convension, please use CAN_MO163_EDATA4.
*/
#define	CAN_EMO163DATA4	(CAN_MO163_EDATA4)

/** \brief  2474, Message Object  Data Register High */
#define CAN_MO163_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A474u)

/** Alias (User Manual Name) for CAN_MO163_EDATA5.
* To use register names with standard convension, please use CAN_MO163_EDATA5.
*/
#define	CAN_EMO163DATA5	(CAN_MO163_EDATA5)

/** \brief  2478, Message Object  Arbitration Register */
#define CAN_MO163_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A478u)

/** Alias (User Manual Name) for CAN_MO163_EDATA6.
* To use register names with standard convension, please use CAN_MO163_EDATA6.
*/
#define	CAN_EMO163DATA6	(CAN_MO163_EDATA6)

/** \brief  2460, Message Object  Function Control Register */
#define CAN_MO163_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A460u)

/** Alias (User Manual Name) for CAN_MO163_FCR.
* To use register names with standard convension, please use CAN_MO163_FCR.
*/
#define	CAN_MOFCR163	(CAN_MO163_FCR)

/** \brief  2464, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO163_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A464u)

/** Alias (User Manual Name) for CAN_MO163_FGPR.
* To use register names with standard convension, please use CAN_MO163_FGPR.
*/
#define	CAN_MOFGPR163	(CAN_MO163_FGPR)

/** \brief  2468, Message Object  Interrupt Pointer Register */
#define CAN_MO163_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A468u)

/** Alias (User Manual Name) for CAN_MO163_IPR.
* To use register names with standard convension, please use CAN_MO163_IPR.
*/
#define	CAN_MOIPR163	(CAN_MO163_IPR)

/** \brief  247C, Message Object  Control Register */
#define CAN_MO163_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A47Cu)

/** Alias (User Manual Name) for CAN_MO163_STAT.
* To use register names with standard convension, please use CAN_MO163_STAT.
*/
#define	CAN_MOSTAT163	(CAN_MO163_STAT)

/** \brief  248C, Message Object  Acceptance Mask Register */
#define CAN_MO164_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A48Cu)

/** Alias (User Manual Name) for CAN_MO164_AMR.
* To use register names with standard convension, please use CAN_MO164_AMR.
*/
#define	CAN_MOAMR164	(CAN_MO164_AMR)

/** \brief  2498, Message Object  Arbitration Register */
#define CAN_MO164_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A498u)

/** Alias (User Manual Name) for CAN_MO164_AR.
* To use register names with standard convension, please use CAN_MO164_AR.
*/
#define	CAN_MOAR164	(CAN_MO164_AR)

/** \brief  249C, Message Object  Control Register */
#define CAN_MO164_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A49Cu)

/** Alias (User Manual Name) for CAN_MO164_CTR.
* To use register names with standard convension, please use CAN_MO164_CTR.
*/
#define	CAN_MOCTR164	(CAN_MO164_CTR)

/** \brief  2494, Message Object  Data Register High */
#define CAN_MO164_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A494u)

/** Alias (User Manual Name) for CAN_MO164_DATAH.
* To use register names with standard convension, please use CAN_MO164_DATAH.
*/
#define	CAN_MODATAH164	(CAN_MO164_DATAH)

/** \brief  2490, Message Object  Data Register Low */
#define CAN_MO164_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A490u)

/** Alias (User Manual Name) for CAN_MO164_DATAL.
* To use register names with standard convension, please use CAN_MO164_DATAL.
*/
#define	CAN_MODATAL164	(CAN_MO164_DATAL)

