luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2480, Message Object  Function Control Register */
#define CAN_MO164_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A480u)

/** Alias (User Manual Name) for CAN_MO164_EDATA0.
* To use register names with standard convension, please use CAN_MO164_EDATA0.
*/
#define	CAN_EMO164DATA0	(CAN_MO164_EDATA0)

/** \brief  2484, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO164_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A484u)

/** Alias (User Manual Name) for CAN_MO164_EDATA1.
* To use register names with standard convension, please use CAN_MO164_EDATA1.
*/
#define	CAN_EMO164DATA1	(CAN_MO164_EDATA1)

/** \brief  2488, Message Object  Interrupt Pointer Register */
#define CAN_MO164_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A488u)

/** Alias (User Manual Name) for CAN_MO164_EDATA2.
* To use register names with standard convension, please use CAN_MO164_EDATA2.
*/
#define	CAN_EMO164DATA2	(CAN_MO164_EDATA2)

/** \brief  248C, Message Object  Acceptance Mask Register */
#define CAN_MO164_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A48Cu)

/** Alias (User Manual Name) for CAN_MO164_EDATA3.
* To use register names with standard convension, please use CAN_MO164_EDATA3.
*/
#define	CAN_EMO164DATA3	(CAN_MO164_EDATA3)

/** \brief  2490, Message Object  Data Register Low */
#define CAN_MO164_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A490u)

/** Alias (User Manual Name) for CAN_MO164_EDATA4.
* To use register names with standard convension, please use CAN_MO164_EDATA4.
*/
#define	CAN_EMO164DATA4	(CAN_MO164_EDATA4)

/** \brief  2494, Message Object  Data Register High */
#define CAN_MO164_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A494u)

/** Alias (User Manual Name) for CAN_MO164_EDATA5.
* To use register names with standard convension, please use CAN_MO164_EDATA5.
*/
#define	CAN_EMO164DATA5	(CAN_MO164_EDATA5)

/** \brief  2498, Message Object  Arbitration Register */
#define CAN_MO164_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A498u)

/** Alias (User Manual Name) for CAN_MO164_EDATA6.
* To use register names with standard convension, please use CAN_MO164_EDATA6.
*/
#define	CAN_EMO164DATA6	(CAN_MO164_EDATA6)

/** \brief  2480, Message Object  Function Control Register */
#define CAN_MO164_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A480u)

/** Alias (User Manual Name) for CAN_MO164_FCR.
* To use register names with standard convension, please use CAN_MO164_FCR.
*/
#define	CAN_MOFCR164	(CAN_MO164_FCR)

/** \brief  2484, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO164_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A484u)

/** Alias (User Manual Name) for CAN_MO164_FGPR.
* To use register names with standard convension, please use CAN_MO164_FGPR.
*/
#define	CAN_MOFGPR164	(CAN_MO164_FGPR)

/** \brief  2488, Message Object  Interrupt Pointer Register */
#define CAN_MO164_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A488u)

/** Alias (User Manual Name) for CAN_MO164_IPR.
* To use register names with standard convension, please use CAN_MO164_IPR.
*/
#define	CAN_MOIPR164	(CAN_MO164_IPR)

/** \brief  249C, Message Object  Control Register */
#define CAN_MO164_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A49Cu)

/** Alias (User Manual Name) for CAN_MO164_STAT.
* To use register names with standard convension, please use CAN_MO164_STAT.
*/
#define	CAN_MOSTAT164	(CAN_MO164_STAT)

/** \brief  24AC, Message Object  Acceptance Mask Register */
#define CAN_MO165_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A4ACu)

/** Alias (User Manual Name) for CAN_MO165_AMR.
* To use register names with standard convension, please use CAN_MO165_AMR.
*/
#define	CAN_MOAMR165	(CAN_MO165_AMR)

/** \brief  24B8, Message Object  Arbitration Register */
#define CAN_MO165_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A4B8u)

/** Alias (User Manual Name) for CAN_MO165_AR.
* To use register names with standard convension, please use CAN_MO165_AR.
*/
#define	CAN_MOAR165	(CAN_MO165_AR)

/** \brief  24BC, Message Object  Control Register */
#define CAN_MO165_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A4BCu)

/** Alias (User Manual Name) for CAN_MO165_CTR.
* To use register names with standard convension, please use CAN_MO165_CTR.
*/
#define	CAN_MOCTR165	(CAN_MO165_CTR)

/** \brief  24B4, Message Object  Data Register High */
#define CAN_MO165_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A4B4u)

/** Alias (User Manual Name) for CAN_MO165_DATAH.
* To use register names with standard convension, please use CAN_MO165_DATAH.
*/
#define	CAN_MODATAH165	(CAN_MO165_DATAH)

/** \brief  24B0, Message Object  Data Register Low */
#define CAN_MO165_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A4B0u)

/** Alias (User Manual Name) for CAN_MO165_DATAL.
* To use register names with standard convension, please use CAN_MO165_DATAL.
*/
#define	CAN_MODATAL165	(CAN_MO165_DATAL)

/** \brief  24A0, Message Object  Function Control Register */
#define CAN_MO165_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A4A0u)

/** Alias (User Manual Name) for CAN_MO165_EDATA0.
* To use register names with standard convension, please use CAN_MO165_EDATA0.
*/
#define	CAN_EMO165DATA0	(CAN_MO165_EDATA0)

/** \brief  24A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO165_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A4A4u)

/** Alias (User Manual Name) for CAN_MO165_EDATA1.
* To use register names with standard convension, please use CAN_MO165_EDATA1.
*/
#define	CAN_EMO165DATA1	(CAN_MO165_EDATA1)

/** \brief  24A8, Message Object  Interrupt Pointer Register */
#define CAN_MO165_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A4A8u)

/** Alias (User Manual Name) for CAN_MO165_EDATA2.
* To use register names with standard convension, please use CAN_MO165_EDATA2.
*/
#define	CAN_EMO165DATA2	(CAN_MO165_EDATA2)

/** \brief  24AC, Message Object  Acceptance Mask Register */
#define CAN_MO165_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A4ACu)

/** Alias (User Manual Name) for CAN_MO165_EDATA3.
* To use register names with standard convension, please use CAN_MO165_EDATA3.
*/
#define	CAN_EMO165DATA3	(CAN_MO165_EDATA3)

/** \brief  24B0, Message Object  Data Register Low */
#define CAN_MO165_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A4B0u)

/** Alias (User Manual Name) for CAN_MO165_EDATA4.
* To use register names with standard convension, please use CAN_MO165_EDATA4.
*/
#define	CAN_EMO165DATA4	(CAN_MO165_EDATA4)

