luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  24B4, Message Object  Data Register High */
#define CAN_MO165_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A4B4u)

/** Alias (User Manual Name) for CAN_MO165_EDATA5.
* To use register names with standard convension, please use CAN_MO165_EDATA5.
*/
#define	CAN_EMO165DATA5	(CAN_MO165_EDATA5)

/** \brief  24B8, Message Object  Arbitration Register */
#define CAN_MO165_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A4B8u)

/** Alias (User Manual Name) for CAN_MO165_EDATA6.
* To use register names with standard convension, please use CAN_MO165_EDATA6.
*/
#define	CAN_EMO165DATA6	(CAN_MO165_EDATA6)

/** \brief  24A0, Message Object  Function Control Register */
#define CAN_MO165_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A4A0u)

/** Alias (User Manual Name) for CAN_MO165_FCR.
* To use register names with standard convension, please use CAN_MO165_FCR.
*/
#define	CAN_MOFCR165	(CAN_MO165_FCR)

/** \brief  24A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO165_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A4A4u)

/** Alias (User Manual Name) for CAN_MO165_FGPR.
* To use register names with standard convension, please use CAN_MO165_FGPR.
*/
#define	CAN_MOFGPR165	(CAN_MO165_FGPR)

/** \brief  24A8, Message Object  Interrupt Pointer Register */
#define CAN_MO165_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A4A8u)

/** Alias (User Manual Name) for CAN_MO165_IPR.
* To use register names with standard convension, please use CAN_MO165_IPR.
*/
#define	CAN_MOIPR165	(CAN_MO165_IPR)

/** \brief  24BC, Message Object  Control Register */
#define CAN_MO165_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A4BCu)

/** Alias (User Manual Name) for CAN_MO165_STAT.
* To use register names with standard convension, please use CAN_MO165_STAT.
*/
#define	CAN_MOSTAT165	(CAN_MO165_STAT)

/** \brief  24CC, Message Object  Acceptance Mask Register */
#define CAN_MO166_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A4CCu)

/** Alias (User Manual Name) for CAN_MO166_AMR.
* To use register names with standard convension, please use CAN_MO166_AMR.
*/
#define	CAN_MOAMR166	(CAN_MO166_AMR)

/** \brief  24D8, Message Object  Arbitration Register */
#define CAN_MO166_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A4D8u)

/** Alias (User Manual Name) for CAN_MO166_AR.
* To use register names with standard convension, please use CAN_MO166_AR.
*/
#define	CAN_MOAR166	(CAN_MO166_AR)

/** \brief  24DC, Message Object  Control Register */
#define CAN_MO166_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A4DCu)

/** Alias (User Manual Name) for CAN_MO166_CTR.
* To use register names with standard convension, please use CAN_MO166_CTR.
*/
#define	CAN_MOCTR166	(CAN_MO166_CTR)

/** \brief  24D4, Message Object  Data Register High */
#define CAN_MO166_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A4D4u)

/** Alias (User Manual Name) for CAN_MO166_DATAH.
* To use register names with standard convension, please use CAN_MO166_DATAH.
*/
#define	CAN_MODATAH166	(CAN_MO166_DATAH)

/** \brief  24D0, Message Object  Data Register Low */
#define CAN_MO166_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A4D0u)

/** Alias (User Manual Name) for CAN_MO166_DATAL.
* To use register names with standard convension, please use CAN_MO166_DATAL.
*/
#define	CAN_MODATAL166	(CAN_MO166_DATAL)

/** \brief  24C0, Message Object  Function Control Register */
#define CAN_MO166_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A4C0u)

/** Alias (User Manual Name) for CAN_MO166_EDATA0.
* To use register names with standard convension, please use CAN_MO166_EDATA0.
*/
#define	CAN_EMO166DATA0	(CAN_MO166_EDATA0)

/** \brief  24C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO166_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A4C4u)

/** Alias (User Manual Name) for CAN_MO166_EDATA1.
* To use register names with standard convension, please use CAN_MO166_EDATA1.
*/
#define	CAN_EMO166DATA1	(CAN_MO166_EDATA1)

/** \brief  24C8, Message Object  Interrupt Pointer Register */
#define CAN_MO166_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A4C8u)

/** Alias (User Manual Name) for CAN_MO166_EDATA2.
* To use register names with standard convension, please use CAN_MO166_EDATA2.
*/
#define	CAN_EMO166DATA2	(CAN_MO166_EDATA2)

/** \brief  24CC, Message Object  Acceptance Mask Register */
#define CAN_MO166_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A4CCu)

/** Alias (User Manual Name) for CAN_MO166_EDATA3.
* To use register names with standard convension, please use CAN_MO166_EDATA3.
*/
#define	CAN_EMO166DATA3	(CAN_MO166_EDATA3)

/** \brief  24D0, Message Object  Data Register Low */
#define CAN_MO166_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A4D0u)

/** Alias (User Manual Name) for CAN_MO166_EDATA4.
* To use register names with standard convension, please use CAN_MO166_EDATA4.
*/
#define	CAN_EMO166DATA4	(CAN_MO166_EDATA4)

/** \brief  24D4, Message Object  Data Register High */
#define CAN_MO166_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A4D4u)

/** Alias (User Manual Name) for CAN_MO166_EDATA5.
* To use register names with standard convension, please use CAN_MO166_EDATA5.
*/
#define	CAN_EMO166DATA5	(CAN_MO166_EDATA5)

/** \brief  24D8, Message Object  Arbitration Register */
#define CAN_MO166_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A4D8u)

/** Alias (User Manual Name) for CAN_MO166_EDATA6.
* To use register names with standard convension, please use CAN_MO166_EDATA6.
*/
#define	CAN_EMO166DATA6	(CAN_MO166_EDATA6)

/** \brief  24C0, Message Object  Function Control Register */
#define CAN_MO166_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A4C0u)

/** Alias (User Manual Name) for CAN_MO166_FCR.
* To use register names with standard convension, please use CAN_MO166_FCR.
*/
#define	CAN_MOFCR166	(CAN_MO166_FCR)

/** \brief  24C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO166_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A4C4u)

/** Alias (User Manual Name) for CAN_MO166_FGPR.
* To use register names with standard convension, please use CAN_MO166_FGPR.
*/
#define	CAN_MOFGPR166	(CAN_MO166_FGPR)

/** \brief  24C8, Message Object  Interrupt Pointer Register */
#define CAN_MO166_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A4C8u)

