luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO166_IPR.
* To use register names with standard convension, please use CAN_MO166_IPR.
*/
#define	CAN_MOIPR166	(CAN_MO166_IPR)

/** \brief  24DC, Message Object  Control Register */
#define CAN_MO166_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A4DCu)

/** Alias (User Manual Name) for CAN_MO166_STAT.
* To use register names with standard convension, please use CAN_MO166_STAT.
*/
#define	CAN_MOSTAT166	(CAN_MO166_STAT)

/** \brief  24EC, Message Object  Acceptance Mask Register */
#define CAN_MO167_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A4ECu)

/** Alias (User Manual Name) for CAN_MO167_AMR.
* To use register names with standard convension, please use CAN_MO167_AMR.
*/
#define	CAN_MOAMR167	(CAN_MO167_AMR)

/** \brief  24F8, Message Object  Arbitration Register */
#define CAN_MO167_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A4F8u)

/** Alias (User Manual Name) for CAN_MO167_AR.
* To use register names with standard convension, please use CAN_MO167_AR.
*/
#define	CAN_MOAR167	(CAN_MO167_AR)

/** \brief  24FC, Message Object  Control Register */
#define CAN_MO167_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A4FCu)

/** Alias (User Manual Name) for CAN_MO167_CTR.
* To use register names with standard convension, please use CAN_MO167_CTR.
*/
#define	CAN_MOCTR167	(CAN_MO167_CTR)

/** \brief  24F4, Message Object  Data Register High */
#define CAN_MO167_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A4F4u)

/** Alias (User Manual Name) for CAN_MO167_DATAH.
* To use register names with standard convension, please use CAN_MO167_DATAH.
*/
#define	CAN_MODATAH167	(CAN_MO167_DATAH)

/** \brief  24F0, Message Object  Data Register Low */
#define CAN_MO167_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A4F0u)

/** Alias (User Manual Name) for CAN_MO167_DATAL.
* To use register names with standard convension, please use CAN_MO167_DATAL.
*/
#define	CAN_MODATAL167	(CAN_MO167_DATAL)

/** \brief  24E0, Message Object  Function Control Register */
#define CAN_MO167_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A4E0u)

/** Alias (User Manual Name) for CAN_MO167_EDATA0.
* To use register names with standard convension, please use CAN_MO167_EDATA0.
*/
#define	CAN_EMO167DATA0	(CAN_MO167_EDATA0)

/** \brief  24E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO167_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A4E4u)

/** Alias (User Manual Name) for CAN_MO167_EDATA1.
* To use register names with standard convension, please use CAN_MO167_EDATA1.
*/
#define	CAN_EMO167DATA1	(CAN_MO167_EDATA1)

/** \brief  24E8, Message Object  Interrupt Pointer Register */
#define CAN_MO167_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A4E8u)

/** Alias (User Manual Name) for CAN_MO167_EDATA2.
* To use register names with standard convension, please use CAN_MO167_EDATA2.
*/
#define	CAN_EMO167DATA2	(CAN_MO167_EDATA2)

/** \brief  24EC, Message Object  Acceptance Mask Register */
#define CAN_MO167_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A4ECu)

/** Alias (User Manual Name) for CAN_MO167_EDATA3.
* To use register names with standard convension, please use CAN_MO167_EDATA3.
*/
#define	CAN_EMO167DATA3	(CAN_MO167_EDATA3)

/** \brief  24F0, Message Object  Data Register Low */
#define CAN_MO167_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A4F0u)

/** Alias (User Manual Name) for CAN_MO167_EDATA4.
* To use register names with standard convension, please use CAN_MO167_EDATA4.
*/
#define	CAN_EMO167DATA4	(CAN_MO167_EDATA4)

/** \brief  24F4, Message Object  Data Register High */
#define CAN_MO167_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A4F4u)

/** Alias (User Manual Name) for CAN_MO167_EDATA5.
* To use register names with standard convension, please use CAN_MO167_EDATA5.
*/
#define	CAN_EMO167DATA5	(CAN_MO167_EDATA5)

/** \brief  24F8, Message Object  Arbitration Register */
#define CAN_MO167_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A4F8u)

/** Alias (User Manual Name) for CAN_MO167_EDATA6.
* To use register names with standard convension, please use CAN_MO167_EDATA6.
*/
#define	CAN_EMO167DATA6	(CAN_MO167_EDATA6)

/** \brief  24E0, Message Object  Function Control Register */
#define CAN_MO167_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A4E0u)

/** Alias (User Manual Name) for CAN_MO167_FCR.
* To use register names with standard convension, please use CAN_MO167_FCR.
*/
#define	CAN_MOFCR167	(CAN_MO167_FCR)

/** \brief  24E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO167_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A4E4u)

/** Alias (User Manual Name) for CAN_MO167_FGPR.
* To use register names with standard convension, please use CAN_MO167_FGPR.
*/
#define	CAN_MOFGPR167	(CAN_MO167_FGPR)

/** \brief  24E8, Message Object  Interrupt Pointer Register */
#define CAN_MO167_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A4E8u)

/** Alias (User Manual Name) for CAN_MO167_IPR.
* To use register names with standard convension, please use CAN_MO167_IPR.
*/
#define	CAN_MOIPR167	(CAN_MO167_IPR)

/** \brief  24FC, Message Object  Control Register */
#define CAN_MO167_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A4FCu)

/** Alias (User Manual Name) for CAN_MO167_STAT.
* To use register names with standard convension, please use CAN_MO167_STAT.
*/
#define	CAN_MOSTAT167	(CAN_MO167_STAT)

/** \brief  250C, Message Object  Acceptance Mask Register */
#define CAN_MO168_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A50Cu)

/** Alias (User Manual Name) for CAN_MO168_AMR.
* To use register names with standard convension, please use CAN_MO168_AMR.
*/
#define	CAN_MOAMR168	(CAN_MO168_AMR)

/** \brief  2518, Message Object  Arbitration Register */
#define CAN_MO168_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A518u)

/** Alias (User Manual Name) for CAN_MO168_AR.
* To use register names with standard convension, please use CAN_MO168_AR.
*/
#define	CAN_MOAR168	(CAN_MO168_AR)

