luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  251C, Message Object  Control Register */
#define CAN_MO168_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A51Cu)

/** Alias (User Manual Name) for CAN_MO168_CTR.
* To use register names with standard convension, please use CAN_MO168_CTR.
*/
#define	CAN_MOCTR168	(CAN_MO168_CTR)

/** \brief  2514, Message Object  Data Register High */
#define CAN_MO168_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A514u)

/** Alias (User Manual Name) for CAN_MO168_DATAH.
* To use register names with standard convension, please use CAN_MO168_DATAH.
*/
#define	CAN_MODATAH168	(CAN_MO168_DATAH)

/** \brief  2510, Message Object  Data Register Low */
#define CAN_MO168_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A510u)

/** Alias (User Manual Name) for CAN_MO168_DATAL.
* To use register names with standard convension, please use CAN_MO168_DATAL.
*/
#define	CAN_MODATAL168	(CAN_MO168_DATAL)

/** \brief  2500, Message Object  Function Control Register */
#define CAN_MO168_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A500u)

/** Alias (User Manual Name) for CAN_MO168_EDATA0.
* To use register names with standard convension, please use CAN_MO168_EDATA0.
*/
#define	CAN_EMO168DATA0	(CAN_MO168_EDATA0)

/** \brief  2504, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO168_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A504u)

/** Alias (User Manual Name) for CAN_MO168_EDATA1.
* To use register names with standard convension, please use CAN_MO168_EDATA1.
*/
#define	CAN_EMO168DATA1	(CAN_MO168_EDATA1)

/** \brief  2508, Message Object  Interrupt Pointer Register */
#define CAN_MO168_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A508u)

/** Alias (User Manual Name) for CAN_MO168_EDATA2.
* To use register names with standard convension, please use CAN_MO168_EDATA2.
*/
#define	CAN_EMO168DATA2	(CAN_MO168_EDATA2)

/** \brief  250C, Message Object  Acceptance Mask Register */
#define CAN_MO168_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A50Cu)

/** Alias (User Manual Name) for CAN_MO168_EDATA3.
* To use register names with standard convension, please use CAN_MO168_EDATA3.
*/
#define	CAN_EMO168DATA3	(CAN_MO168_EDATA3)

/** \brief  2510, Message Object  Data Register Low */
#define CAN_MO168_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A510u)

/** Alias (User Manual Name) for CAN_MO168_EDATA4.
* To use register names with standard convension, please use CAN_MO168_EDATA4.
*/
#define	CAN_EMO168DATA4	(CAN_MO168_EDATA4)

/** \brief  2514, Message Object  Data Register High */
#define CAN_MO168_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A514u)

/** Alias (User Manual Name) for CAN_MO168_EDATA5.
* To use register names with standard convension, please use CAN_MO168_EDATA5.
*/
#define	CAN_EMO168DATA5	(CAN_MO168_EDATA5)

/** \brief  2518, Message Object  Arbitration Register */
#define CAN_MO168_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A518u)

/** Alias (User Manual Name) for CAN_MO168_EDATA6.
* To use register names with standard convension, please use CAN_MO168_EDATA6.
*/
#define	CAN_EMO168DATA6	(CAN_MO168_EDATA6)

/** \brief  2500, Message Object  Function Control Register */
#define CAN_MO168_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A500u)

/** Alias (User Manual Name) for CAN_MO168_FCR.
* To use register names with standard convension, please use CAN_MO168_FCR.
*/
#define	CAN_MOFCR168	(CAN_MO168_FCR)

/** \brief  2504, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO168_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A504u)

/** Alias (User Manual Name) for CAN_MO168_FGPR.
* To use register names with standard convension, please use CAN_MO168_FGPR.
*/
#define	CAN_MOFGPR168	(CAN_MO168_FGPR)

/** \brief  2508, Message Object  Interrupt Pointer Register */
#define CAN_MO168_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A508u)

/** Alias (User Manual Name) for CAN_MO168_IPR.
* To use register names with standard convension, please use CAN_MO168_IPR.
*/
#define	CAN_MOIPR168	(CAN_MO168_IPR)

/** \brief  251C, Message Object  Control Register */
#define CAN_MO168_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A51Cu)

/** Alias (User Manual Name) for CAN_MO168_STAT.
* To use register names with standard convension, please use CAN_MO168_STAT.
*/
#define	CAN_MOSTAT168	(CAN_MO168_STAT)

/** \brief  252C, Message Object  Acceptance Mask Register */
#define CAN_MO169_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A52Cu)

/** Alias (User Manual Name) for CAN_MO169_AMR.
* To use register names with standard convension, please use CAN_MO169_AMR.
*/
#define	CAN_MOAMR169	(CAN_MO169_AMR)

/** \brief  2538, Message Object  Arbitration Register */
#define CAN_MO169_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A538u)

/** Alias (User Manual Name) for CAN_MO169_AR.
* To use register names with standard convension, please use CAN_MO169_AR.
*/
#define	CAN_MOAR169	(CAN_MO169_AR)

/** \brief  253C, Message Object  Control Register */
#define CAN_MO169_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A53Cu)

/** Alias (User Manual Name) for CAN_MO169_CTR.
* To use register names with standard convension, please use CAN_MO169_CTR.
*/
#define	CAN_MOCTR169	(CAN_MO169_CTR)

/** \brief  2534, Message Object  Data Register High */
#define CAN_MO169_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A534u)

/** Alias (User Manual Name) for CAN_MO169_DATAH.
* To use register names with standard convension, please use CAN_MO169_DATAH.
*/
#define	CAN_MODATAH169	(CAN_MO169_DATAH)

/** \brief  2530, Message Object  Data Register Low */
#define CAN_MO169_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A530u)

/** Alias (User Manual Name) for CAN_MO169_DATAL.
* To use register names with standard convension, please use CAN_MO169_DATAL.
*/
#define	CAN_MODATAL169	(CAN_MO169_DATAL)

/** \brief  2520, Message Object  Function Control Register */
#define CAN_MO169_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A520u)

/** Alias (User Manual Name) for CAN_MO169_EDATA0.
* To use register names with standard convension, please use CAN_MO169_EDATA0.
*/
#define	CAN_EMO169DATA0	(CAN_MO169_EDATA0)

/** \brief  2524, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO169_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A524u)

/** Alias (User Manual Name) for CAN_MO169_EDATA1.
* To use register names with standard convension, please use CAN_MO169_EDATA1.
*/
#define	CAN_EMO169DATA1	(CAN_MO169_EDATA1)

