luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2528, Message Object  Interrupt Pointer Register */
#define CAN_MO169_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A528u)

/** Alias (User Manual Name) for CAN_MO169_EDATA2.
* To use register names with standard convension, please use CAN_MO169_EDATA2.
*/
#define	CAN_EMO169DATA2	(CAN_MO169_EDATA2)

/** \brief  252C, Message Object  Acceptance Mask Register */
#define CAN_MO169_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A52Cu)

/** Alias (User Manual Name) for CAN_MO169_EDATA3.
* To use register names with standard convension, please use CAN_MO169_EDATA3.
*/
#define	CAN_EMO169DATA3	(CAN_MO169_EDATA3)

/** \brief  2530, Message Object  Data Register Low */
#define CAN_MO169_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A530u)

/** Alias (User Manual Name) for CAN_MO169_EDATA4.
* To use register names with standard convension, please use CAN_MO169_EDATA4.
*/
#define	CAN_EMO169DATA4	(CAN_MO169_EDATA4)

/** \brief  2534, Message Object  Data Register High */
#define CAN_MO169_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A534u)

/** Alias (User Manual Name) for CAN_MO169_EDATA5.
* To use register names with standard convension, please use CAN_MO169_EDATA5.
*/
#define	CAN_EMO169DATA5	(CAN_MO169_EDATA5)

/** \brief  2538, Message Object  Arbitration Register */
#define CAN_MO169_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A538u)

/** Alias (User Manual Name) for CAN_MO169_EDATA6.
* To use register names with standard convension, please use CAN_MO169_EDATA6.
*/
#define	CAN_EMO169DATA6	(CAN_MO169_EDATA6)

/** \brief  2520, Message Object  Function Control Register */
#define CAN_MO169_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A520u)

/** Alias (User Manual Name) for CAN_MO169_FCR.
* To use register names with standard convension, please use CAN_MO169_FCR.
*/
#define	CAN_MOFCR169	(CAN_MO169_FCR)

/** \brief  2524, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO169_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A524u)

/** Alias (User Manual Name) for CAN_MO169_FGPR.
* To use register names with standard convension, please use CAN_MO169_FGPR.
*/
#define	CAN_MOFGPR169	(CAN_MO169_FGPR)

/** \brief  2528, Message Object  Interrupt Pointer Register */
#define CAN_MO169_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A528u)

/** Alias (User Manual Name) for CAN_MO169_IPR.
* To use register names with standard convension, please use CAN_MO169_IPR.
*/
#define	CAN_MOIPR169	(CAN_MO169_IPR)

/** \brief  253C, Message Object  Control Register */
#define CAN_MO169_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A53Cu)

/** Alias (User Manual Name) for CAN_MO169_STAT.
* To use register names with standard convension, please use CAN_MO169_STAT.
*/
#define	CAN_MOSTAT169	(CAN_MO169_STAT)

/** \brief  120C, Message Object  Acceptance Mask Register */
#define CAN_MO16_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001920Cu)

/** Alias (User Manual Name) for CAN_MO16_AMR.
* To use register names with standard convension, please use CAN_MO16_AMR.
*/
#define	CAN_MOAMR16	(CAN_MO16_AMR)

/** \brief  1218, Message Object  Arbitration Register */
#define CAN_MO16_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019218u)

/** Alias (User Manual Name) for CAN_MO16_AR.
* To use register names with standard convension, please use CAN_MO16_AR.
*/
#define	CAN_MOAR16	(CAN_MO16_AR)

/** \brief  121C, Message Object  Control Register */
#define CAN_MO16_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001921Cu)

/** Alias (User Manual Name) for CAN_MO16_CTR.
* To use register names with standard convension, please use CAN_MO16_CTR.
*/
#define	CAN_MOCTR16	(CAN_MO16_CTR)

/** \brief  1214, Message Object  Data Register High */
#define CAN_MO16_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019214u)

/** Alias (User Manual Name) for CAN_MO16_DATAH.
* To use register names with standard convension, please use CAN_MO16_DATAH.
*/
#define	CAN_MODATAH16	(CAN_MO16_DATAH)

/** \brief  1210, Message Object  Data Register Low */
#define CAN_MO16_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019210u)

/** Alias (User Manual Name) for CAN_MO16_DATAL.
* To use register names with standard convension, please use CAN_MO16_DATAL.
*/
#define	CAN_MODATAL16	(CAN_MO16_DATAL)

/** \brief  1200, Message Object  Function Control Register */
#define CAN_MO16_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019200u)

/** Alias (User Manual Name) for CAN_MO16_EDATA0.
* To use register names with standard convension, please use CAN_MO16_EDATA0.
*/
#define	CAN_EMO16DATA0	(CAN_MO16_EDATA0)

/** \brief  1204, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO16_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019204u)

/** Alias (User Manual Name) for CAN_MO16_EDATA1.
* To use register names with standard convension, please use CAN_MO16_EDATA1.
*/
#define	CAN_EMO16DATA1	(CAN_MO16_EDATA1)

/** \brief  1208, Message Object  Interrupt Pointer Register */
#define CAN_MO16_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019208u)

/** Alias (User Manual Name) for CAN_MO16_EDATA2.
* To use register names with standard convension, please use CAN_MO16_EDATA2.
*/
#define	CAN_EMO16DATA2	(CAN_MO16_EDATA2)

/** \brief  120C, Message Object  Acceptance Mask Register */
#define CAN_MO16_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001920Cu)

/** Alias (User Manual Name) for CAN_MO16_EDATA3.
* To use register names with standard convension, please use CAN_MO16_EDATA3.
*/
#define	CAN_EMO16DATA3	(CAN_MO16_EDATA3)

/** \brief  1210, Message Object  Data Register Low */
#define CAN_MO16_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019210u)

/** Alias (User Manual Name) for CAN_MO16_EDATA4.
* To use register names with standard convension, please use CAN_MO16_EDATA4.
*/
#define	CAN_EMO16DATA4	(CAN_MO16_EDATA4)

/** \brief  1214, Message Object  Data Register High */
#define CAN_MO16_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019214u)

/** Alias (User Manual Name) for CAN_MO16_EDATA5.
* To use register names with standard convension, please use CAN_MO16_EDATA5.
*/
#define	CAN_EMO16DATA5	(CAN_MO16_EDATA5)

/** \brief  1218, Message Object  Arbitration Register */
#define CAN_MO16_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019218u)

/** Alias (User Manual Name) for CAN_MO16_EDATA6.
* To use register names with standard convension, please use CAN_MO16_EDATA6.
*/
#define	CAN_EMO16DATA6	(CAN_MO16_EDATA6)

/** \brief  1200, Message Object  Function Control Register */
#define CAN_MO16_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019200u)

/** Alias (User Manual Name) for CAN_MO16_FCR.
* To use register names with standard convension, please use CAN_MO16_FCR.
*/
#define	CAN_MOFCR16	(CAN_MO16_FCR)

/** \brief  1204, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO16_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019204u)

/** Alias (User Manual Name) for CAN_MO16_FGPR.
* To use register names with standard convension, please use CAN_MO16_FGPR.
*/
#define	CAN_MOFGPR16	(CAN_MO16_FGPR)

/** \brief  1208, Message Object  Interrupt Pointer Register */
#define CAN_MO16_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019208u)

/** Alias (User Manual Name) for CAN_MO16_IPR.
* To use register names with standard convension, please use CAN_MO16_IPR.
*/
#define	CAN_MOIPR16	(CAN_MO16_IPR)

/** \brief  121C, Message Object  Control Register */
#define CAN_MO16_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001921Cu)

