luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO16_STAT.
* To use register names with standard convension, please use CAN_MO16_STAT.
*/
#define	CAN_MOSTAT16	(CAN_MO16_STAT)

/** \brief  254C, Message Object  Acceptance Mask Register */
#define CAN_MO170_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A54Cu)

/** Alias (User Manual Name) for CAN_MO170_AMR.
* To use register names with standard convension, please use CAN_MO170_AMR.
*/
#define	CAN_MOAMR170	(CAN_MO170_AMR)

/** \brief  2558, Message Object  Arbitration Register */
#define CAN_MO170_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A558u)

/** Alias (User Manual Name) for CAN_MO170_AR.
* To use register names with standard convension, please use CAN_MO170_AR.
*/
#define	CAN_MOAR170	(CAN_MO170_AR)

/** \brief  255C, Message Object  Control Register */
#define CAN_MO170_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A55Cu)

/** Alias (User Manual Name) for CAN_MO170_CTR.
* To use register names with standard convension, please use CAN_MO170_CTR.
*/
#define	CAN_MOCTR170	(CAN_MO170_CTR)

/** \brief  2554, Message Object  Data Register High */
#define CAN_MO170_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A554u)

/** Alias (User Manual Name) for CAN_MO170_DATAH.
* To use register names with standard convension, please use CAN_MO170_DATAH.
*/
#define	CAN_MODATAH170	(CAN_MO170_DATAH)

/** \brief  2550, Message Object  Data Register Low */
#define CAN_MO170_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A550u)

/** Alias (User Manual Name) for CAN_MO170_DATAL.
* To use register names with standard convension, please use CAN_MO170_DATAL.
*/
#define	CAN_MODATAL170	(CAN_MO170_DATAL)

/** \brief  2540, Message Object  Function Control Register */
#define CAN_MO170_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A540u)

/** Alias (User Manual Name) for CAN_MO170_EDATA0.
* To use register names with standard convension, please use CAN_MO170_EDATA0.
*/
#define	CAN_EMO170DATA0	(CAN_MO170_EDATA0)

/** \brief  2544, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO170_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A544u)

/** Alias (User Manual Name) for CAN_MO170_EDATA1.
* To use register names with standard convension, please use CAN_MO170_EDATA1.
*/
#define	CAN_EMO170DATA1	(CAN_MO170_EDATA1)

/** \brief  2548, Message Object  Interrupt Pointer Register */
#define CAN_MO170_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A548u)

/** Alias (User Manual Name) for CAN_MO170_EDATA2.
* To use register names with standard convension, please use CAN_MO170_EDATA2.
*/
#define	CAN_EMO170DATA2	(CAN_MO170_EDATA2)

/** \brief  254C, Message Object  Acceptance Mask Register */
#define CAN_MO170_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A54Cu)

/** Alias (User Manual Name) for CAN_MO170_EDATA3.
* To use register names with standard convension, please use CAN_MO170_EDATA3.
*/
#define	CAN_EMO170DATA3	(CAN_MO170_EDATA3)

/** \brief  2550, Message Object  Data Register Low */
#define CAN_MO170_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A550u)

/** Alias (User Manual Name) for CAN_MO170_EDATA4.
* To use register names with standard convension, please use CAN_MO170_EDATA4.
*/
#define	CAN_EMO170DATA4	(CAN_MO170_EDATA4)

/** \brief  2554, Message Object  Data Register High */
#define CAN_MO170_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A554u)

/** Alias (User Manual Name) for CAN_MO170_EDATA5.
* To use register names with standard convension, please use CAN_MO170_EDATA5.
*/
#define	CAN_EMO170DATA5	(CAN_MO170_EDATA5)

/** \brief  2558, Message Object  Arbitration Register */
#define CAN_MO170_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A558u)

/** Alias (User Manual Name) for CAN_MO170_EDATA6.
* To use register names with standard convension, please use CAN_MO170_EDATA6.
*/
#define	CAN_EMO170DATA6	(CAN_MO170_EDATA6)

/** \brief  2540, Message Object  Function Control Register */
#define CAN_MO170_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A540u)

/** Alias (User Manual Name) for CAN_MO170_FCR.
* To use register names with standard convension, please use CAN_MO170_FCR.
*/
#define	CAN_MOFCR170	(CAN_MO170_FCR)

/** \brief  2544, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO170_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A544u)

/** Alias (User Manual Name) for CAN_MO170_FGPR.
* To use register names with standard convension, please use CAN_MO170_FGPR.
*/
#define	CAN_MOFGPR170	(CAN_MO170_FGPR)

/** \brief  2548, Message Object  Interrupt Pointer Register */
#define CAN_MO170_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A548u)

/** Alias (User Manual Name) for CAN_MO170_IPR.
* To use register names with standard convension, please use CAN_MO170_IPR.
*/
#define	CAN_MOIPR170	(CAN_MO170_IPR)

/** \brief  255C, Message Object  Control Register */
#define CAN_MO170_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A55Cu)

/** Alias (User Manual Name) for CAN_MO170_STAT.
* To use register names with standard convension, please use CAN_MO170_STAT.
*/
#define	CAN_MOSTAT170	(CAN_MO170_STAT)

/** \brief  256C, Message Object  Acceptance Mask Register */
#define CAN_MO171_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A56Cu)

/** Alias (User Manual Name) for CAN_MO171_AMR.
* To use register names with standard convension, please use CAN_MO171_AMR.
*/
#define	CAN_MOAMR171	(CAN_MO171_AMR)

/** \brief  2578, Message Object  Arbitration Register */
#define CAN_MO171_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A578u)

/** Alias (User Manual Name) for CAN_MO171_AR.
* To use register names with standard convension, please use CAN_MO171_AR.
*/
#define	CAN_MOAR171	(CAN_MO171_AR)

/** \brief  257C, Message Object  Control Register */
#define CAN_MO171_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A57Cu)

/** Alias (User Manual Name) for CAN_MO171_CTR.
* To use register names with standard convension, please use CAN_MO171_CTR.
*/
#define	CAN_MOCTR171	(CAN_MO171_CTR)

