luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2574, Message Object  Data Register High */
#define CAN_MO171_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A574u)

/** Alias (User Manual Name) for CAN_MO171_DATAH.
* To use register names with standard convension, please use CAN_MO171_DATAH.
*/
#define	CAN_MODATAH171	(CAN_MO171_DATAH)

/** \brief  2570, Message Object  Data Register Low */
#define CAN_MO171_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A570u)

/** Alias (User Manual Name) for CAN_MO171_DATAL.
* To use register names with standard convension, please use CAN_MO171_DATAL.
*/
#define	CAN_MODATAL171	(CAN_MO171_DATAL)

/** \brief  2560, Message Object  Function Control Register */
#define CAN_MO171_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A560u)

/** Alias (User Manual Name) for CAN_MO171_EDATA0.
* To use register names with standard convension, please use CAN_MO171_EDATA0.
*/
#define	CAN_EMO171DATA0	(CAN_MO171_EDATA0)

/** \brief  2564, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO171_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A564u)

/** Alias (User Manual Name) for CAN_MO171_EDATA1.
* To use register names with standard convension, please use CAN_MO171_EDATA1.
*/
#define	CAN_EMO171DATA1	(CAN_MO171_EDATA1)

/** \brief  2568, Message Object  Interrupt Pointer Register */
#define CAN_MO171_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A568u)

/** Alias (User Manual Name) for CAN_MO171_EDATA2.
* To use register names with standard convension, please use CAN_MO171_EDATA2.
*/
#define	CAN_EMO171DATA2	(CAN_MO171_EDATA2)

/** \brief  256C, Message Object  Acceptance Mask Register */
#define CAN_MO171_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A56Cu)

/** Alias (User Manual Name) for CAN_MO171_EDATA3.
* To use register names with standard convension, please use CAN_MO171_EDATA3.
*/
#define	CAN_EMO171DATA3	(CAN_MO171_EDATA3)

/** \brief  2570, Message Object  Data Register Low */
#define CAN_MO171_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A570u)

/** Alias (User Manual Name) for CAN_MO171_EDATA4.
* To use register names with standard convension, please use CAN_MO171_EDATA4.
*/
#define	CAN_EMO171DATA4	(CAN_MO171_EDATA4)

/** \brief  2574, Message Object  Data Register High */
#define CAN_MO171_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A574u)

/** Alias (User Manual Name) for CAN_MO171_EDATA5.
* To use register names with standard convension, please use CAN_MO171_EDATA5.
*/
#define	CAN_EMO171DATA5	(CAN_MO171_EDATA5)

/** \brief  2578, Message Object  Arbitration Register */
#define CAN_MO171_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A578u)

/** Alias (User Manual Name) for CAN_MO171_EDATA6.
* To use register names with standard convension, please use CAN_MO171_EDATA6.
*/
#define	CAN_EMO171DATA6	(CAN_MO171_EDATA6)

/** \brief  2560, Message Object  Function Control Register */
#define CAN_MO171_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A560u)

/** Alias (User Manual Name) for CAN_MO171_FCR.
* To use register names with standard convension, please use CAN_MO171_FCR.
*/
#define	CAN_MOFCR171	(CAN_MO171_FCR)

/** \brief  2564, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO171_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A564u)

/** Alias (User Manual Name) for CAN_MO171_FGPR.
* To use register names with standard convension, please use CAN_MO171_FGPR.
*/
#define	CAN_MOFGPR171	(CAN_MO171_FGPR)

/** \brief  2568, Message Object  Interrupt Pointer Register */
#define CAN_MO171_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A568u)

/** Alias (User Manual Name) for CAN_MO171_IPR.
* To use register names with standard convension, please use CAN_MO171_IPR.
*/
#define	CAN_MOIPR171	(CAN_MO171_IPR)

/** \brief  257C, Message Object  Control Register */
#define CAN_MO171_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A57Cu)

/** Alias (User Manual Name) for CAN_MO171_STAT.
* To use register names with standard convension, please use CAN_MO171_STAT.
*/
#define	CAN_MOSTAT171	(CAN_MO171_STAT)

/** \brief  258C, Message Object  Acceptance Mask Register */
#define CAN_MO172_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A58Cu)

/** Alias (User Manual Name) for CAN_MO172_AMR.
* To use register names with standard convension, please use CAN_MO172_AMR.
*/
#define	CAN_MOAMR172	(CAN_MO172_AMR)

/** \brief  2598, Message Object  Arbitration Register */
#define CAN_MO172_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A598u)

/** Alias (User Manual Name) for CAN_MO172_AR.
* To use register names with standard convension, please use CAN_MO172_AR.
*/
#define	CAN_MOAR172	(CAN_MO172_AR)

/** \brief  259C, Message Object  Control Register */
#define CAN_MO172_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A59Cu)

/** Alias (User Manual Name) for CAN_MO172_CTR.
* To use register names with standard convension, please use CAN_MO172_CTR.
*/
#define	CAN_MOCTR172	(CAN_MO172_CTR)

/** \brief  2594, Message Object  Data Register High */
#define CAN_MO172_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A594u)

/** Alias (User Manual Name) for CAN_MO172_DATAH.
* To use register names with standard convension, please use CAN_MO172_DATAH.
*/
#define	CAN_MODATAH172	(CAN_MO172_DATAH)

/** \brief  2590, Message Object  Data Register Low */
#define CAN_MO172_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A590u)

/** Alias (User Manual Name) for CAN_MO172_DATAL.
* To use register names with standard convension, please use CAN_MO172_DATAL.
*/
#define	CAN_MODATAL172	(CAN_MO172_DATAL)

/** \brief  2580, Message Object  Function Control Register */
#define CAN_MO172_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A580u)

/** Alias (User Manual Name) for CAN_MO172_EDATA0.
* To use register names with standard convension, please use CAN_MO172_EDATA0.
*/
#define	CAN_EMO172DATA0	(CAN_MO172_EDATA0)

/** \brief  2584, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO172_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A584u)

