luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO172_EDATA1.
* To use register names with standard convension, please use CAN_MO172_EDATA1.
*/
#define	CAN_EMO172DATA1	(CAN_MO172_EDATA1)

/** \brief  2588, Message Object  Interrupt Pointer Register */
#define CAN_MO172_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A588u)

/** Alias (User Manual Name) for CAN_MO172_EDATA2.
* To use register names with standard convension, please use CAN_MO172_EDATA2.
*/
#define	CAN_EMO172DATA2	(CAN_MO172_EDATA2)

/** \brief  258C, Message Object  Acceptance Mask Register */
#define CAN_MO172_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A58Cu)

/** Alias (User Manual Name) for CAN_MO172_EDATA3.
* To use register names with standard convension, please use CAN_MO172_EDATA3.
*/
#define	CAN_EMO172DATA3	(CAN_MO172_EDATA3)

/** \brief  2590, Message Object  Data Register Low */
#define CAN_MO172_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A590u)

/** Alias (User Manual Name) for CAN_MO172_EDATA4.
* To use register names with standard convension, please use CAN_MO172_EDATA4.
*/
#define	CAN_EMO172DATA4	(CAN_MO172_EDATA4)

/** \brief  2594, Message Object  Data Register High */
#define CAN_MO172_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A594u)

/** Alias (User Manual Name) for CAN_MO172_EDATA5.
* To use register names with standard convension, please use CAN_MO172_EDATA5.
*/
#define	CAN_EMO172DATA5	(CAN_MO172_EDATA5)

/** \brief  2598, Message Object  Arbitration Register */
#define CAN_MO172_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A598u)

/** Alias (User Manual Name) for CAN_MO172_EDATA6.
* To use register names with standard convension, please use CAN_MO172_EDATA6.
*/
#define	CAN_EMO172DATA6	(CAN_MO172_EDATA6)

/** \brief  2580, Message Object  Function Control Register */
#define CAN_MO172_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A580u)

/** Alias (User Manual Name) for CAN_MO172_FCR.
* To use register names with standard convension, please use CAN_MO172_FCR.
*/
#define	CAN_MOFCR172	(CAN_MO172_FCR)

/** \brief  2584, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO172_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A584u)

/** Alias (User Manual Name) for CAN_MO172_FGPR.
* To use register names with standard convension, please use CAN_MO172_FGPR.
*/
#define	CAN_MOFGPR172	(CAN_MO172_FGPR)

/** \brief  2588, Message Object  Interrupt Pointer Register */
#define CAN_MO172_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A588u)

/** Alias (User Manual Name) for CAN_MO172_IPR.
* To use register names with standard convension, please use CAN_MO172_IPR.
*/
#define	CAN_MOIPR172	(CAN_MO172_IPR)

/** \brief  259C, Message Object  Control Register */
#define CAN_MO172_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A59Cu)

/** Alias (User Manual Name) for CAN_MO172_STAT.
* To use register names with standard convension, please use CAN_MO172_STAT.
*/
#define	CAN_MOSTAT172	(CAN_MO172_STAT)

/** \brief  25AC, Message Object  Acceptance Mask Register */
#define CAN_MO173_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A5ACu)

/** Alias (User Manual Name) for CAN_MO173_AMR.
* To use register names with standard convension, please use CAN_MO173_AMR.
*/
#define	CAN_MOAMR173	(CAN_MO173_AMR)

/** \brief  25B8, Message Object  Arbitration Register */
#define CAN_MO173_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A5B8u)

/** Alias (User Manual Name) for CAN_MO173_AR.
* To use register names with standard convension, please use CAN_MO173_AR.
*/
#define	CAN_MOAR173	(CAN_MO173_AR)

/** \brief  25BC, Message Object  Control Register */
#define CAN_MO173_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A5BCu)

/** Alias (User Manual Name) for CAN_MO173_CTR.
* To use register names with standard convension, please use CAN_MO173_CTR.
*/
#define	CAN_MOCTR173	(CAN_MO173_CTR)

/** \brief  25B4, Message Object  Data Register High */
#define CAN_MO173_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A5B4u)

/** Alias (User Manual Name) for CAN_MO173_DATAH.
* To use register names with standard convension, please use CAN_MO173_DATAH.
*/
#define	CAN_MODATAH173	(CAN_MO173_DATAH)

/** \brief  25B0, Message Object  Data Register Low */
#define CAN_MO173_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A5B0u)

/** Alias (User Manual Name) for CAN_MO173_DATAL.
* To use register names with standard convension, please use CAN_MO173_DATAL.
*/
#define	CAN_MODATAL173	(CAN_MO173_DATAL)

/** \brief  25A0, Message Object  Function Control Register */
#define CAN_MO173_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A5A0u)

/** Alias (User Manual Name) for CAN_MO173_EDATA0.
* To use register names with standard convension, please use CAN_MO173_EDATA0.
*/
#define	CAN_EMO173DATA0	(CAN_MO173_EDATA0)

/** \brief  25A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO173_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A5A4u)

/** Alias (User Manual Name) for CAN_MO173_EDATA1.
* To use register names with standard convension, please use CAN_MO173_EDATA1.
*/
#define	CAN_EMO173DATA1	(CAN_MO173_EDATA1)

/** \brief  25A8, Message Object  Interrupt Pointer Register */
#define CAN_MO173_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A5A8u)

/** Alias (User Manual Name) for CAN_MO173_EDATA2.
* To use register names with standard convension, please use CAN_MO173_EDATA2.
*/
#define	CAN_EMO173DATA2	(CAN_MO173_EDATA2)

/** \brief  25AC, Message Object  Acceptance Mask Register */
#define CAN_MO173_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A5ACu)

/** Alias (User Manual Name) for CAN_MO173_EDATA3.
* To use register names with standard convension, please use CAN_MO173_EDATA3.
*/
#define	CAN_EMO173DATA3	(CAN_MO173_EDATA3)

/** \brief  25B0, Message Object  Data Register Low */
#define CAN_MO173_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A5B0u)

/** Alias (User Manual Name) for CAN_MO173_EDATA4.
* To use register names with standard convension, please use CAN_MO173_EDATA4.
*/
#define	CAN_EMO173DATA4	(CAN_MO173_EDATA4)

/** \brief  25B4, Message Object  Data Register High */
#define CAN_MO173_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A5B4u)

/** Alias (User Manual Name) for CAN_MO173_EDATA5.
* To use register names with standard convension, please use CAN_MO173_EDATA5.
*/
#define	CAN_EMO173DATA5	(CAN_MO173_EDATA5)

