luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  25B8, Message Object  Arbitration Register */
#define CAN_MO173_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A5B8u)

/** Alias (User Manual Name) for CAN_MO173_EDATA6.
* To use register names with standard convension, please use CAN_MO173_EDATA6.
*/
#define	CAN_EMO173DATA6	(CAN_MO173_EDATA6)

/** \brief  25A0, Message Object  Function Control Register */
#define CAN_MO173_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A5A0u)

/** Alias (User Manual Name) for CAN_MO173_FCR.
* To use register names with standard convension, please use CAN_MO173_FCR.
*/
#define	CAN_MOFCR173	(CAN_MO173_FCR)

/** \brief  25A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO173_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A5A4u)

/** Alias (User Manual Name) for CAN_MO173_FGPR.
* To use register names with standard convension, please use CAN_MO173_FGPR.
*/
#define	CAN_MOFGPR173	(CAN_MO173_FGPR)

/** \brief  25A8, Message Object  Interrupt Pointer Register */
#define CAN_MO173_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A5A8u)

/** Alias (User Manual Name) for CAN_MO173_IPR.
* To use register names with standard convension, please use CAN_MO173_IPR.
*/
#define	CAN_MOIPR173	(CAN_MO173_IPR)

/** \brief  25BC, Message Object  Control Register */
#define CAN_MO173_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A5BCu)

/** Alias (User Manual Name) for CAN_MO173_STAT.
* To use register names with standard convension, please use CAN_MO173_STAT.
*/
#define	CAN_MOSTAT173	(CAN_MO173_STAT)

/** \brief  25CC, Message Object  Acceptance Mask Register */
#define CAN_MO174_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A5CCu)

/** Alias (User Manual Name) for CAN_MO174_AMR.
* To use register names with standard convension, please use CAN_MO174_AMR.
*/
#define	CAN_MOAMR174	(CAN_MO174_AMR)

/** \brief  25D8, Message Object  Arbitration Register */
#define CAN_MO174_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A5D8u)

/** Alias (User Manual Name) for CAN_MO174_AR.
* To use register names with standard convension, please use CAN_MO174_AR.
*/
#define	CAN_MOAR174	(CAN_MO174_AR)

/** \brief  25DC, Message Object  Control Register */
#define CAN_MO174_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A5DCu)

/** Alias (User Manual Name) for CAN_MO174_CTR.
* To use register names with standard convension, please use CAN_MO174_CTR.
*/
#define	CAN_MOCTR174	(CAN_MO174_CTR)

/** \brief  25D4, Message Object  Data Register High */
#define CAN_MO174_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A5D4u)

/** Alias (User Manual Name) for CAN_MO174_DATAH.
* To use register names with standard convension, please use CAN_MO174_DATAH.
*/
#define	CAN_MODATAH174	(CAN_MO174_DATAH)

/** \brief  25D0, Message Object  Data Register Low */
#define CAN_MO174_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A5D0u)

/** Alias (User Manual Name) for CAN_MO174_DATAL.
* To use register names with standard convension, please use CAN_MO174_DATAL.
*/
#define	CAN_MODATAL174	(CAN_MO174_DATAL)

/** \brief  25C0, Message Object  Function Control Register */
#define CAN_MO174_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A5C0u)

/** Alias (User Manual Name) for CAN_MO174_EDATA0.
* To use register names with standard convension, please use CAN_MO174_EDATA0.
*/
#define	CAN_EMO174DATA0	(CAN_MO174_EDATA0)

/** \brief  25C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO174_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A5C4u)

/** Alias (User Manual Name) for CAN_MO174_EDATA1.
* To use register names with standard convension, please use CAN_MO174_EDATA1.
*/
#define	CAN_EMO174DATA1	(CAN_MO174_EDATA1)

/** \brief  25C8, Message Object  Interrupt Pointer Register */
#define CAN_MO174_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A5C8u)

/** Alias (User Manual Name) for CAN_MO174_EDATA2.
* To use register names with standard convension, please use CAN_MO174_EDATA2.
*/
#define	CAN_EMO174DATA2	(CAN_MO174_EDATA2)

/** \brief  25CC, Message Object  Acceptance Mask Register */
#define CAN_MO174_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A5CCu)

/** Alias (User Manual Name) for CAN_MO174_EDATA3.
* To use register names with standard convension, please use CAN_MO174_EDATA3.
*/
#define	CAN_EMO174DATA3	(CAN_MO174_EDATA3)

/** \brief  25D0, Message Object  Data Register Low */
#define CAN_MO174_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A5D0u)

/** Alias (User Manual Name) for CAN_MO174_EDATA4.
* To use register names with standard convension, please use CAN_MO174_EDATA4.
*/
#define	CAN_EMO174DATA4	(CAN_MO174_EDATA4)

/** \brief  25D4, Message Object  Data Register High */
#define CAN_MO174_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A5D4u)

/** Alias (User Manual Name) for CAN_MO174_EDATA5.
* To use register names with standard convension, please use CAN_MO174_EDATA5.
*/
#define	CAN_EMO174DATA5	(CAN_MO174_EDATA5)

/** \brief  25D8, Message Object  Arbitration Register */
#define CAN_MO174_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A5D8u)

/** Alias (User Manual Name) for CAN_MO174_EDATA6.
* To use register names with standard convension, please use CAN_MO174_EDATA6.
*/
#define	CAN_EMO174DATA6	(CAN_MO174_EDATA6)

/** \brief  25C0, Message Object  Function Control Register */
#define CAN_MO174_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A5C0u)

/** Alias (User Manual Name) for CAN_MO174_FCR.
* To use register names with standard convension, please use CAN_MO174_FCR.
*/
#define	CAN_MOFCR174	(CAN_MO174_FCR)

/** \brief  25C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO174_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A5C4u)

/** Alias (User Manual Name) for CAN_MO174_FGPR.
* To use register names with standard convension, please use CAN_MO174_FGPR.
*/
#define	CAN_MOFGPR174	(CAN_MO174_FGPR)

/** \brief  25C8, Message Object  Interrupt Pointer Register */
#define CAN_MO174_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A5C8u)

/** Alias (User Manual Name) for CAN_MO174_IPR.
* To use register names with standard convension, please use CAN_MO174_IPR.
*/
#define	CAN_MOIPR174	(CAN_MO174_IPR)

/** \brief  25DC, Message Object  Control Register */
#define CAN_MO174_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A5DCu)

