luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO174_STAT.
* To use register names with standard convension, please use CAN_MO174_STAT.
*/
#define	CAN_MOSTAT174	(CAN_MO174_STAT)

/** \brief  25EC, Message Object  Acceptance Mask Register */
#define CAN_MO175_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A5ECu)

/** Alias (User Manual Name) for CAN_MO175_AMR.
* To use register names with standard convension, please use CAN_MO175_AMR.
*/
#define	CAN_MOAMR175	(CAN_MO175_AMR)

/** \brief  25F8, Message Object  Arbitration Register */
#define CAN_MO175_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A5F8u)

/** Alias (User Manual Name) for CAN_MO175_AR.
* To use register names with standard convension, please use CAN_MO175_AR.
*/
#define	CAN_MOAR175	(CAN_MO175_AR)

/** \brief  25FC, Message Object  Control Register */
#define CAN_MO175_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A5FCu)

/** Alias (User Manual Name) for CAN_MO175_CTR.
* To use register names with standard convension, please use CAN_MO175_CTR.
*/
#define	CAN_MOCTR175	(CAN_MO175_CTR)

/** \brief  25F4, Message Object  Data Register High */
#define CAN_MO175_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A5F4u)

/** Alias (User Manual Name) for CAN_MO175_DATAH.
* To use register names with standard convension, please use CAN_MO175_DATAH.
*/
#define	CAN_MODATAH175	(CAN_MO175_DATAH)

/** \brief  25F0, Message Object  Data Register Low */
#define CAN_MO175_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A5F0u)

/** Alias (User Manual Name) for CAN_MO175_DATAL.
* To use register names with standard convension, please use CAN_MO175_DATAL.
*/
#define	CAN_MODATAL175	(CAN_MO175_DATAL)

/** \brief  25E0, Message Object  Function Control Register */
#define CAN_MO175_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A5E0u)

/** Alias (User Manual Name) for CAN_MO175_EDATA0.
* To use register names with standard convension, please use CAN_MO175_EDATA0.
*/
#define	CAN_EMO175DATA0	(CAN_MO175_EDATA0)

/** \brief  25E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO175_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A5E4u)

/** Alias (User Manual Name) for CAN_MO175_EDATA1.
* To use register names with standard convension, please use CAN_MO175_EDATA1.
*/
#define	CAN_EMO175DATA1	(CAN_MO175_EDATA1)

/** \brief  25E8, Message Object  Interrupt Pointer Register */
#define CAN_MO175_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A5E8u)

/** Alias (User Manual Name) for CAN_MO175_EDATA2.
* To use register names with standard convension, please use CAN_MO175_EDATA2.
*/
#define	CAN_EMO175DATA2	(CAN_MO175_EDATA2)

/** \brief  25EC, Message Object  Acceptance Mask Register */
#define CAN_MO175_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A5ECu)

/** Alias (User Manual Name) for CAN_MO175_EDATA3.
* To use register names with standard convension, please use CAN_MO175_EDATA3.
*/
#define	CAN_EMO175DATA3	(CAN_MO175_EDATA3)

/** \brief  25F0, Message Object  Data Register Low */
#define CAN_MO175_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A5F0u)

/** Alias (User Manual Name) for CAN_MO175_EDATA4.
* To use register names with standard convension, please use CAN_MO175_EDATA4.
*/
#define	CAN_EMO175DATA4	(CAN_MO175_EDATA4)

/** \brief  25F4, Message Object  Data Register High */
#define CAN_MO175_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A5F4u)

/** Alias (User Manual Name) for CAN_MO175_EDATA5.
* To use register names with standard convension, please use CAN_MO175_EDATA5.
*/
#define	CAN_EMO175DATA5	(CAN_MO175_EDATA5)

/** \brief  25F8, Message Object  Arbitration Register */
#define CAN_MO175_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A5F8u)

/** Alias (User Manual Name) for CAN_MO175_EDATA6.
* To use register names with standard convension, please use CAN_MO175_EDATA6.
*/
#define	CAN_EMO175DATA6	(CAN_MO175_EDATA6)

/** \brief  25E0, Message Object  Function Control Register */
#define CAN_MO175_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A5E0u)

/** Alias (User Manual Name) for CAN_MO175_FCR.
* To use register names with standard convension, please use CAN_MO175_FCR.
*/
#define	CAN_MOFCR175	(CAN_MO175_FCR)

/** \brief  25E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO175_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A5E4u)

/** Alias (User Manual Name) for CAN_MO175_FGPR.
* To use register names with standard convension, please use CAN_MO175_FGPR.
*/
#define	CAN_MOFGPR175	(CAN_MO175_FGPR)

/** \brief  25E8, Message Object  Interrupt Pointer Register */
#define CAN_MO175_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A5E8u)

/** Alias (User Manual Name) for CAN_MO175_IPR.
* To use register names with standard convension, please use CAN_MO175_IPR.
*/
#define	CAN_MOIPR175	(CAN_MO175_IPR)

/** \brief  25FC, Message Object  Control Register */
#define CAN_MO175_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A5FCu)

/** Alias (User Manual Name) for CAN_MO175_STAT.
* To use register names with standard convension, please use CAN_MO175_STAT.
*/
#define	CAN_MOSTAT175	(CAN_MO175_STAT)

/** \brief  260C, Message Object  Acceptance Mask Register */
#define CAN_MO176_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A60Cu)

/** Alias (User Manual Name) for CAN_MO176_AMR.
* To use register names with standard convension, please use CAN_MO176_AMR.
*/
#define	CAN_MOAMR176	(CAN_MO176_AMR)

/** \brief  2618, Message Object  Arbitration Register */
#define CAN_MO176_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A618u)

/** Alias (User Manual Name) for CAN_MO176_AR.
* To use register names with standard convension, please use CAN_MO176_AR.
*/
#define	CAN_MOAR176	(CAN_MO176_AR)

/** \brief  261C, Message Object  Control Register */
#define CAN_MO176_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A61Cu)

/** Alias (User Manual Name) for CAN_MO176_CTR.
* To use register names with standard convension, please use CAN_MO176_CTR.
*/
#define	CAN_MOCTR176	(CAN_MO176_CTR)

/** \brief  2614, Message Object  Data Register High */
#define CAN_MO176_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A614u)

/** Alias (User Manual Name) for CAN_MO176_DATAH.
* To use register names with standard convension, please use CAN_MO176_DATAH.
*/
#define	CAN_MODATAH176	(CAN_MO176_DATAH)

/** \brief  2610, Message Object  Data Register Low */
#define CAN_MO176_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A610u)

/** Alias (User Manual Name) for CAN_MO176_DATAL.
* To use register names with standard convension, please use CAN_MO176_DATAL.
*/
#define	CAN_MODATAL176	(CAN_MO176_DATAL)

/** \brief  2600, Message Object  Function Control Register */
#define CAN_MO176_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A600u)

/** Alias (User Manual Name) for CAN_MO176_EDATA0.
* To use register names with standard convension, please use CAN_MO176_EDATA0.
*/
#define	CAN_EMO176DATA0	(CAN_MO176_EDATA0)

