luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2604, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO176_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A604u)

/** Alias (User Manual Name) for CAN_MO176_EDATA1.
* To use register names with standard convension, please use CAN_MO176_EDATA1.
*/
#define	CAN_EMO176DATA1	(CAN_MO176_EDATA1)

/** \brief  2608, Message Object  Interrupt Pointer Register */
#define CAN_MO176_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A608u)

/** Alias (User Manual Name) for CAN_MO176_EDATA2.
* To use register names with standard convension, please use CAN_MO176_EDATA2.
*/
#define	CAN_EMO176DATA2	(CAN_MO176_EDATA2)

/** \brief  260C, Message Object  Acceptance Mask Register */
#define CAN_MO176_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A60Cu)

/** Alias (User Manual Name) for CAN_MO176_EDATA3.
* To use register names with standard convension, please use CAN_MO176_EDATA3.
*/
#define	CAN_EMO176DATA3	(CAN_MO176_EDATA3)

/** \brief  2610, Message Object  Data Register Low */
#define CAN_MO176_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A610u)

/** Alias (User Manual Name) for CAN_MO176_EDATA4.
* To use register names with standard convension, please use CAN_MO176_EDATA4.
*/
#define	CAN_EMO176DATA4	(CAN_MO176_EDATA4)

/** \brief  2614, Message Object  Data Register High */
#define CAN_MO176_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A614u)

/** Alias (User Manual Name) for CAN_MO176_EDATA5.
* To use register names with standard convension, please use CAN_MO176_EDATA5.
*/
#define	CAN_EMO176DATA5	(CAN_MO176_EDATA5)

/** \brief  2618, Message Object  Arbitration Register */
#define CAN_MO176_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A618u)

/** Alias (User Manual Name) for CAN_MO176_EDATA6.
* To use register names with standard convension, please use CAN_MO176_EDATA6.
*/
#define	CAN_EMO176DATA6	(CAN_MO176_EDATA6)

/** \brief  2600, Message Object  Function Control Register */
#define CAN_MO176_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A600u)

/** Alias (User Manual Name) for CAN_MO176_FCR.
* To use register names with standard convension, please use CAN_MO176_FCR.
*/
#define	CAN_MOFCR176	(CAN_MO176_FCR)

/** \brief  2604, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO176_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A604u)

/** Alias (User Manual Name) for CAN_MO176_FGPR.
* To use register names with standard convension, please use CAN_MO176_FGPR.
*/
#define	CAN_MOFGPR176	(CAN_MO176_FGPR)

/** \brief  2608, Message Object  Interrupt Pointer Register */
#define CAN_MO176_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A608u)

/** Alias (User Manual Name) for CAN_MO176_IPR.
* To use register names with standard convension, please use CAN_MO176_IPR.
*/
#define	CAN_MOIPR176	(CAN_MO176_IPR)

/** \brief  261C, Message Object  Control Register */
#define CAN_MO176_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A61Cu)

/** Alias (User Manual Name) for CAN_MO176_STAT.
* To use register names with standard convension, please use CAN_MO176_STAT.
*/
#define	CAN_MOSTAT176	(CAN_MO176_STAT)

/** \brief  262C, Message Object  Acceptance Mask Register */
#define CAN_MO177_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A62Cu)

/** Alias (User Manual Name) for CAN_MO177_AMR.
* To use register names with standard convension, please use CAN_MO177_AMR.
*/
#define	CAN_MOAMR177	(CAN_MO177_AMR)

/** \brief  2638, Message Object  Arbitration Register */
#define CAN_MO177_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A638u)

/** Alias (User Manual Name) for CAN_MO177_AR.
* To use register names with standard convension, please use CAN_MO177_AR.
*/
#define	CAN_MOAR177	(CAN_MO177_AR)

/** \brief  263C, Message Object  Control Register */
#define CAN_MO177_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A63Cu)

/** Alias (User Manual Name) for CAN_MO177_CTR.
* To use register names with standard convension, please use CAN_MO177_CTR.
*/
#define	CAN_MOCTR177	(CAN_MO177_CTR)

/** \brief  2634, Message Object  Data Register High */
#define CAN_MO177_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A634u)

/** Alias (User Manual Name) for CAN_MO177_DATAH.
* To use register names with standard convension, please use CAN_MO177_DATAH.
*/
#define	CAN_MODATAH177	(CAN_MO177_DATAH)

/** \brief  2630, Message Object  Data Register Low */
#define CAN_MO177_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A630u)

/** Alias (User Manual Name) for CAN_MO177_DATAL.
* To use register names with standard convension, please use CAN_MO177_DATAL.
*/
#define	CAN_MODATAL177	(CAN_MO177_DATAL)

/** \brief  2620, Message Object  Function Control Register */
#define CAN_MO177_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A620u)

/** Alias (User Manual Name) for CAN_MO177_EDATA0.
* To use register names with standard convension, please use CAN_MO177_EDATA0.
*/
#define	CAN_EMO177DATA0	(CAN_MO177_EDATA0)

/** \brief  2624, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO177_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A624u)

/** Alias (User Manual Name) for CAN_MO177_EDATA1.
* To use register names with standard convension, please use CAN_MO177_EDATA1.
*/
#define	CAN_EMO177DATA1	(CAN_MO177_EDATA1)

/** \brief  2628, Message Object  Interrupt Pointer Register */
#define CAN_MO177_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A628u)

/** Alias (User Manual Name) for CAN_MO177_EDATA2.
* To use register names with standard convension, please use CAN_MO177_EDATA2.
*/
#define	CAN_EMO177DATA2	(CAN_MO177_EDATA2)

/** \brief  262C, Message Object  Acceptance Mask Register */
#define CAN_MO177_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A62Cu)

/** Alias (User Manual Name) for CAN_MO177_EDATA3.
* To use register names with standard convension, please use CAN_MO177_EDATA3.
*/
#define	CAN_EMO177DATA3	(CAN_MO177_EDATA3)

/** \brief  2630, Message Object  Data Register Low */
#define CAN_MO177_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A630u)

/** Alias (User Manual Name) for CAN_MO177_EDATA4.
* To use register names with standard convension, please use CAN_MO177_EDATA4.
*/
#define	CAN_EMO177DATA4	(CAN_MO177_EDATA4)

/** \brief  2634, Message Object  Data Register High */
#define CAN_MO177_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A634u)

/** Alias (User Manual Name) for CAN_MO177_EDATA5.
* To use register names with standard convension, please use CAN_MO177_EDATA5.
*/
#define	CAN_EMO177DATA5	(CAN_MO177_EDATA5)

/** \brief  2638, Message Object  Arbitration Register */
#define CAN_MO177_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A638u)

