luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO177_EDATA6.
* To use register names with standard convension, please use CAN_MO177_EDATA6.
*/
#define	CAN_EMO177DATA6	(CAN_MO177_EDATA6)

/** \brief  2620, Message Object  Function Control Register */
#define CAN_MO177_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A620u)

/** Alias (User Manual Name) for CAN_MO177_FCR.
* To use register names with standard convension, please use CAN_MO177_FCR.
*/
#define	CAN_MOFCR177	(CAN_MO177_FCR)

/** \brief  2624, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO177_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A624u)

/** Alias (User Manual Name) for CAN_MO177_FGPR.
* To use register names with standard convension, please use CAN_MO177_FGPR.
*/
#define	CAN_MOFGPR177	(CAN_MO177_FGPR)

/** \brief  2628, Message Object  Interrupt Pointer Register */
#define CAN_MO177_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A628u)

/** Alias (User Manual Name) for CAN_MO177_IPR.
* To use register names with standard convension, please use CAN_MO177_IPR.
*/
#define	CAN_MOIPR177	(CAN_MO177_IPR)

/** \brief  263C, Message Object  Control Register */
#define CAN_MO177_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A63Cu)

/** Alias (User Manual Name) for CAN_MO177_STAT.
* To use register names with standard convension, please use CAN_MO177_STAT.
*/
#define	CAN_MOSTAT177	(CAN_MO177_STAT)

/** \brief  264C, Message Object  Acceptance Mask Register */
#define CAN_MO178_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A64Cu)

/** Alias (User Manual Name) for CAN_MO178_AMR.
* To use register names with standard convension, please use CAN_MO178_AMR.
*/
#define	CAN_MOAMR178	(CAN_MO178_AMR)

/** \brief  2658, Message Object  Arbitration Register */
#define CAN_MO178_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A658u)

/** Alias (User Manual Name) for CAN_MO178_AR.
* To use register names with standard convension, please use CAN_MO178_AR.
*/
#define	CAN_MOAR178	(CAN_MO178_AR)

/** \brief  265C, Message Object  Control Register */
#define CAN_MO178_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A65Cu)

/** Alias (User Manual Name) for CAN_MO178_CTR.
* To use register names with standard convension, please use CAN_MO178_CTR.
*/
#define	CAN_MOCTR178	(CAN_MO178_CTR)

/** \brief  2654, Message Object  Data Register High */
#define CAN_MO178_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A654u)

/** Alias (User Manual Name) for CAN_MO178_DATAH.
* To use register names with standard convension, please use CAN_MO178_DATAH.
*/
#define	CAN_MODATAH178	(CAN_MO178_DATAH)

/** \brief  2650, Message Object  Data Register Low */
#define CAN_MO178_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A650u)

/** Alias (User Manual Name) for CAN_MO178_DATAL.
* To use register names with standard convension, please use CAN_MO178_DATAL.
*/
#define	CAN_MODATAL178	(CAN_MO178_DATAL)

/** \brief  2640, Message Object  Function Control Register */
#define CAN_MO178_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A640u)

/** Alias (User Manual Name) for CAN_MO178_EDATA0.
* To use register names with standard convension, please use CAN_MO178_EDATA0.
*/
#define	CAN_EMO178DATA0	(CAN_MO178_EDATA0)

/** \brief  2644, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO178_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A644u)

/** Alias (User Manual Name) for CAN_MO178_EDATA1.
* To use register names with standard convension, please use CAN_MO178_EDATA1.
*/
#define	CAN_EMO178DATA1	(CAN_MO178_EDATA1)

/** \brief  2648, Message Object  Interrupt Pointer Register */
#define CAN_MO178_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A648u)

/** Alias (User Manual Name) for CAN_MO178_EDATA2.
* To use register names with standard convension, please use CAN_MO178_EDATA2.
*/
#define	CAN_EMO178DATA2	(CAN_MO178_EDATA2)

/** \brief  264C, Message Object  Acceptance Mask Register */
#define CAN_MO178_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A64Cu)

/** Alias (User Manual Name) for CAN_MO178_EDATA3.
* To use register names with standard convension, please use CAN_MO178_EDATA3.
*/
#define	CAN_EMO178DATA3	(CAN_MO178_EDATA3)

/** \brief  2650, Message Object  Data Register Low */
#define CAN_MO178_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A650u)

/** Alias (User Manual Name) for CAN_MO178_EDATA4.
* To use register names with standard convension, please use CAN_MO178_EDATA4.
*/
#define	CAN_EMO178DATA4	(CAN_MO178_EDATA4)

/** \brief  2654, Message Object  Data Register High */
#define CAN_MO178_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A654u)

/** Alias (User Manual Name) for CAN_MO178_EDATA5.
* To use register names with standard convension, please use CAN_MO178_EDATA5.
*/
#define	CAN_EMO178DATA5	(CAN_MO178_EDATA5)

/** \brief  2658, Message Object  Arbitration Register */
#define CAN_MO178_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A658u)

/** Alias (User Manual Name) for CAN_MO178_EDATA6.
* To use register names with standard convension, please use CAN_MO178_EDATA6.
*/
#define	CAN_EMO178DATA6	(CAN_MO178_EDATA6)

/** \brief  2640, Message Object  Function Control Register */
#define CAN_MO178_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A640u)

/** Alias (User Manual Name) for CAN_MO178_FCR.
* To use register names with standard convension, please use CAN_MO178_FCR.
*/
#define	CAN_MOFCR178	(CAN_MO178_FCR)

/** \brief  2644, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO178_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A644u)

/** Alias (User Manual Name) for CAN_MO178_FGPR.
* To use register names with standard convension, please use CAN_MO178_FGPR.
*/
#define	CAN_MOFGPR178	(CAN_MO178_FGPR)

/** \brief  2648, Message Object  Interrupt Pointer Register */
#define CAN_MO178_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A648u)

