luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO178_IPR.
* To use register names with standard convension, please use CAN_MO178_IPR.
*/
#define	CAN_MOIPR178	(CAN_MO178_IPR)

/** \brief  265C, Message Object  Control Register */
#define CAN_MO178_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A65Cu)

/** Alias (User Manual Name) for CAN_MO178_STAT.
* To use register names with standard convension, please use CAN_MO178_STAT.
*/
#define	CAN_MOSTAT178	(CAN_MO178_STAT)

/** \brief  266C, Message Object  Acceptance Mask Register */
#define CAN_MO179_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A66Cu)

/** Alias (User Manual Name) for CAN_MO179_AMR.
* To use register names with standard convension, please use CAN_MO179_AMR.
*/
#define	CAN_MOAMR179	(CAN_MO179_AMR)

/** \brief  2678, Message Object  Arbitration Register */
#define CAN_MO179_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A678u)

/** Alias (User Manual Name) for CAN_MO179_AR.
* To use register names with standard convension, please use CAN_MO179_AR.
*/
#define	CAN_MOAR179	(CAN_MO179_AR)

/** \brief  267C, Message Object  Control Register */
#define CAN_MO179_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A67Cu)

/** Alias (User Manual Name) for CAN_MO179_CTR.
* To use register names with standard convension, please use CAN_MO179_CTR.
*/
#define	CAN_MOCTR179	(CAN_MO179_CTR)

/** \brief  2674, Message Object  Data Register High */
#define CAN_MO179_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A674u)

/** Alias (User Manual Name) for CAN_MO179_DATAH.
* To use register names with standard convension, please use CAN_MO179_DATAH.
*/
#define	CAN_MODATAH179	(CAN_MO179_DATAH)

/** \brief  2670, Message Object  Data Register Low */
#define CAN_MO179_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A670u)

/** Alias (User Manual Name) for CAN_MO179_DATAL.
* To use register names with standard convension, please use CAN_MO179_DATAL.
*/
#define	CAN_MODATAL179	(CAN_MO179_DATAL)

/** \brief  2660, Message Object  Function Control Register */
#define CAN_MO179_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A660u)

/** Alias (User Manual Name) for CAN_MO179_EDATA0.
* To use register names with standard convension, please use CAN_MO179_EDATA0.
*/
#define	CAN_EMO179DATA0	(CAN_MO179_EDATA0)

/** \brief  2664, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO179_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A664u)

/** Alias (User Manual Name) for CAN_MO179_EDATA1.
* To use register names with standard convension, please use CAN_MO179_EDATA1.
*/
#define	CAN_EMO179DATA1	(CAN_MO179_EDATA1)

/** \brief  2668, Message Object  Interrupt Pointer Register */
#define CAN_MO179_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A668u)

/** Alias (User Manual Name) for CAN_MO179_EDATA2.
* To use register names with standard convension, please use CAN_MO179_EDATA2.
*/
#define	CAN_EMO179DATA2	(CAN_MO179_EDATA2)

/** \brief  266C, Message Object  Acceptance Mask Register */
#define CAN_MO179_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A66Cu)

/** Alias (User Manual Name) for CAN_MO179_EDATA3.
* To use register names with standard convension, please use CAN_MO179_EDATA3.
*/
#define	CAN_EMO179DATA3	(CAN_MO179_EDATA3)

/** \brief  2670, Message Object  Data Register Low */
#define CAN_MO179_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A670u)

/** Alias (User Manual Name) for CAN_MO179_EDATA4.
* To use register names with standard convension, please use CAN_MO179_EDATA4.
*/
#define	CAN_EMO179DATA4	(CAN_MO179_EDATA4)

/** \brief  2674, Message Object  Data Register High */
#define CAN_MO179_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A674u)

/** Alias (User Manual Name) for CAN_MO179_EDATA5.
* To use register names with standard convension, please use CAN_MO179_EDATA5.
*/
#define	CAN_EMO179DATA5	(CAN_MO179_EDATA5)

/** \brief  2678, Message Object  Arbitration Register */
#define CAN_MO179_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A678u)

/** Alias (User Manual Name) for CAN_MO179_EDATA6.
* To use register names with standard convension, please use CAN_MO179_EDATA6.
*/
#define	CAN_EMO179DATA6	(CAN_MO179_EDATA6)

/** \brief  2660, Message Object  Function Control Register */
#define CAN_MO179_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A660u)

/** Alias (User Manual Name) for CAN_MO179_FCR.
* To use register names with standard convension, please use CAN_MO179_FCR.
*/
#define	CAN_MOFCR179	(CAN_MO179_FCR)

/** \brief  2664, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO179_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A664u)

/** Alias (User Manual Name) for CAN_MO179_FGPR.
* To use register names with standard convension, please use CAN_MO179_FGPR.
*/
#define	CAN_MOFGPR179	(CAN_MO179_FGPR)

/** \brief  2668, Message Object  Interrupt Pointer Register */
#define CAN_MO179_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A668u)

/** Alias (User Manual Name) for CAN_MO179_IPR.
* To use register names with standard convension, please use CAN_MO179_IPR.
*/
#define	CAN_MOIPR179	(CAN_MO179_IPR)

/** \brief  267C, Message Object  Control Register */
#define CAN_MO179_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A67Cu)

/** Alias (User Manual Name) for CAN_MO179_STAT.
* To use register names with standard convension, please use CAN_MO179_STAT.
*/
#define	CAN_MOSTAT179	(CAN_MO179_STAT)

/** \brief  122C, Message Object  Acceptance Mask Register */
#define CAN_MO17_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001922Cu)

/** Alias (User Manual Name) for CAN_MO17_AMR.
* To use register names with standard convension, please use CAN_MO17_AMR.
*/
#define	CAN_MOAMR17	(CAN_MO17_AMR)

/** \brief  1238, Message Object  Arbitration Register */
#define CAN_MO17_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019238u)

/** Alias (User Manual Name) for CAN_MO17_AR.
* To use register names with standard convension, please use CAN_MO17_AR.
*/
#define	CAN_MOAR17	(CAN_MO17_AR)

/** \brief  123C, Message Object  Control Register */
#define CAN_MO17_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001923Cu)

