luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO17_CTR.
* To use register names with standard convension, please use CAN_MO17_CTR.
*/
#define	CAN_MOCTR17	(CAN_MO17_CTR)

/** \brief  1234, Message Object  Data Register High */
#define CAN_MO17_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019234u)

/** Alias (User Manual Name) for CAN_MO17_DATAH.
* To use register names with standard convension, please use CAN_MO17_DATAH.
*/
#define	CAN_MODATAH17	(CAN_MO17_DATAH)

/** \brief  1230, Message Object  Data Register Low */
#define CAN_MO17_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019230u)

/** Alias (User Manual Name) for CAN_MO17_DATAL.
* To use register names with standard convension, please use CAN_MO17_DATAL.
*/
#define	CAN_MODATAL17	(CAN_MO17_DATAL)

/** \brief  1220, Message Object  Function Control Register */
#define CAN_MO17_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019220u)

/** Alias (User Manual Name) for CAN_MO17_EDATA0.
* To use register names with standard convension, please use CAN_MO17_EDATA0.
*/
#define	CAN_EMO17DATA0	(CAN_MO17_EDATA0)

/** \brief  1224, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO17_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019224u)

/** Alias (User Manual Name) for CAN_MO17_EDATA1.
* To use register names with standard convension, please use CAN_MO17_EDATA1.
*/
#define	CAN_EMO17DATA1	(CAN_MO17_EDATA1)

/** \brief  1228, Message Object  Interrupt Pointer Register */
#define CAN_MO17_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019228u)

/** Alias (User Manual Name) for CAN_MO17_EDATA2.
* To use register names with standard convension, please use CAN_MO17_EDATA2.
*/
#define	CAN_EMO17DATA2	(CAN_MO17_EDATA2)

/** \brief  122C, Message Object  Acceptance Mask Register */
#define CAN_MO17_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001922Cu)

/** Alias (User Manual Name) for CAN_MO17_EDATA3.
* To use register names with standard convension, please use CAN_MO17_EDATA3.
*/
#define	CAN_EMO17DATA3	(CAN_MO17_EDATA3)

/** \brief  1230, Message Object  Data Register Low */
#define CAN_MO17_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019230u)

/** Alias (User Manual Name) for CAN_MO17_EDATA4.
* To use register names with standard convension, please use CAN_MO17_EDATA4.
*/
#define	CAN_EMO17DATA4	(CAN_MO17_EDATA4)

/** \brief  1234, Message Object  Data Register High */
#define CAN_MO17_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019234u)

/** Alias (User Manual Name) for CAN_MO17_EDATA5.
* To use register names with standard convension, please use CAN_MO17_EDATA5.
*/
#define	CAN_EMO17DATA5	(CAN_MO17_EDATA5)

/** \brief  1238, Message Object  Arbitration Register */
#define CAN_MO17_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019238u)

/** Alias (User Manual Name) for CAN_MO17_EDATA6.
* To use register names with standard convension, please use CAN_MO17_EDATA6.
*/
#define	CAN_EMO17DATA6	(CAN_MO17_EDATA6)

/** \brief  1220, Message Object  Function Control Register */
#define CAN_MO17_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019220u)

/** Alias (User Manual Name) for CAN_MO17_FCR.
* To use register names with standard convension, please use CAN_MO17_FCR.
*/
#define	CAN_MOFCR17	(CAN_MO17_FCR)

/** \brief  1224, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO17_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019224u)

/** Alias (User Manual Name) for CAN_MO17_FGPR.
* To use register names with standard convension, please use CAN_MO17_FGPR.
*/
#define	CAN_MOFGPR17	(CAN_MO17_FGPR)

/** \brief  1228, Message Object  Interrupt Pointer Register */
#define CAN_MO17_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019228u)

/** Alias (User Manual Name) for CAN_MO17_IPR.
* To use register names with standard convension, please use CAN_MO17_IPR.
*/
#define	CAN_MOIPR17	(CAN_MO17_IPR)

/** \brief  123C, Message Object  Control Register */
#define CAN_MO17_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001923Cu)

/** Alias (User Manual Name) for CAN_MO17_STAT.
* To use register names with standard convension, please use CAN_MO17_STAT.
*/
#define	CAN_MOSTAT17	(CAN_MO17_STAT)

/** \brief  268C, Message Object  Acceptance Mask Register */
#define CAN_MO180_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A68Cu)

/** Alias (User Manual Name) for CAN_MO180_AMR.
* To use register names with standard convension, please use CAN_MO180_AMR.
*/
#define	CAN_MOAMR180	(CAN_MO180_AMR)

/** \brief  2698, Message Object  Arbitration Register */
#define CAN_MO180_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A698u)

/** Alias (User Manual Name) for CAN_MO180_AR.
* To use register names with standard convension, please use CAN_MO180_AR.
*/
#define	CAN_MOAR180	(CAN_MO180_AR)

/** \brief  269C, Message Object  Control Register */
#define CAN_MO180_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A69Cu)

/** Alias (User Manual Name) for CAN_MO180_CTR.
* To use register names with standard convension, please use CAN_MO180_CTR.
*/
#define	CAN_MOCTR180	(CAN_MO180_CTR)

/** \brief  2694, Message Object  Data Register High */
#define CAN_MO180_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A694u)

/** Alias (User Manual Name) for CAN_MO180_DATAH.
* To use register names with standard convension, please use CAN_MO180_DATAH.
*/
#define	CAN_MODATAH180	(CAN_MO180_DATAH)

/** \brief  2690, Message Object  Data Register Low */
#define CAN_MO180_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A690u)

/** Alias (User Manual Name) for CAN_MO180_DATAL.
* To use register names with standard convension, please use CAN_MO180_DATAL.
*/
#define	CAN_MODATAL180	(CAN_MO180_DATAL)

/** \brief  2680, Message Object  Function Control Register */
#define CAN_MO180_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A680u)

/** Alias (User Manual Name) for CAN_MO180_EDATA0.
* To use register names with standard convension, please use CAN_MO180_EDATA0.
*/
#define	CAN_EMO180DATA0	(CAN_MO180_EDATA0)

/** \brief  2684, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO180_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A684u)

/** Alias (User Manual Name) for CAN_MO180_EDATA1.
* To use register names with standard convension, please use CAN_MO180_EDATA1.
*/
#define	CAN_EMO180DATA1	(CAN_MO180_EDATA1)

/** \brief  2688, Message Object  Interrupt Pointer Register */
#define CAN_MO180_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A688u)

