luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO180_EDATA2.
* To use register names with standard convension, please use CAN_MO180_EDATA2.
*/
#define	CAN_EMO180DATA2	(CAN_MO180_EDATA2)

/** \brief  268C, Message Object  Acceptance Mask Register */
#define CAN_MO180_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A68Cu)

/** Alias (User Manual Name) for CAN_MO180_EDATA3.
* To use register names with standard convension, please use CAN_MO180_EDATA3.
*/
#define	CAN_EMO180DATA3	(CAN_MO180_EDATA3)

/** \brief  2690, Message Object  Data Register Low */
#define CAN_MO180_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A690u)

/** Alias (User Manual Name) for CAN_MO180_EDATA4.
* To use register names with standard convension, please use CAN_MO180_EDATA4.
*/
#define	CAN_EMO180DATA4	(CAN_MO180_EDATA4)

/** \brief  2694, Message Object  Data Register High */
#define CAN_MO180_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A694u)

/** Alias (User Manual Name) for CAN_MO180_EDATA5.
* To use register names with standard convension, please use CAN_MO180_EDATA5.
*/
#define	CAN_EMO180DATA5	(CAN_MO180_EDATA5)

/** \brief  2698, Message Object  Arbitration Register */
#define CAN_MO180_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A698u)

/** Alias (User Manual Name) for CAN_MO180_EDATA6.
* To use register names with standard convension, please use CAN_MO180_EDATA6.
*/
#define	CAN_EMO180DATA6	(CAN_MO180_EDATA6)

/** \brief  2680, Message Object  Function Control Register */
#define CAN_MO180_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A680u)

/** Alias (User Manual Name) for CAN_MO180_FCR.
* To use register names with standard convension, please use CAN_MO180_FCR.
*/
#define	CAN_MOFCR180	(CAN_MO180_FCR)

/** \brief  2684, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO180_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A684u)

/** Alias (User Manual Name) for CAN_MO180_FGPR.
* To use register names with standard convension, please use CAN_MO180_FGPR.
*/
#define	CAN_MOFGPR180	(CAN_MO180_FGPR)

/** \brief  2688, Message Object  Interrupt Pointer Register */
#define CAN_MO180_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A688u)

/** Alias (User Manual Name) for CAN_MO180_IPR.
* To use register names with standard convension, please use CAN_MO180_IPR.
*/
#define	CAN_MOIPR180	(CAN_MO180_IPR)

/** \brief  269C, Message Object  Control Register */
#define CAN_MO180_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A69Cu)

/** Alias (User Manual Name) for CAN_MO180_STAT.
* To use register names with standard convension, please use CAN_MO180_STAT.
*/
#define	CAN_MOSTAT180	(CAN_MO180_STAT)

/** \brief  26AC, Message Object  Acceptance Mask Register */
#define CAN_MO181_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A6ACu)

/** Alias (User Manual Name) for CAN_MO181_AMR.
* To use register names with standard convension, please use CAN_MO181_AMR.
*/
#define	CAN_MOAMR181	(CAN_MO181_AMR)

/** \brief  26B8, Message Object  Arbitration Register */
#define CAN_MO181_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A6B8u)

/** Alias (User Manual Name) for CAN_MO181_AR.
* To use register names with standard convension, please use CAN_MO181_AR.
*/
#define	CAN_MOAR181	(CAN_MO181_AR)

/** \brief  26BC, Message Object  Control Register */
#define CAN_MO181_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A6BCu)

/** Alias (User Manual Name) for CAN_MO181_CTR.
* To use register names with standard convension, please use CAN_MO181_CTR.
*/
#define	CAN_MOCTR181	(CAN_MO181_CTR)

/** \brief  26B4, Message Object  Data Register High */
#define CAN_MO181_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A6B4u)

/** Alias (User Manual Name) for CAN_MO181_DATAH.
* To use register names with standard convension, please use CAN_MO181_DATAH.
*/
#define	CAN_MODATAH181	(CAN_MO181_DATAH)

/** \brief  26B0, Message Object  Data Register Low */
#define CAN_MO181_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A6B0u)

/** Alias (User Manual Name) for CAN_MO181_DATAL.
* To use register names with standard convension, please use CAN_MO181_DATAL.
*/
#define	CAN_MODATAL181	(CAN_MO181_DATAL)

/** \brief  26A0, Message Object  Function Control Register */
#define CAN_MO181_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A6A0u)

/** Alias (User Manual Name) for CAN_MO181_EDATA0.
* To use register names with standard convension, please use CAN_MO181_EDATA0.
*/
#define	CAN_EMO181DATA0	(CAN_MO181_EDATA0)

/** \brief  26A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO181_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A6A4u)

/** Alias (User Manual Name) for CAN_MO181_EDATA1.
* To use register names with standard convension, please use CAN_MO181_EDATA1.
*/
#define	CAN_EMO181DATA1	(CAN_MO181_EDATA1)

/** \brief  26A8, Message Object  Interrupt Pointer Register */
#define CAN_MO181_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A6A8u)

/** Alias (User Manual Name) for CAN_MO181_EDATA2.
* To use register names with standard convension, please use CAN_MO181_EDATA2.
*/
#define	CAN_EMO181DATA2	(CAN_MO181_EDATA2)

/** \brief  26AC, Message Object  Acceptance Mask Register */
#define CAN_MO181_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A6ACu)

/** Alias (User Manual Name) for CAN_MO181_EDATA3.
* To use register names with standard convension, please use CAN_MO181_EDATA3.
*/
#define	CAN_EMO181DATA3	(CAN_MO181_EDATA3)

/** \brief  26B0, Message Object  Data Register Low */
#define CAN_MO181_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A6B0u)

/** Alias (User Manual Name) for CAN_MO181_EDATA4.
* To use register names with standard convension, please use CAN_MO181_EDATA4.
*/
#define	CAN_EMO181DATA4	(CAN_MO181_EDATA4)

/** \brief  26B4, Message Object  Data Register High */
#define CAN_MO181_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A6B4u)

