luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO181_EDATA5.
* To use register names with standard convension, please use CAN_MO181_EDATA5.
*/
#define	CAN_EMO181DATA5	(CAN_MO181_EDATA5)

/** \brief  26B8, Message Object  Arbitration Register */
#define CAN_MO181_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A6B8u)

/** Alias (User Manual Name) for CAN_MO181_EDATA6.
* To use register names with standard convension, please use CAN_MO181_EDATA6.
*/
#define	CAN_EMO181DATA6	(CAN_MO181_EDATA6)

/** \brief  26A0, Message Object  Function Control Register */
#define CAN_MO181_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A6A0u)

/** Alias (User Manual Name) for CAN_MO181_FCR.
* To use register names with standard convension, please use CAN_MO181_FCR.
*/
#define	CAN_MOFCR181	(CAN_MO181_FCR)

/** \brief  26A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO181_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A6A4u)

/** Alias (User Manual Name) for CAN_MO181_FGPR.
* To use register names with standard convension, please use CAN_MO181_FGPR.
*/
#define	CAN_MOFGPR181	(CAN_MO181_FGPR)

/** \brief  26A8, Message Object  Interrupt Pointer Register */
#define CAN_MO181_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A6A8u)

/** Alias (User Manual Name) for CAN_MO181_IPR.
* To use register names with standard convension, please use CAN_MO181_IPR.
*/
#define	CAN_MOIPR181	(CAN_MO181_IPR)

/** \brief  26BC, Message Object  Control Register */
#define CAN_MO181_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A6BCu)

/** Alias (User Manual Name) for CAN_MO181_STAT.
* To use register names with standard convension, please use CAN_MO181_STAT.
*/
#define	CAN_MOSTAT181	(CAN_MO181_STAT)

/** \brief  26CC, Message Object  Acceptance Mask Register */
#define CAN_MO182_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A6CCu)

/** Alias (User Manual Name) for CAN_MO182_AMR.
* To use register names with standard convension, please use CAN_MO182_AMR.
*/
#define	CAN_MOAMR182	(CAN_MO182_AMR)

/** \brief  26D8, Message Object  Arbitration Register */
#define CAN_MO182_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A6D8u)

/** Alias (User Manual Name) for CAN_MO182_AR.
* To use register names with standard convension, please use CAN_MO182_AR.
*/
#define	CAN_MOAR182	(CAN_MO182_AR)

/** \brief  26DC, Message Object  Control Register */
#define CAN_MO182_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A6DCu)

/** Alias (User Manual Name) for CAN_MO182_CTR.
* To use register names with standard convension, please use CAN_MO182_CTR.
*/
#define	CAN_MOCTR182	(CAN_MO182_CTR)

/** \brief  26D4, Message Object  Data Register High */
#define CAN_MO182_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A6D4u)

/** Alias (User Manual Name) for CAN_MO182_DATAH.
* To use register names with standard convension, please use CAN_MO182_DATAH.
*/
#define	CAN_MODATAH182	(CAN_MO182_DATAH)

/** \brief  26D0, Message Object  Data Register Low */
#define CAN_MO182_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A6D0u)

/** Alias (User Manual Name) for CAN_MO182_DATAL.
* To use register names with standard convension, please use CAN_MO182_DATAL.
*/
#define	CAN_MODATAL182	(CAN_MO182_DATAL)

/** \brief  26C0, Message Object  Function Control Register */
#define CAN_MO182_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A6C0u)

/** Alias (User Manual Name) for CAN_MO182_EDATA0.
* To use register names with standard convension, please use CAN_MO182_EDATA0.
*/
#define	CAN_EMO182DATA0	(CAN_MO182_EDATA0)

/** \brief  26C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO182_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A6C4u)

/** Alias (User Manual Name) for CAN_MO182_EDATA1.
* To use register names with standard convension, please use CAN_MO182_EDATA1.
*/
#define	CAN_EMO182DATA1	(CAN_MO182_EDATA1)

/** \brief  26C8, Message Object  Interrupt Pointer Register */
#define CAN_MO182_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A6C8u)

/** Alias (User Manual Name) for CAN_MO182_EDATA2.
* To use register names with standard convension, please use CAN_MO182_EDATA2.
*/
#define	CAN_EMO182DATA2	(CAN_MO182_EDATA2)

/** \brief  26CC, Message Object  Acceptance Mask Register */
#define CAN_MO182_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A6CCu)

/** Alias (User Manual Name) for CAN_MO182_EDATA3.
* To use register names with standard convension, please use CAN_MO182_EDATA3.
*/
#define	CAN_EMO182DATA3	(CAN_MO182_EDATA3)

/** \brief  26D0, Message Object  Data Register Low */
#define CAN_MO182_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A6D0u)

/** Alias (User Manual Name) for CAN_MO182_EDATA4.
* To use register names with standard convension, please use CAN_MO182_EDATA4.
*/
#define	CAN_EMO182DATA4	(CAN_MO182_EDATA4)

/** \brief  26D4, Message Object  Data Register High */
#define CAN_MO182_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A6D4u)

/** Alias (User Manual Name) for CAN_MO182_EDATA5.
* To use register names with standard convension, please use CAN_MO182_EDATA5.
*/
#define	CAN_EMO182DATA5	(CAN_MO182_EDATA5)

/** \brief  26D8, Message Object  Arbitration Register */
#define CAN_MO182_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A6D8u)

/** Alias (User Manual Name) for CAN_MO182_EDATA6.
* To use register names with standard convension, please use CAN_MO182_EDATA6.
*/
#define	CAN_EMO182DATA6	(CAN_MO182_EDATA6)

/** \brief  26C0, Message Object  Function Control Register */
#define CAN_MO182_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A6C0u)

/** Alias (User Manual Name) for CAN_MO182_FCR.
* To use register names with standard convension, please use CAN_MO182_FCR.
*/
#define	CAN_MOFCR182	(CAN_MO182_FCR)

/** \brief  26C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO182_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A6C4u)

