luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO182_FGPR.
* To use register names with standard convension, please use CAN_MO182_FGPR.
*/
#define	CAN_MOFGPR182	(CAN_MO182_FGPR)

/** \brief  26C8, Message Object  Interrupt Pointer Register */
#define CAN_MO182_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A6C8u)

/** Alias (User Manual Name) for CAN_MO182_IPR.
* To use register names with standard convension, please use CAN_MO182_IPR.
*/
#define	CAN_MOIPR182	(CAN_MO182_IPR)

/** \brief  26DC, Message Object  Control Register */
#define CAN_MO182_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A6DCu)

/** Alias (User Manual Name) for CAN_MO182_STAT.
* To use register names with standard convension, please use CAN_MO182_STAT.
*/
#define	CAN_MOSTAT182	(CAN_MO182_STAT)

/** \brief  26EC, Message Object  Acceptance Mask Register */
#define CAN_MO183_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A6ECu)

/** Alias (User Manual Name) for CAN_MO183_AMR.
* To use register names with standard convension, please use CAN_MO183_AMR.
*/
#define	CAN_MOAMR183	(CAN_MO183_AMR)

/** \brief  26F8, Message Object  Arbitration Register */
#define CAN_MO183_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A6F8u)

/** Alias (User Manual Name) for CAN_MO183_AR.
* To use register names with standard convension, please use CAN_MO183_AR.
*/
#define	CAN_MOAR183	(CAN_MO183_AR)

/** \brief  26FC, Message Object  Control Register */
#define CAN_MO183_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A6FCu)

/** Alias (User Manual Name) for CAN_MO183_CTR.
* To use register names with standard convension, please use CAN_MO183_CTR.
*/
#define	CAN_MOCTR183	(CAN_MO183_CTR)

/** \brief  26F4, Message Object  Data Register High */
#define CAN_MO183_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A6F4u)

/** Alias (User Manual Name) for CAN_MO183_DATAH.
* To use register names with standard convension, please use CAN_MO183_DATAH.
*/
#define	CAN_MODATAH183	(CAN_MO183_DATAH)

/** \brief  26F0, Message Object  Data Register Low */
#define CAN_MO183_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A6F0u)

/** Alias (User Manual Name) for CAN_MO183_DATAL.
* To use register names with standard convension, please use CAN_MO183_DATAL.
*/
#define	CAN_MODATAL183	(CAN_MO183_DATAL)

/** \brief  26E0, Message Object  Function Control Register */
#define CAN_MO183_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A6E0u)

/** Alias (User Manual Name) for CAN_MO183_EDATA0.
* To use register names with standard convension, please use CAN_MO183_EDATA0.
*/
#define	CAN_EMO183DATA0	(CAN_MO183_EDATA0)

/** \brief  26E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO183_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A6E4u)

/** Alias (User Manual Name) for CAN_MO183_EDATA1.
* To use register names with standard convension, please use CAN_MO183_EDATA1.
*/
#define	CAN_EMO183DATA1	(CAN_MO183_EDATA1)

/** \brief  26E8, Message Object  Interrupt Pointer Register */
#define CAN_MO183_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A6E8u)

/** Alias (User Manual Name) for CAN_MO183_EDATA2.
* To use register names with standard convension, please use CAN_MO183_EDATA2.
*/
#define	CAN_EMO183DATA2	(CAN_MO183_EDATA2)

/** \brief  26EC, Message Object  Acceptance Mask Register */
#define CAN_MO183_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A6ECu)

/** Alias (User Manual Name) for CAN_MO183_EDATA3.
* To use register names with standard convension, please use CAN_MO183_EDATA3.
*/
#define	CAN_EMO183DATA3	(CAN_MO183_EDATA3)

/** \brief  26F0, Message Object  Data Register Low */
#define CAN_MO183_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A6F0u)

/** Alias (User Manual Name) for CAN_MO183_EDATA4.
* To use register names with standard convension, please use CAN_MO183_EDATA4.
*/
#define	CAN_EMO183DATA4	(CAN_MO183_EDATA4)

/** \brief  26F4, Message Object  Data Register High */
#define CAN_MO183_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A6F4u)

/** Alias (User Manual Name) for CAN_MO183_EDATA5.
* To use register names with standard convension, please use CAN_MO183_EDATA5.
*/
#define	CAN_EMO183DATA5	(CAN_MO183_EDATA5)

/** \brief  26F8, Message Object  Arbitration Register */
#define CAN_MO183_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A6F8u)

/** Alias (User Manual Name) for CAN_MO183_EDATA6.
* To use register names with standard convension, please use CAN_MO183_EDATA6.
*/
#define	CAN_EMO183DATA6	(CAN_MO183_EDATA6)

/** \brief  26E0, Message Object  Function Control Register */
#define CAN_MO183_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A6E0u)

/** Alias (User Manual Name) for CAN_MO183_FCR.
* To use register names with standard convension, please use CAN_MO183_FCR.
*/
#define	CAN_MOFCR183	(CAN_MO183_FCR)

/** \brief  26E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO183_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A6E4u)

/** Alias (User Manual Name) for CAN_MO183_FGPR.
* To use register names with standard convension, please use CAN_MO183_FGPR.
*/
#define	CAN_MOFGPR183	(CAN_MO183_FGPR)

/** \brief  26E8, Message Object  Interrupt Pointer Register */
#define CAN_MO183_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A6E8u)

/** Alias (User Manual Name) for CAN_MO183_IPR.
* To use register names with standard convension, please use CAN_MO183_IPR.
*/
#define	CAN_MOIPR183	(CAN_MO183_IPR)

/** \brief  26FC, Message Object  Control Register */
#define CAN_MO183_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A6FCu)

/** Alias (User Manual Name) for CAN_MO183_STAT.
* To use register names with standard convension, please use CAN_MO183_STAT.
*/
#define	CAN_MOSTAT183	(CAN_MO183_STAT)

/** \brief  270C, Message Object  Acceptance Mask Register */
#define CAN_MO184_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A70Cu)

/** Alias (User Manual Name) for CAN_MO184_AMR.
* To use register names with standard convension, please use CAN_MO184_AMR.
*/
#define	CAN_MOAMR184	(CAN_MO184_AMR)

/** \brief  2718, Message Object  Arbitration Register */
#define CAN_MO184_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A718u)

/** Alias (User Manual Name) for CAN_MO184_AR.
* To use register names with standard convension, please use CAN_MO184_AR.
*/
#define	CAN_MOAR184	(CAN_MO184_AR)

/** \brief  271C, Message Object  Control Register */
#define CAN_MO184_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A71Cu)

/** Alias (User Manual Name) for CAN_MO184_CTR.
* To use register names with standard convension, please use CAN_MO184_CTR.
*/
#define	CAN_MOCTR184	(CAN_MO184_CTR)

