luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2714, Message Object  Data Register High */
#define CAN_MO184_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A714u)

/** Alias (User Manual Name) for CAN_MO184_DATAH.
* To use register names with standard convension, please use CAN_MO184_DATAH.
*/
#define	CAN_MODATAH184	(CAN_MO184_DATAH)

/** \brief  2710, Message Object  Data Register Low */
#define CAN_MO184_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A710u)

/** Alias (User Manual Name) for CAN_MO184_DATAL.
* To use register names with standard convension, please use CAN_MO184_DATAL.
*/
#define	CAN_MODATAL184	(CAN_MO184_DATAL)

/** \brief  2700, Message Object  Function Control Register */
#define CAN_MO184_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A700u)

/** Alias (User Manual Name) for CAN_MO184_EDATA0.
* To use register names with standard convension, please use CAN_MO184_EDATA0.
*/
#define	CAN_EMO184DATA0	(CAN_MO184_EDATA0)

/** \brief  2704, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO184_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A704u)

/** Alias (User Manual Name) for CAN_MO184_EDATA1.
* To use register names with standard convension, please use CAN_MO184_EDATA1.
*/
#define	CAN_EMO184DATA1	(CAN_MO184_EDATA1)

/** \brief  2708, Message Object  Interrupt Pointer Register */
#define CAN_MO184_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A708u)

/** Alias (User Manual Name) for CAN_MO184_EDATA2.
* To use register names with standard convension, please use CAN_MO184_EDATA2.
*/
#define	CAN_EMO184DATA2	(CAN_MO184_EDATA2)

/** \brief  270C, Message Object  Acceptance Mask Register */
#define CAN_MO184_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A70Cu)

/** Alias (User Manual Name) for CAN_MO184_EDATA3.
* To use register names with standard convension, please use CAN_MO184_EDATA3.
*/
#define	CAN_EMO184DATA3	(CAN_MO184_EDATA3)

/** \brief  2710, Message Object  Data Register Low */
#define CAN_MO184_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A710u)

/** Alias (User Manual Name) for CAN_MO184_EDATA4.
* To use register names with standard convension, please use CAN_MO184_EDATA4.
*/
#define	CAN_EMO184DATA4	(CAN_MO184_EDATA4)

/** \brief  2714, Message Object  Data Register High */
#define CAN_MO184_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A714u)

/** Alias (User Manual Name) for CAN_MO184_EDATA5.
* To use register names with standard convension, please use CAN_MO184_EDATA5.
*/
#define	CAN_EMO184DATA5	(CAN_MO184_EDATA5)

/** \brief  2718, Message Object  Arbitration Register */
#define CAN_MO184_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A718u)

/** Alias (User Manual Name) for CAN_MO184_EDATA6.
* To use register names with standard convension, please use CAN_MO184_EDATA6.
*/
#define	CAN_EMO184DATA6	(CAN_MO184_EDATA6)

/** \brief  2700, Message Object  Function Control Register */
#define CAN_MO184_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A700u)

/** Alias (User Manual Name) for CAN_MO184_FCR.
* To use register names with standard convension, please use CAN_MO184_FCR.
*/
#define	CAN_MOFCR184	(CAN_MO184_FCR)

/** \brief  2704, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO184_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A704u)

/** Alias (User Manual Name) for CAN_MO184_FGPR.
* To use register names with standard convension, please use CAN_MO184_FGPR.
*/
#define	CAN_MOFGPR184	(CAN_MO184_FGPR)

/** \brief  2708, Message Object  Interrupt Pointer Register */
#define CAN_MO184_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A708u)

/** Alias (User Manual Name) for CAN_MO184_IPR.
* To use register names with standard convension, please use CAN_MO184_IPR.
*/
#define	CAN_MOIPR184	(CAN_MO184_IPR)

/** \brief  271C, Message Object  Control Register */
#define CAN_MO184_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A71Cu)

/** Alias (User Manual Name) for CAN_MO184_STAT.
* To use register names with standard convension, please use CAN_MO184_STAT.
*/
#define	CAN_MOSTAT184	(CAN_MO184_STAT)

/** \brief  272C, Message Object  Acceptance Mask Register */
#define CAN_MO185_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A72Cu)

/** Alias (User Manual Name) for CAN_MO185_AMR.
* To use register names with standard convension, please use CAN_MO185_AMR.
*/
#define	CAN_MOAMR185	(CAN_MO185_AMR)

/** \brief  2738, Message Object  Arbitration Register */
#define CAN_MO185_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A738u)

/** Alias (User Manual Name) for CAN_MO185_AR.
* To use register names with standard convension, please use CAN_MO185_AR.
*/
#define	CAN_MOAR185	(CAN_MO185_AR)

/** \brief  273C, Message Object  Control Register */
#define CAN_MO185_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A73Cu)

/** Alias (User Manual Name) for CAN_MO185_CTR.
* To use register names with standard convension, please use CAN_MO185_CTR.
*/
#define	CAN_MOCTR185	(CAN_MO185_CTR)

/** \brief  2734, Message Object  Data Register High */
#define CAN_MO185_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A734u)

/** Alias (User Manual Name) for CAN_MO185_DATAH.
* To use register names with standard convension, please use CAN_MO185_DATAH.
*/
#define	CAN_MODATAH185	(CAN_MO185_DATAH)

/** \brief  2730, Message Object  Data Register Low */
#define CAN_MO185_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A730u)

/** Alias (User Manual Name) for CAN_MO185_DATAL.
* To use register names with standard convension, please use CAN_MO185_DATAL.
*/
#define	CAN_MODATAL185	(CAN_MO185_DATAL)

/** \brief  2720, Message Object  Function Control Register */
#define CAN_MO185_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A720u)

/** Alias (User Manual Name) for CAN_MO185_EDATA0.
* To use register names with standard convension, please use CAN_MO185_EDATA0.
*/
#define	CAN_EMO185DATA0	(CAN_MO185_EDATA0)

/** \brief  2724, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO185_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A724u)

