luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO185_EDATA1.
* To use register names with standard convension, please use CAN_MO185_EDATA1.
*/
#define	CAN_EMO185DATA1	(CAN_MO185_EDATA1)

/** \brief  2728, Message Object  Interrupt Pointer Register */
#define CAN_MO185_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A728u)

/** Alias (User Manual Name) for CAN_MO185_EDATA2.
* To use register names with standard convension, please use CAN_MO185_EDATA2.
*/
#define	CAN_EMO185DATA2	(CAN_MO185_EDATA2)

/** \brief  272C, Message Object  Acceptance Mask Register */
#define CAN_MO185_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A72Cu)

/** Alias (User Manual Name) for CAN_MO185_EDATA3.
* To use register names with standard convension, please use CAN_MO185_EDATA3.
*/
#define	CAN_EMO185DATA3	(CAN_MO185_EDATA3)

/** \brief  2730, Message Object  Data Register Low */
#define CAN_MO185_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A730u)

/** Alias (User Manual Name) for CAN_MO185_EDATA4.
* To use register names with standard convension, please use CAN_MO185_EDATA4.
*/
#define	CAN_EMO185DATA4	(CAN_MO185_EDATA4)

/** \brief  2734, Message Object  Data Register High */
#define CAN_MO185_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A734u)

/** Alias (User Manual Name) for CAN_MO185_EDATA5.
* To use register names with standard convension, please use CAN_MO185_EDATA5.
*/
#define	CAN_EMO185DATA5	(CAN_MO185_EDATA5)

/** \brief  2738, Message Object  Arbitration Register */
#define CAN_MO185_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A738u)

/** Alias (User Manual Name) for CAN_MO185_EDATA6.
* To use register names with standard convension, please use CAN_MO185_EDATA6.
*/
#define	CAN_EMO185DATA6	(CAN_MO185_EDATA6)

/** \brief  2720, Message Object  Function Control Register */
#define CAN_MO185_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A720u)

/** Alias (User Manual Name) for CAN_MO185_FCR.
* To use register names with standard convension, please use CAN_MO185_FCR.
*/
#define	CAN_MOFCR185	(CAN_MO185_FCR)

/** \brief  2724, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO185_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A724u)

/** Alias (User Manual Name) for CAN_MO185_FGPR.
* To use register names with standard convension, please use CAN_MO185_FGPR.
*/
#define	CAN_MOFGPR185	(CAN_MO185_FGPR)

/** \brief  2728, Message Object  Interrupt Pointer Register */
#define CAN_MO185_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A728u)

/** Alias (User Manual Name) for CAN_MO185_IPR.
* To use register names with standard convension, please use CAN_MO185_IPR.
*/
#define	CAN_MOIPR185	(CAN_MO185_IPR)

/** \brief  273C, Message Object  Control Register */
#define CAN_MO185_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A73Cu)

/** Alias (User Manual Name) for CAN_MO185_STAT.
* To use register names with standard convension, please use CAN_MO185_STAT.
*/
#define	CAN_MOSTAT185	(CAN_MO185_STAT)

/** \brief  274C, Message Object  Acceptance Mask Register */
#define CAN_MO186_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A74Cu)

/** Alias (User Manual Name) for CAN_MO186_AMR.
* To use register names with standard convension, please use CAN_MO186_AMR.
*/
#define	CAN_MOAMR186	(CAN_MO186_AMR)

/** \brief  2758, Message Object  Arbitration Register */
#define CAN_MO186_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A758u)

/** Alias (User Manual Name) for CAN_MO186_AR.
* To use register names with standard convension, please use CAN_MO186_AR.
*/
#define	CAN_MOAR186	(CAN_MO186_AR)

/** \brief  275C, Message Object  Control Register */
#define CAN_MO186_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A75Cu)

/** Alias (User Manual Name) for CAN_MO186_CTR.
* To use register names with standard convension, please use CAN_MO186_CTR.
*/
#define	CAN_MOCTR186	(CAN_MO186_CTR)

/** \brief  2754, Message Object  Data Register High */
#define CAN_MO186_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A754u)

/** Alias (User Manual Name) for CAN_MO186_DATAH.
* To use register names with standard convension, please use CAN_MO186_DATAH.
*/
#define	CAN_MODATAH186	(CAN_MO186_DATAH)

/** \brief  2750, Message Object  Data Register Low */
#define CAN_MO186_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A750u)

/** Alias (User Manual Name) for CAN_MO186_DATAL.
* To use register names with standard convension, please use CAN_MO186_DATAL.
*/
#define	CAN_MODATAL186	(CAN_MO186_DATAL)

/** \brief  2740, Message Object  Function Control Register */
#define CAN_MO186_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A740u)

/** Alias (User Manual Name) for CAN_MO186_EDATA0.
* To use register names with standard convension, please use CAN_MO186_EDATA0.
*/
#define	CAN_EMO186DATA0	(CAN_MO186_EDATA0)

/** \brief  2744, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO186_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A744u)

/** Alias (User Manual Name) for CAN_MO186_EDATA1.
* To use register names with standard convension, please use CAN_MO186_EDATA1.
*/
#define	CAN_EMO186DATA1	(CAN_MO186_EDATA1)

/** \brief  2748, Message Object  Interrupt Pointer Register */
#define CAN_MO186_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A748u)

/** Alias (User Manual Name) for CAN_MO186_EDATA2.
* To use register names with standard convension, please use CAN_MO186_EDATA2.
*/
#define	CAN_EMO186DATA2	(CAN_MO186_EDATA2)

/** \brief  274C, Message Object  Acceptance Mask Register */
#define CAN_MO186_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A74Cu)

/** Alias (User Manual Name) for CAN_MO186_EDATA3.
* To use register names with standard convension, please use CAN_MO186_EDATA3.
*/
#define	CAN_EMO186DATA3	(CAN_MO186_EDATA3)

/** \brief  2750, Message Object  Data Register Low */
#define CAN_MO186_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A750u)

