luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO186_EDATA4.
* To use register names with standard convension, please use CAN_MO186_EDATA4.
*/
#define	CAN_EMO186DATA4	(CAN_MO186_EDATA4)

/** \brief  2754, Message Object  Data Register High */
#define CAN_MO186_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A754u)

/** Alias (User Manual Name) for CAN_MO186_EDATA5.
* To use register names with standard convension, please use CAN_MO186_EDATA5.
*/
#define	CAN_EMO186DATA5	(CAN_MO186_EDATA5)

/** \brief  2758, Message Object  Arbitration Register */
#define CAN_MO186_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A758u)

/** Alias (User Manual Name) for CAN_MO186_EDATA6.
* To use register names with standard convension, please use CAN_MO186_EDATA6.
*/
#define	CAN_EMO186DATA6	(CAN_MO186_EDATA6)

/** \brief  2740, Message Object  Function Control Register */
#define CAN_MO186_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A740u)

/** Alias (User Manual Name) for CAN_MO186_FCR.
* To use register names with standard convension, please use CAN_MO186_FCR.
*/
#define	CAN_MOFCR186	(CAN_MO186_FCR)

/** \brief  2744, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO186_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A744u)

/** Alias (User Manual Name) for CAN_MO186_FGPR.
* To use register names with standard convension, please use CAN_MO186_FGPR.
*/
#define	CAN_MOFGPR186	(CAN_MO186_FGPR)

/** \brief  2748, Message Object  Interrupt Pointer Register */
#define CAN_MO186_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A748u)

/** Alias (User Manual Name) for CAN_MO186_IPR.
* To use register names with standard convension, please use CAN_MO186_IPR.
*/
#define	CAN_MOIPR186	(CAN_MO186_IPR)

/** \brief  275C, Message Object  Control Register */
#define CAN_MO186_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A75Cu)

/** Alias (User Manual Name) for CAN_MO186_STAT.
* To use register names with standard convension, please use CAN_MO186_STAT.
*/
#define	CAN_MOSTAT186	(CAN_MO186_STAT)

/** \brief  276C, Message Object  Acceptance Mask Register */
#define CAN_MO187_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A76Cu)

/** Alias (User Manual Name) for CAN_MO187_AMR.
* To use register names with standard convension, please use CAN_MO187_AMR.
*/
#define	CAN_MOAMR187	(CAN_MO187_AMR)

/** \brief  2778, Message Object  Arbitration Register */
#define CAN_MO187_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A778u)

/** Alias (User Manual Name) for CAN_MO187_AR.
* To use register names with standard convension, please use CAN_MO187_AR.
*/
#define	CAN_MOAR187	(CAN_MO187_AR)

/** \brief  277C, Message Object  Control Register */
#define CAN_MO187_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A77Cu)

/** Alias (User Manual Name) for CAN_MO187_CTR.
* To use register names with standard convension, please use CAN_MO187_CTR.
*/
#define	CAN_MOCTR187	(CAN_MO187_CTR)

/** \brief  2774, Message Object  Data Register High */
#define CAN_MO187_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A774u)

/** Alias (User Manual Name) for CAN_MO187_DATAH.
* To use register names with standard convension, please use CAN_MO187_DATAH.
*/
#define	CAN_MODATAH187	(CAN_MO187_DATAH)

/** \brief  2770, Message Object  Data Register Low */
#define CAN_MO187_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A770u)

/** Alias (User Manual Name) for CAN_MO187_DATAL.
* To use register names with standard convension, please use CAN_MO187_DATAL.
*/
#define	CAN_MODATAL187	(CAN_MO187_DATAL)

/** \brief  2760, Message Object  Function Control Register */
#define CAN_MO187_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A760u)

/** Alias (User Manual Name) for CAN_MO187_EDATA0.
* To use register names with standard convension, please use CAN_MO187_EDATA0.
*/
#define	CAN_EMO187DATA0	(CAN_MO187_EDATA0)

/** \brief  2764, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO187_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A764u)

/** Alias (User Manual Name) for CAN_MO187_EDATA1.
* To use register names with standard convension, please use CAN_MO187_EDATA1.
*/
#define	CAN_EMO187DATA1	(CAN_MO187_EDATA1)

/** \brief  2768, Message Object  Interrupt Pointer Register */
#define CAN_MO187_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A768u)

/** Alias (User Manual Name) for CAN_MO187_EDATA2.
* To use register names with standard convension, please use CAN_MO187_EDATA2.
*/
#define	CAN_EMO187DATA2	(CAN_MO187_EDATA2)

/** \brief  276C, Message Object  Acceptance Mask Register */
#define CAN_MO187_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A76Cu)

/** Alias (User Manual Name) for CAN_MO187_EDATA3.
* To use register names with standard convension, please use CAN_MO187_EDATA3.
*/
#define	CAN_EMO187DATA3	(CAN_MO187_EDATA3)

/** \brief  2770, Message Object  Data Register Low */
#define CAN_MO187_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A770u)

/** Alias (User Manual Name) for CAN_MO187_EDATA4.
* To use register names with standard convension, please use CAN_MO187_EDATA4.
*/
#define	CAN_EMO187DATA4	(CAN_MO187_EDATA4)

/** \brief  2774, Message Object  Data Register High */
#define CAN_MO187_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A774u)

/** Alias (User Manual Name) for CAN_MO187_EDATA5.
* To use register names with standard convension, please use CAN_MO187_EDATA5.
*/
#define	CAN_EMO187DATA5	(CAN_MO187_EDATA5)

/** \brief  2778, Message Object  Arbitration Register */
#define CAN_MO187_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A778u)

/** Alias (User Manual Name) for CAN_MO187_EDATA6.
* To use register names with standard convension, please use CAN_MO187_EDATA6.
*/
#define	CAN_EMO187DATA6	(CAN_MO187_EDATA6)

/** \brief  2760, Message Object  Function Control Register */
#define CAN_MO187_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A760u)

/** Alias (User Manual Name) for CAN_MO187_FCR.
* To use register names with standard convension, please use CAN_MO187_FCR.
*/
#define	CAN_MOFCR187	(CAN_MO187_FCR)

/** \brief  2764, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO187_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A764u)

/** Alias (User Manual Name) for CAN_MO187_FGPR.
* To use register names with standard convension, please use CAN_MO187_FGPR.
*/
#define	CAN_MOFGPR187	(CAN_MO187_FGPR)

