luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2768, Message Object  Interrupt Pointer Register */
#define CAN_MO187_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A768u)

/** Alias (User Manual Name) for CAN_MO187_IPR.
* To use register names with standard convension, please use CAN_MO187_IPR.
*/
#define	CAN_MOIPR187	(CAN_MO187_IPR)

/** \brief  277C, Message Object  Control Register */
#define CAN_MO187_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A77Cu)

/** Alias (User Manual Name) for CAN_MO187_STAT.
* To use register names with standard convension, please use CAN_MO187_STAT.
*/
#define	CAN_MOSTAT187	(CAN_MO187_STAT)

/** \brief  278C, Message Object  Acceptance Mask Register */
#define CAN_MO188_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A78Cu)

/** Alias (User Manual Name) for CAN_MO188_AMR.
* To use register names with standard convension, please use CAN_MO188_AMR.
*/
#define	CAN_MOAMR188	(CAN_MO188_AMR)

/** \brief  2798, Message Object  Arbitration Register */
#define CAN_MO188_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A798u)

/** Alias (User Manual Name) for CAN_MO188_AR.
* To use register names with standard convension, please use CAN_MO188_AR.
*/
#define	CAN_MOAR188	(CAN_MO188_AR)

/** \brief  279C, Message Object  Control Register */
#define CAN_MO188_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A79Cu)

/** Alias (User Manual Name) for CAN_MO188_CTR.
* To use register names with standard convension, please use CAN_MO188_CTR.
*/
#define	CAN_MOCTR188	(CAN_MO188_CTR)

/** \brief  2794, Message Object  Data Register High */
#define CAN_MO188_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A794u)

/** Alias (User Manual Name) for CAN_MO188_DATAH.
* To use register names with standard convension, please use CAN_MO188_DATAH.
*/
#define	CAN_MODATAH188	(CAN_MO188_DATAH)

/** \brief  2790, Message Object  Data Register Low */
#define CAN_MO188_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A790u)

/** Alias (User Manual Name) for CAN_MO188_DATAL.
* To use register names with standard convension, please use CAN_MO188_DATAL.
*/
#define	CAN_MODATAL188	(CAN_MO188_DATAL)

/** \brief  2780, Message Object  Function Control Register */
#define CAN_MO188_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A780u)

/** Alias (User Manual Name) for CAN_MO188_EDATA0.
* To use register names with standard convension, please use CAN_MO188_EDATA0.
*/
#define	CAN_EMO188DATA0	(CAN_MO188_EDATA0)

/** \brief  2784, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO188_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A784u)

/** Alias (User Manual Name) for CAN_MO188_EDATA1.
* To use register names with standard convension, please use CAN_MO188_EDATA1.
*/
#define	CAN_EMO188DATA1	(CAN_MO188_EDATA1)

/** \brief  2788, Message Object  Interrupt Pointer Register */
#define CAN_MO188_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A788u)

/** Alias (User Manual Name) for CAN_MO188_EDATA2.
* To use register names with standard convension, please use CAN_MO188_EDATA2.
*/
#define	CAN_EMO188DATA2	(CAN_MO188_EDATA2)

/** \brief  278C, Message Object  Acceptance Mask Register */
#define CAN_MO188_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A78Cu)

/** Alias (User Manual Name) for CAN_MO188_EDATA3.
* To use register names with standard convension, please use CAN_MO188_EDATA3.
*/
#define	CAN_EMO188DATA3	(CAN_MO188_EDATA3)

/** \brief  2790, Message Object  Data Register Low */
#define CAN_MO188_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A790u)

/** Alias (User Manual Name) for CAN_MO188_EDATA4.
* To use register names with standard convension, please use CAN_MO188_EDATA4.
*/
#define	CAN_EMO188DATA4	(CAN_MO188_EDATA4)

/** \brief  2794, Message Object  Data Register High */
#define CAN_MO188_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A794u)

/** Alias (User Manual Name) for CAN_MO188_EDATA5.
* To use register names with standard convension, please use CAN_MO188_EDATA5.
*/
#define	CAN_EMO188DATA5	(CAN_MO188_EDATA5)

/** \brief  2798, Message Object  Arbitration Register */
#define CAN_MO188_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A798u)

/** Alias (User Manual Name) for CAN_MO188_EDATA6.
* To use register names with standard convension, please use CAN_MO188_EDATA6.
*/
#define	CAN_EMO188DATA6	(CAN_MO188_EDATA6)

/** \brief  2780, Message Object  Function Control Register */
#define CAN_MO188_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A780u)

/** Alias (User Manual Name) for CAN_MO188_FCR.
* To use register names with standard convension, please use CAN_MO188_FCR.
*/
#define	CAN_MOFCR188	(CAN_MO188_FCR)

/** \brief  2784, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO188_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A784u)

/** Alias (User Manual Name) for CAN_MO188_FGPR.
* To use register names with standard convension, please use CAN_MO188_FGPR.
*/
#define	CAN_MOFGPR188	(CAN_MO188_FGPR)

/** \brief  2788, Message Object  Interrupt Pointer Register */
#define CAN_MO188_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A788u)

/** Alias (User Manual Name) for CAN_MO188_IPR.
* To use register names with standard convension, please use CAN_MO188_IPR.
*/
#define	CAN_MOIPR188	(CAN_MO188_IPR)

/** \brief  279C, Message Object  Control Register */
#define CAN_MO188_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A79Cu)

/** Alias (User Manual Name) for CAN_MO188_STAT.
* To use register names with standard convension, please use CAN_MO188_STAT.
*/
#define	CAN_MOSTAT188	(CAN_MO188_STAT)

/** \brief  27AC, Message Object  Acceptance Mask Register */
#define CAN_MO189_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A7ACu)

/** Alias (User Manual Name) for CAN_MO189_AMR.
* To use register names with standard convension, please use CAN_MO189_AMR.
*/
#define	CAN_MOAMR189	(CAN_MO189_AMR)

/** \brief  27B8, Message Object  Arbitration Register */
#define CAN_MO189_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A7B8u)

