luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO189_AR.
* To use register names with standard convension, please use CAN_MO189_AR.
*/
#define	CAN_MOAR189	(CAN_MO189_AR)

/** \brief  27BC, Message Object  Control Register */
#define CAN_MO189_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A7BCu)

/** Alias (User Manual Name) for CAN_MO189_CTR.
* To use register names with standard convension, please use CAN_MO189_CTR.
*/
#define	CAN_MOCTR189	(CAN_MO189_CTR)

/** \brief  27B4, Message Object  Data Register High */
#define CAN_MO189_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A7B4u)

/** Alias (User Manual Name) for CAN_MO189_DATAH.
* To use register names with standard convension, please use CAN_MO189_DATAH.
*/
#define	CAN_MODATAH189	(CAN_MO189_DATAH)

/** \brief  27B0, Message Object  Data Register Low */
#define CAN_MO189_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A7B0u)

/** Alias (User Manual Name) for CAN_MO189_DATAL.
* To use register names with standard convension, please use CAN_MO189_DATAL.
*/
#define	CAN_MODATAL189	(CAN_MO189_DATAL)

/** \brief  27A0, Message Object  Function Control Register */
#define CAN_MO189_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A7A0u)

/** Alias (User Manual Name) for CAN_MO189_EDATA0.
* To use register names with standard convension, please use CAN_MO189_EDATA0.
*/
#define	CAN_EMO189DATA0	(CAN_MO189_EDATA0)

/** \brief  27A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO189_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A7A4u)

/** Alias (User Manual Name) for CAN_MO189_EDATA1.
* To use register names with standard convension, please use CAN_MO189_EDATA1.
*/
#define	CAN_EMO189DATA1	(CAN_MO189_EDATA1)

/** \brief  27A8, Message Object  Interrupt Pointer Register */
#define CAN_MO189_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A7A8u)

/** Alias (User Manual Name) for CAN_MO189_EDATA2.
* To use register names with standard convension, please use CAN_MO189_EDATA2.
*/
#define	CAN_EMO189DATA2	(CAN_MO189_EDATA2)

/** \brief  27AC, Message Object  Acceptance Mask Register */
#define CAN_MO189_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A7ACu)

/** Alias (User Manual Name) for CAN_MO189_EDATA3.
* To use register names with standard convension, please use CAN_MO189_EDATA3.
*/
#define	CAN_EMO189DATA3	(CAN_MO189_EDATA3)

/** \brief  27B0, Message Object  Data Register Low */
#define CAN_MO189_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A7B0u)

/** Alias (User Manual Name) for CAN_MO189_EDATA4.
* To use register names with standard convension, please use CAN_MO189_EDATA4.
*/
#define	CAN_EMO189DATA4	(CAN_MO189_EDATA4)

/** \brief  27B4, Message Object  Data Register High */
#define CAN_MO189_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A7B4u)

/** Alias (User Manual Name) for CAN_MO189_EDATA5.
* To use register names with standard convension, please use CAN_MO189_EDATA5.
*/
#define	CAN_EMO189DATA5	(CAN_MO189_EDATA5)

/** \brief  27B8, Message Object  Arbitration Register */
#define CAN_MO189_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A7B8u)

/** Alias (User Manual Name) for CAN_MO189_EDATA6.
* To use register names with standard convension, please use CAN_MO189_EDATA6.
*/
#define	CAN_EMO189DATA6	(CAN_MO189_EDATA6)

/** \brief  27A0, Message Object  Function Control Register */
#define CAN_MO189_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A7A0u)

/** Alias (User Manual Name) for CAN_MO189_FCR.
* To use register names with standard convension, please use CAN_MO189_FCR.
*/
#define	CAN_MOFCR189	(CAN_MO189_FCR)

/** \brief  27A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO189_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A7A4u)

/** Alias (User Manual Name) for CAN_MO189_FGPR.
* To use register names with standard convension, please use CAN_MO189_FGPR.
*/
#define	CAN_MOFGPR189	(CAN_MO189_FGPR)

/** \brief  27A8, Message Object  Interrupt Pointer Register */
#define CAN_MO189_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A7A8u)

/** Alias (User Manual Name) for CAN_MO189_IPR.
* To use register names with standard convension, please use CAN_MO189_IPR.
*/
#define	CAN_MOIPR189	(CAN_MO189_IPR)

/** \brief  27BC, Message Object  Control Register */
#define CAN_MO189_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A7BCu)

/** Alias (User Manual Name) for CAN_MO189_STAT.
* To use register names with standard convension, please use CAN_MO189_STAT.
*/
#define	CAN_MOSTAT189	(CAN_MO189_STAT)

/** \brief  124C, Message Object  Acceptance Mask Register */
#define CAN_MO18_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001924Cu)

/** Alias (User Manual Name) for CAN_MO18_AMR.
* To use register names with standard convension, please use CAN_MO18_AMR.
*/
#define	CAN_MOAMR18	(CAN_MO18_AMR)

/** \brief  1258, Message Object  Arbitration Register */
#define CAN_MO18_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019258u)

/** Alias (User Manual Name) for CAN_MO18_AR.
* To use register names with standard convension, please use CAN_MO18_AR.
*/
#define	CAN_MOAR18	(CAN_MO18_AR)

/** \brief  125C, Message Object  Control Register */
#define CAN_MO18_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001925Cu)

/** Alias (User Manual Name) for CAN_MO18_CTR.
* To use register names with standard convension, please use CAN_MO18_CTR.
*/
#define	CAN_MOCTR18	(CAN_MO18_CTR)

/** \brief  1254, Message Object  Data Register High */
#define CAN_MO18_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019254u)

/** Alias (User Manual Name) for CAN_MO18_DATAH.
* To use register names with standard convension, please use CAN_MO18_DATAH.
*/
#define	CAN_MODATAH18	(CAN_MO18_DATAH)

/** \brief  1250, Message Object  Data Register Low */
#define CAN_MO18_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019250u)

/** Alias (User Manual Name) for CAN_MO18_DATAL.
* To use register names with standard convension, please use CAN_MO18_DATAL.
*/
#define	CAN_MODATAL18	(CAN_MO18_DATAL)

/** \brief  1240, Message Object  Function Control Register */
#define CAN_MO18_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019240u)

/** Alias (User Manual Name) for CAN_MO18_EDATA0.
* To use register names with standard convension, please use CAN_MO18_EDATA0.
*/
#define	CAN_EMO18DATA0	(CAN_MO18_EDATA0)

/** \brief  1244, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO18_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019244u)

/** Alias (User Manual Name) for CAN_MO18_EDATA1.
* To use register names with standard convension, please use CAN_MO18_EDATA1.
*/
#define	CAN_EMO18DATA1	(CAN_MO18_EDATA1)

/** \brief  1248, Message Object  Interrupt Pointer Register */
#define CAN_MO18_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019248u)

