luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO18_EDATA2.
* To use register names with standard convension, please use CAN_MO18_EDATA2.
*/
#define	CAN_EMO18DATA2	(CAN_MO18_EDATA2)

/** \brief  124C, Message Object  Acceptance Mask Register */
#define CAN_MO18_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001924Cu)

/** Alias (User Manual Name) for CAN_MO18_EDATA3.
* To use register names with standard convension, please use CAN_MO18_EDATA3.
*/
#define	CAN_EMO18DATA3	(CAN_MO18_EDATA3)

/** \brief  1250, Message Object  Data Register Low */
#define CAN_MO18_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019250u)

/** Alias (User Manual Name) for CAN_MO18_EDATA4.
* To use register names with standard convension, please use CAN_MO18_EDATA4.
*/
#define	CAN_EMO18DATA4	(CAN_MO18_EDATA4)

/** \brief  1254, Message Object  Data Register High */
#define CAN_MO18_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019254u)

/** Alias (User Manual Name) for CAN_MO18_EDATA5.
* To use register names with standard convension, please use CAN_MO18_EDATA5.
*/
#define	CAN_EMO18DATA5	(CAN_MO18_EDATA5)

/** \brief  1258, Message Object  Arbitration Register */
#define CAN_MO18_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019258u)

/** Alias (User Manual Name) for CAN_MO18_EDATA6.
* To use register names with standard convension, please use CAN_MO18_EDATA6.
*/
#define	CAN_EMO18DATA6	(CAN_MO18_EDATA6)

/** \brief  1240, Message Object  Function Control Register */
#define CAN_MO18_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019240u)

/** Alias (User Manual Name) for CAN_MO18_FCR.
* To use register names with standard convension, please use CAN_MO18_FCR.
*/
#define	CAN_MOFCR18	(CAN_MO18_FCR)

/** \brief  1244, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO18_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019244u)

/** Alias (User Manual Name) for CAN_MO18_FGPR.
* To use register names with standard convension, please use CAN_MO18_FGPR.
*/
#define	CAN_MOFGPR18	(CAN_MO18_FGPR)

/** \brief  1248, Message Object  Interrupt Pointer Register */
#define CAN_MO18_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019248u)

/** Alias (User Manual Name) for CAN_MO18_IPR.
* To use register names with standard convension, please use CAN_MO18_IPR.
*/
#define	CAN_MOIPR18	(CAN_MO18_IPR)

/** \brief  125C, Message Object  Control Register */
#define CAN_MO18_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001925Cu)

/** Alias (User Manual Name) for CAN_MO18_STAT.
* To use register names with standard convension, please use CAN_MO18_STAT.
*/
#define	CAN_MOSTAT18	(CAN_MO18_STAT)

/** \brief  27CC, Message Object  Acceptance Mask Register */
#define CAN_MO190_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A7CCu)

/** Alias (User Manual Name) for CAN_MO190_AMR.
* To use register names with standard convension, please use CAN_MO190_AMR.
*/
#define	CAN_MOAMR190	(CAN_MO190_AMR)

/** \brief  27D8, Message Object  Arbitration Register */
#define CAN_MO190_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A7D8u)

/** Alias (User Manual Name) for CAN_MO190_AR.
* To use register names with standard convension, please use CAN_MO190_AR.
*/
#define	CAN_MOAR190	(CAN_MO190_AR)

/** \brief  27DC, Message Object  Control Register */
#define CAN_MO190_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A7DCu)

/** Alias (User Manual Name) for CAN_MO190_CTR.
* To use register names with standard convension, please use CAN_MO190_CTR.
*/
#define	CAN_MOCTR190	(CAN_MO190_CTR)

/** \brief  27D4, Message Object  Data Register High */
#define CAN_MO190_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A7D4u)

/** Alias (User Manual Name) for CAN_MO190_DATAH.
* To use register names with standard convension, please use CAN_MO190_DATAH.
*/
#define	CAN_MODATAH190	(CAN_MO190_DATAH)

/** \brief  27D0, Message Object  Data Register Low */
#define CAN_MO190_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A7D0u)

/** Alias (User Manual Name) for CAN_MO190_DATAL.
* To use register names with standard convension, please use CAN_MO190_DATAL.
*/
#define	CAN_MODATAL190	(CAN_MO190_DATAL)

/** \brief  27C0, Message Object  Function Control Register */
#define CAN_MO190_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A7C0u)

/** Alias (User Manual Name) for CAN_MO190_EDATA0.
* To use register names with standard convension, please use CAN_MO190_EDATA0.
*/
#define	CAN_EMO190DATA0	(CAN_MO190_EDATA0)

/** \brief  27C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO190_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A7C4u)

/** Alias (User Manual Name) for CAN_MO190_EDATA1.
* To use register names with standard convension, please use CAN_MO190_EDATA1.
*/
#define	CAN_EMO190DATA1	(CAN_MO190_EDATA1)

/** \brief  27C8, Message Object  Interrupt Pointer Register */
#define CAN_MO190_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A7C8u)

/** Alias (User Manual Name) for CAN_MO190_EDATA2.
* To use register names with standard convension, please use CAN_MO190_EDATA2.
*/
#define	CAN_EMO190DATA2	(CAN_MO190_EDATA2)

/** \brief  27CC, Message Object  Acceptance Mask Register */
#define CAN_MO190_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A7CCu)

/** Alias (User Manual Name) for CAN_MO190_EDATA3.
* To use register names with standard convension, please use CAN_MO190_EDATA3.
*/
#define	CAN_EMO190DATA3	(CAN_MO190_EDATA3)

/** \brief  27D0, Message Object  Data Register Low */
#define CAN_MO190_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A7D0u)

/** Alias (User Manual Name) for CAN_MO190_EDATA4.
* To use register names with standard convension, please use CAN_MO190_EDATA4.
*/
#define	CAN_EMO190DATA4	(CAN_MO190_EDATA4)

/** \brief  27D4, Message Object  Data Register High */
#define CAN_MO190_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A7D4u)

/** Alias (User Manual Name) for CAN_MO190_EDATA5.
* To use register names with standard convension, please use CAN_MO190_EDATA5.
*/
#define	CAN_EMO190DATA5	(CAN_MO190_EDATA5)

/** \brief  27D8, Message Object  Arbitration Register */
#define CAN_MO190_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A7D8u)

/** Alias (User Manual Name) for CAN_MO190_EDATA6.
* To use register names with standard convension, please use CAN_MO190_EDATA6.
*/
#define	CAN_EMO190DATA6	(CAN_MO190_EDATA6)

/** \brief  27C0, Message Object  Function Control Register */
#define CAN_MO190_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A7C0u)

/** Alias (User Manual Name) for CAN_MO190_FCR.
* To use register names with standard convension, please use CAN_MO190_FCR.
*/
#define	CAN_MOFCR190	(CAN_MO190_FCR)

/** \brief  27C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO190_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A7C4u)

/** Alias (User Manual Name) for CAN_MO190_FGPR.
* To use register names with standard convension, please use CAN_MO190_FGPR.
*/
#define	CAN_MOFGPR190	(CAN_MO190_FGPR)

/** \brief  27C8, Message Object  Interrupt Pointer Register */
#define CAN_MO190_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A7C8u)

