luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO190_IPR.
* To use register names with standard convension, please use CAN_MO190_IPR.
*/
#define	CAN_MOIPR190	(CAN_MO190_IPR)

/** \brief  27DC, Message Object  Control Register */
#define CAN_MO190_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A7DCu)

/** Alias (User Manual Name) for CAN_MO190_STAT.
* To use register names with standard convension, please use CAN_MO190_STAT.
*/
#define	CAN_MOSTAT190	(CAN_MO190_STAT)

/** \brief  27EC, Message Object  Acceptance Mask Register */
#define CAN_MO191_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A7ECu)

/** Alias (User Manual Name) for CAN_MO191_AMR.
* To use register names with standard convension, please use CAN_MO191_AMR.
*/
#define	CAN_MOAMR191	(CAN_MO191_AMR)

/** \brief  27F8, Message Object  Arbitration Register */
#define CAN_MO191_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A7F8u)

/** Alias (User Manual Name) for CAN_MO191_AR.
* To use register names with standard convension, please use CAN_MO191_AR.
*/
#define	CAN_MOAR191	(CAN_MO191_AR)

/** \brief  27FC, Message Object  Control Register */
#define CAN_MO191_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A7FCu)

/** Alias (User Manual Name) for CAN_MO191_CTR.
* To use register names with standard convension, please use CAN_MO191_CTR.
*/
#define	CAN_MOCTR191	(CAN_MO191_CTR)

/** \brief  27F4, Message Object  Data Register High */
#define CAN_MO191_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A7F4u)

/** Alias (User Manual Name) for CAN_MO191_DATAH.
* To use register names with standard convension, please use CAN_MO191_DATAH.
*/
#define	CAN_MODATAH191	(CAN_MO191_DATAH)

/** \brief  27F0, Message Object  Data Register Low */
#define CAN_MO191_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A7F0u)

/** Alias (User Manual Name) for CAN_MO191_DATAL.
* To use register names with standard convension, please use CAN_MO191_DATAL.
*/
#define	CAN_MODATAL191	(CAN_MO191_DATAL)

/** \brief  27E0, Message Object  Function Control Register */
#define CAN_MO191_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A7E0u)

/** Alias (User Manual Name) for CAN_MO191_EDATA0.
* To use register names with standard convension, please use CAN_MO191_EDATA0.
*/
#define	CAN_EMO191DATA0	(CAN_MO191_EDATA0)

/** \brief  27E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO191_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A7E4u)

/** Alias (User Manual Name) for CAN_MO191_EDATA1.
* To use register names with standard convension, please use CAN_MO191_EDATA1.
*/
#define	CAN_EMO191DATA1	(CAN_MO191_EDATA1)

/** \brief  27E8, Message Object  Interrupt Pointer Register */
#define CAN_MO191_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A7E8u)

/** Alias (User Manual Name) for CAN_MO191_EDATA2.
* To use register names with standard convension, please use CAN_MO191_EDATA2.
*/
#define	CAN_EMO191DATA2	(CAN_MO191_EDATA2)

/** \brief  27EC, Message Object  Acceptance Mask Register */
#define CAN_MO191_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A7ECu)

/** Alias (User Manual Name) for CAN_MO191_EDATA3.
* To use register names with standard convension, please use CAN_MO191_EDATA3.
*/
#define	CAN_EMO191DATA3	(CAN_MO191_EDATA3)

/** \brief  27F0, Message Object  Data Register Low */
#define CAN_MO191_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A7F0u)

/** Alias (User Manual Name) for CAN_MO191_EDATA4.
* To use register names with standard convension, please use CAN_MO191_EDATA4.
*/
#define	CAN_EMO191DATA4	(CAN_MO191_EDATA4)

/** \brief  27F4, Message Object  Data Register High */
#define CAN_MO191_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A7F4u)

/** Alias (User Manual Name) for CAN_MO191_EDATA5.
* To use register names with standard convension, please use CAN_MO191_EDATA5.
*/
#define	CAN_EMO191DATA5	(CAN_MO191_EDATA5)

/** \brief  27F8, Message Object  Arbitration Register */
#define CAN_MO191_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A7F8u)

/** Alias (User Manual Name) for CAN_MO191_EDATA6.
* To use register names with standard convension, please use CAN_MO191_EDATA6.
*/
#define	CAN_EMO191DATA6	(CAN_MO191_EDATA6)

/** \brief  27E0, Message Object  Function Control Register */
#define CAN_MO191_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A7E0u)

/** Alias (User Manual Name) for CAN_MO191_FCR.
* To use register names with standard convension, please use CAN_MO191_FCR.
*/
#define	CAN_MOFCR191	(CAN_MO191_FCR)

/** \brief  27E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO191_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A7E4u)

/** Alias (User Manual Name) for CAN_MO191_FGPR.
* To use register names with standard convension, please use CAN_MO191_FGPR.
*/
#define	CAN_MOFGPR191	(CAN_MO191_FGPR)

/** \brief  27E8, Message Object  Interrupt Pointer Register */
#define CAN_MO191_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A7E8u)

/** Alias (User Manual Name) for CAN_MO191_IPR.
* To use register names with standard convension, please use CAN_MO191_IPR.
*/
#define	CAN_MOIPR191	(CAN_MO191_IPR)

/** \brief  27FC, Message Object  Control Register */
#define CAN_MO191_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A7FCu)

/** Alias (User Manual Name) for CAN_MO191_STAT.
* To use register names with standard convension, please use CAN_MO191_STAT.
*/
#define	CAN_MOSTAT191	(CAN_MO191_STAT)

/** \brief  280C, Message Object  Acceptance Mask Register */
#define CAN_MO192_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A80Cu)

/** Alias (User Manual Name) for CAN_MO192_AMR.
* To use register names with standard convension, please use CAN_MO192_AMR.
*/
#define	CAN_MOAMR192	(CAN_MO192_AMR)

/** \brief  2818, Message Object  Arbitration Register */
#define CAN_MO192_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A818u)

/** Alias (User Manual Name) for CAN_MO192_AR.
* To use register names with standard convension, please use CAN_MO192_AR.
*/
#define	CAN_MOAR192	(CAN_MO192_AR)

/** \brief  281C, Message Object  Control Register */
#define CAN_MO192_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A81Cu)

/** Alias (User Manual Name) for CAN_MO192_CTR.
* To use register names with standard convension, please use CAN_MO192_CTR.
*/
#define	CAN_MOCTR192	(CAN_MO192_CTR)

/** \brief  2814, Message Object  Data Register High */
#define CAN_MO192_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A814u)

/** Alias (User Manual Name) for CAN_MO192_DATAH.
* To use register names with standard convension, please use CAN_MO192_DATAH.
*/
#define	CAN_MODATAH192	(CAN_MO192_DATAH)

