luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2810, Message Object  Data Register Low */
#define CAN_MO192_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A810u)

/** Alias (User Manual Name) for CAN_MO192_DATAL.
* To use register names with standard convension, please use CAN_MO192_DATAL.
*/
#define	CAN_MODATAL192	(CAN_MO192_DATAL)

/** \brief  2800, Message Object  Function Control Register */
#define CAN_MO192_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A800u)

/** Alias (User Manual Name) for CAN_MO192_EDATA0.
* To use register names with standard convension, please use CAN_MO192_EDATA0.
*/
#define	CAN_EMO192DATA0	(CAN_MO192_EDATA0)

/** \brief  2804, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO192_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A804u)

/** Alias (User Manual Name) for CAN_MO192_EDATA1.
* To use register names with standard convension, please use CAN_MO192_EDATA1.
*/
#define	CAN_EMO192DATA1	(CAN_MO192_EDATA1)

/** \brief  2808, Message Object  Interrupt Pointer Register */
#define CAN_MO192_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A808u)

/** Alias (User Manual Name) for CAN_MO192_EDATA2.
* To use register names with standard convension, please use CAN_MO192_EDATA2.
*/
#define	CAN_EMO192DATA2	(CAN_MO192_EDATA2)

/** \brief  280C, Message Object  Acceptance Mask Register */
#define CAN_MO192_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A80Cu)

/** Alias (User Manual Name) for CAN_MO192_EDATA3.
* To use register names with standard convension, please use CAN_MO192_EDATA3.
*/
#define	CAN_EMO192DATA3	(CAN_MO192_EDATA3)

/** \brief  2810, Message Object  Data Register Low */
#define CAN_MO192_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A810u)

/** Alias (User Manual Name) for CAN_MO192_EDATA4.
* To use register names with standard convension, please use CAN_MO192_EDATA4.
*/
#define	CAN_EMO192DATA4	(CAN_MO192_EDATA4)

/** \brief  2814, Message Object  Data Register High */
#define CAN_MO192_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A814u)

/** Alias (User Manual Name) for CAN_MO192_EDATA5.
* To use register names with standard convension, please use CAN_MO192_EDATA5.
*/
#define	CAN_EMO192DATA5	(CAN_MO192_EDATA5)

/** \brief  2818, Message Object  Arbitration Register */
#define CAN_MO192_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A818u)

/** Alias (User Manual Name) for CAN_MO192_EDATA6.
* To use register names with standard convension, please use CAN_MO192_EDATA6.
*/
#define	CAN_EMO192DATA6	(CAN_MO192_EDATA6)

/** \brief  2800, Message Object  Function Control Register */
#define CAN_MO192_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A800u)

/** Alias (User Manual Name) for CAN_MO192_FCR.
* To use register names with standard convension, please use CAN_MO192_FCR.
*/
#define	CAN_MOFCR192	(CAN_MO192_FCR)

/** \brief  2804, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO192_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A804u)

/** Alias (User Manual Name) for CAN_MO192_FGPR.
* To use register names with standard convension, please use CAN_MO192_FGPR.
*/
#define	CAN_MOFGPR192	(CAN_MO192_FGPR)

/** \brief  2808, Message Object  Interrupt Pointer Register */
#define CAN_MO192_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A808u)

/** Alias (User Manual Name) for CAN_MO192_IPR.
* To use register names with standard convension, please use CAN_MO192_IPR.
*/
#define	CAN_MOIPR192	(CAN_MO192_IPR)

/** \brief  281C, Message Object  Control Register */
#define CAN_MO192_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A81Cu)

/** Alias (User Manual Name) for CAN_MO192_STAT.
* To use register names with standard convension, please use CAN_MO192_STAT.
*/
#define	CAN_MOSTAT192	(CAN_MO192_STAT)

/** \brief  282C, Message Object  Acceptance Mask Register */
#define CAN_MO193_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A82Cu)

/** Alias (User Manual Name) for CAN_MO193_AMR.
* To use register names with standard convension, please use CAN_MO193_AMR.
*/
#define	CAN_MOAMR193	(CAN_MO193_AMR)

/** \brief  2838, Message Object  Arbitration Register */
#define CAN_MO193_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A838u)

/** Alias (User Manual Name) for CAN_MO193_AR.
* To use register names with standard convension, please use CAN_MO193_AR.
*/
#define	CAN_MOAR193	(CAN_MO193_AR)

/** \brief  283C, Message Object  Control Register */
#define CAN_MO193_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A83Cu)

/** Alias (User Manual Name) for CAN_MO193_CTR.
* To use register names with standard convension, please use CAN_MO193_CTR.
*/
#define	CAN_MOCTR193	(CAN_MO193_CTR)

/** \brief  2834, Message Object  Data Register High */
#define CAN_MO193_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A834u)

/** Alias (User Manual Name) for CAN_MO193_DATAH.
* To use register names with standard convension, please use CAN_MO193_DATAH.
*/
#define	CAN_MODATAH193	(CAN_MO193_DATAH)

/** \brief  2830, Message Object  Data Register Low */
#define CAN_MO193_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A830u)

/** Alias (User Manual Name) for CAN_MO193_DATAL.
* To use register names with standard convension, please use CAN_MO193_DATAL.
*/
#define	CAN_MODATAL193	(CAN_MO193_DATAL)

/** \brief  2820, Message Object  Function Control Register */
#define CAN_MO193_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A820u)

/** Alias (User Manual Name) for CAN_MO193_EDATA0.
* To use register names with standard convension, please use CAN_MO193_EDATA0.
*/
#define	CAN_EMO193DATA0	(CAN_MO193_EDATA0)

/** \brief  2824, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO193_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A824u)

/** Alias (User Manual Name) for CAN_MO193_EDATA1.
* To use register names with standard convension, please use CAN_MO193_EDATA1.
*/
#define	CAN_EMO193DATA1	(CAN_MO193_EDATA1)

