luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2828, Message Object  Interrupt Pointer Register */
#define CAN_MO193_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A828u)

/** Alias (User Manual Name) for CAN_MO193_EDATA2.
* To use register names with standard convension, please use CAN_MO193_EDATA2.
*/
#define	CAN_EMO193DATA2	(CAN_MO193_EDATA2)

/** \brief  282C, Message Object  Acceptance Mask Register */
#define CAN_MO193_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A82Cu)

/** Alias (User Manual Name) for CAN_MO193_EDATA3.
* To use register names with standard convension, please use CAN_MO193_EDATA3.
*/
#define	CAN_EMO193DATA3	(CAN_MO193_EDATA3)

/** \brief  2830, Message Object  Data Register Low */
#define CAN_MO193_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A830u)

/** Alias (User Manual Name) for CAN_MO193_EDATA4.
* To use register names with standard convension, please use CAN_MO193_EDATA4.
*/
#define	CAN_EMO193DATA4	(CAN_MO193_EDATA4)

/** \brief  2834, Message Object  Data Register High */
#define CAN_MO193_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A834u)

/** Alias (User Manual Name) for CAN_MO193_EDATA5.
* To use register names with standard convension, please use CAN_MO193_EDATA5.
*/
#define	CAN_EMO193DATA5	(CAN_MO193_EDATA5)

/** \brief  2838, Message Object  Arbitration Register */
#define CAN_MO193_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A838u)

/** Alias (User Manual Name) for CAN_MO193_EDATA6.
* To use register names with standard convension, please use CAN_MO193_EDATA6.
*/
#define	CAN_EMO193DATA6	(CAN_MO193_EDATA6)

/** \brief  2820, Message Object  Function Control Register */
#define CAN_MO193_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A820u)

/** Alias (User Manual Name) for CAN_MO193_FCR.
* To use register names with standard convension, please use CAN_MO193_FCR.
*/
#define	CAN_MOFCR193	(CAN_MO193_FCR)

/** \brief  2824, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO193_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A824u)

/** Alias (User Manual Name) for CAN_MO193_FGPR.
* To use register names with standard convension, please use CAN_MO193_FGPR.
*/
#define	CAN_MOFGPR193	(CAN_MO193_FGPR)

/** \brief  2828, Message Object  Interrupt Pointer Register */
#define CAN_MO193_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A828u)

/** Alias (User Manual Name) for CAN_MO193_IPR.
* To use register names with standard convension, please use CAN_MO193_IPR.
*/
#define	CAN_MOIPR193	(CAN_MO193_IPR)

/** \brief  283C, Message Object  Control Register */
#define CAN_MO193_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A83Cu)

/** Alias (User Manual Name) for CAN_MO193_STAT.
* To use register names with standard convension, please use CAN_MO193_STAT.
*/
#define	CAN_MOSTAT193	(CAN_MO193_STAT)

/** \brief  284C, Message Object  Acceptance Mask Register */
#define CAN_MO194_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A84Cu)

/** Alias (User Manual Name) for CAN_MO194_AMR.
* To use register names with standard convension, please use CAN_MO194_AMR.
*/
#define	CAN_MOAMR194	(CAN_MO194_AMR)

/** \brief  2858, Message Object  Arbitration Register */
#define CAN_MO194_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A858u)

/** Alias (User Manual Name) for CAN_MO194_AR.
* To use register names with standard convension, please use CAN_MO194_AR.
*/
#define	CAN_MOAR194	(CAN_MO194_AR)

/** \brief  285C, Message Object  Control Register */
#define CAN_MO194_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A85Cu)

/** Alias (User Manual Name) for CAN_MO194_CTR.
* To use register names with standard convension, please use CAN_MO194_CTR.
*/
#define	CAN_MOCTR194	(CAN_MO194_CTR)

/** \brief  2854, Message Object  Data Register High */
#define CAN_MO194_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A854u)

/** Alias (User Manual Name) for CAN_MO194_DATAH.
* To use register names with standard convension, please use CAN_MO194_DATAH.
*/
#define	CAN_MODATAH194	(CAN_MO194_DATAH)

/** \brief  2850, Message Object  Data Register Low */
#define CAN_MO194_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A850u)

/** Alias (User Manual Name) for CAN_MO194_DATAL.
* To use register names with standard convension, please use CAN_MO194_DATAL.
*/
#define	CAN_MODATAL194	(CAN_MO194_DATAL)

/** \brief  2840, Message Object  Function Control Register */
#define CAN_MO194_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A840u)

/** Alias (User Manual Name) for CAN_MO194_EDATA0.
* To use register names with standard convension, please use CAN_MO194_EDATA0.
*/
#define	CAN_EMO194DATA0	(CAN_MO194_EDATA0)

/** \brief  2844, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO194_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A844u)

/** Alias (User Manual Name) for CAN_MO194_EDATA1.
* To use register names with standard convension, please use CAN_MO194_EDATA1.
*/
#define	CAN_EMO194DATA1	(CAN_MO194_EDATA1)

/** \brief  2848, Message Object  Interrupt Pointer Register */
#define CAN_MO194_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A848u)

/** Alias (User Manual Name) for CAN_MO194_EDATA2.
* To use register names with standard convension, please use CAN_MO194_EDATA2.
*/
#define	CAN_EMO194DATA2	(CAN_MO194_EDATA2)

/** \brief  284C, Message Object  Acceptance Mask Register */
#define CAN_MO194_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A84Cu)

/** Alias (User Manual Name) for CAN_MO194_EDATA3.
* To use register names with standard convension, please use CAN_MO194_EDATA3.
*/
#define	CAN_EMO194DATA3	(CAN_MO194_EDATA3)

/** \brief  2850, Message Object  Data Register Low */
#define CAN_MO194_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A850u)

/** Alias (User Manual Name) for CAN_MO194_EDATA4.
* To use register names with standard convension, please use CAN_MO194_EDATA4.
*/
#define	CAN_EMO194DATA4	(CAN_MO194_EDATA4)

/** \brief  2854, Message Object  Data Register High */
#define CAN_MO194_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A854u)

/** Alias (User Manual Name) for CAN_MO194_EDATA5.
* To use register names with standard convension, please use CAN_MO194_EDATA5.
*/
#define	CAN_EMO194DATA5	(CAN_MO194_EDATA5)

/** \brief  2858, Message Object  Arbitration Register */
#define CAN_MO194_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A858u)

/** Alias (User Manual Name) for CAN_MO194_EDATA6.
* To use register names with standard convension, please use CAN_MO194_EDATA6.
*/
#define	CAN_EMO194DATA6	(CAN_MO194_EDATA6)

