luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2840, Message Object  Function Control Register */
#define CAN_MO194_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A840u)

/** Alias (User Manual Name) for CAN_MO194_FCR.
* To use register names with standard convension, please use CAN_MO194_FCR.
*/
#define	CAN_MOFCR194	(CAN_MO194_FCR)

/** \brief  2844, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO194_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A844u)

/** Alias (User Manual Name) for CAN_MO194_FGPR.
* To use register names with standard convension, please use CAN_MO194_FGPR.
*/
#define	CAN_MOFGPR194	(CAN_MO194_FGPR)

/** \brief  2848, Message Object  Interrupt Pointer Register */
#define CAN_MO194_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A848u)

/** Alias (User Manual Name) for CAN_MO194_IPR.
* To use register names with standard convension, please use CAN_MO194_IPR.
*/
#define	CAN_MOIPR194	(CAN_MO194_IPR)

/** \brief  285C, Message Object  Control Register */
#define CAN_MO194_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A85Cu)

/** Alias (User Manual Name) for CAN_MO194_STAT.
* To use register names with standard convension, please use CAN_MO194_STAT.
*/
#define	CAN_MOSTAT194	(CAN_MO194_STAT)

/** \brief  286C, Message Object  Acceptance Mask Register */
#define CAN_MO195_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A86Cu)

/** Alias (User Manual Name) for CAN_MO195_AMR.
* To use register names with standard convension, please use CAN_MO195_AMR.
*/
#define	CAN_MOAMR195	(CAN_MO195_AMR)

/** \brief  2878, Message Object  Arbitration Register */
#define CAN_MO195_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A878u)

/** Alias (User Manual Name) for CAN_MO195_AR.
* To use register names with standard convension, please use CAN_MO195_AR.
*/
#define	CAN_MOAR195	(CAN_MO195_AR)

/** \brief  287C, Message Object  Control Register */
#define CAN_MO195_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A87Cu)

/** Alias (User Manual Name) for CAN_MO195_CTR.
* To use register names with standard convension, please use CAN_MO195_CTR.
*/
#define	CAN_MOCTR195	(CAN_MO195_CTR)

/** \brief  2874, Message Object  Data Register High */
#define CAN_MO195_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A874u)

/** Alias (User Manual Name) for CAN_MO195_DATAH.
* To use register names with standard convension, please use CAN_MO195_DATAH.
*/
#define	CAN_MODATAH195	(CAN_MO195_DATAH)

/** \brief  2870, Message Object  Data Register Low */
#define CAN_MO195_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A870u)

/** Alias (User Manual Name) for CAN_MO195_DATAL.
* To use register names with standard convension, please use CAN_MO195_DATAL.
*/
#define	CAN_MODATAL195	(CAN_MO195_DATAL)

/** \brief  2860, Message Object  Function Control Register */
#define CAN_MO195_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A860u)

/** Alias (User Manual Name) for CAN_MO195_EDATA0.
* To use register names with standard convension, please use CAN_MO195_EDATA0.
*/
#define	CAN_EMO195DATA0	(CAN_MO195_EDATA0)

/** \brief  2864, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO195_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A864u)

/** Alias (User Manual Name) for CAN_MO195_EDATA1.
* To use register names with standard convension, please use CAN_MO195_EDATA1.
*/
#define	CAN_EMO195DATA1	(CAN_MO195_EDATA1)

/** \brief  2868, Message Object  Interrupt Pointer Register */
#define CAN_MO195_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A868u)

/** Alias (User Manual Name) for CAN_MO195_EDATA2.
* To use register names with standard convension, please use CAN_MO195_EDATA2.
*/
#define	CAN_EMO195DATA2	(CAN_MO195_EDATA2)

/** \brief  286C, Message Object  Acceptance Mask Register */
#define CAN_MO195_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A86Cu)

/** Alias (User Manual Name) for CAN_MO195_EDATA3.
* To use register names with standard convension, please use CAN_MO195_EDATA3.
*/
#define	CAN_EMO195DATA3	(CAN_MO195_EDATA3)

/** \brief  2870, Message Object  Data Register Low */
#define CAN_MO195_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A870u)

/** Alias (User Manual Name) for CAN_MO195_EDATA4.
* To use register names with standard convension, please use CAN_MO195_EDATA4.
*/
#define	CAN_EMO195DATA4	(CAN_MO195_EDATA4)

/** \brief  2874, Message Object  Data Register High */
#define CAN_MO195_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A874u)

/** Alias (User Manual Name) for CAN_MO195_EDATA5.
* To use register names with standard convension, please use CAN_MO195_EDATA5.
*/
#define	CAN_EMO195DATA5	(CAN_MO195_EDATA5)

/** \brief  2878, Message Object  Arbitration Register */
#define CAN_MO195_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A878u)

/** Alias (User Manual Name) for CAN_MO195_EDATA6.
* To use register names with standard convension, please use CAN_MO195_EDATA6.
*/
#define	CAN_EMO195DATA6	(CAN_MO195_EDATA6)

/** \brief  2860, Message Object  Function Control Register */
#define CAN_MO195_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A860u)

/** Alias (User Manual Name) for CAN_MO195_FCR.
* To use register names with standard convension, please use CAN_MO195_FCR.
*/
#define	CAN_MOFCR195	(CAN_MO195_FCR)

/** \brief  2864, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO195_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A864u)

/** Alias (User Manual Name) for CAN_MO195_FGPR.
* To use register names with standard convension, please use CAN_MO195_FGPR.
*/
#define	CAN_MOFGPR195	(CAN_MO195_FGPR)

/** \brief  2868, Message Object  Interrupt Pointer Register */
#define CAN_MO195_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A868u)

/** Alias (User Manual Name) for CAN_MO195_IPR.
* To use register names with standard convension, please use CAN_MO195_IPR.
*/
#define	CAN_MOIPR195	(CAN_MO195_IPR)

