luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  287C, Message Object  Control Register */
#define CAN_MO195_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A87Cu)

/** Alias (User Manual Name) for CAN_MO195_STAT.
* To use register names with standard convension, please use CAN_MO195_STAT.
*/
#define	CAN_MOSTAT195	(CAN_MO195_STAT)

/** \brief  288C, Message Object  Acceptance Mask Register */
#define CAN_MO196_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A88Cu)

/** Alias (User Manual Name) for CAN_MO196_AMR.
* To use register names with standard convension, please use CAN_MO196_AMR.
*/
#define	CAN_MOAMR196	(CAN_MO196_AMR)

/** \brief  2898, Message Object  Arbitration Register */
#define CAN_MO196_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A898u)

/** Alias (User Manual Name) for CAN_MO196_AR.
* To use register names with standard convension, please use CAN_MO196_AR.
*/
#define	CAN_MOAR196	(CAN_MO196_AR)

/** \brief  289C, Message Object  Control Register */
#define CAN_MO196_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A89Cu)

/** Alias (User Manual Name) for CAN_MO196_CTR.
* To use register names with standard convension, please use CAN_MO196_CTR.
*/
#define	CAN_MOCTR196	(CAN_MO196_CTR)

/** \brief  2894, Message Object  Data Register High */
#define CAN_MO196_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A894u)

/** Alias (User Manual Name) for CAN_MO196_DATAH.
* To use register names with standard convension, please use CAN_MO196_DATAH.
*/
#define	CAN_MODATAH196	(CAN_MO196_DATAH)

/** \brief  2890, Message Object  Data Register Low */
#define CAN_MO196_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A890u)

/** Alias (User Manual Name) for CAN_MO196_DATAL.
* To use register names with standard convension, please use CAN_MO196_DATAL.
*/
#define	CAN_MODATAL196	(CAN_MO196_DATAL)

/** \brief  2880, Message Object  Function Control Register */
#define CAN_MO196_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A880u)

/** Alias (User Manual Name) for CAN_MO196_EDATA0.
* To use register names with standard convension, please use CAN_MO196_EDATA0.
*/
#define	CAN_EMO196DATA0	(CAN_MO196_EDATA0)

/** \brief  2884, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO196_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A884u)

/** Alias (User Manual Name) for CAN_MO196_EDATA1.
* To use register names with standard convension, please use CAN_MO196_EDATA1.
*/
#define	CAN_EMO196DATA1	(CAN_MO196_EDATA1)

/** \brief  2888, Message Object  Interrupt Pointer Register */
#define CAN_MO196_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A888u)

/** Alias (User Manual Name) for CAN_MO196_EDATA2.
* To use register names with standard convension, please use CAN_MO196_EDATA2.
*/
#define	CAN_EMO196DATA2	(CAN_MO196_EDATA2)

/** \brief  288C, Message Object  Acceptance Mask Register */
#define CAN_MO196_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A88Cu)

/** Alias (User Manual Name) for CAN_MO196_EDATA3.
* To use register names with standard convension, please use CAN_MO196_EDATA3.
*/
#define	CAN_EMO196DATA3	(CAN_MO196_EDATA3)

/** \brief  2890, Message Object  Data Register Low */
#define CAN_MO196_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A890u)

/** Alias (User Manual Name) for CAN_MO196_EDATA4.
* To use register names with standard convension, please use CAN_MO196_EDATA4.
*/
#define	CAN_EMO196DATA4	(CAN_MO196_EDATA4)

/** \brief  2894, Message Object  Data Register High */
#define CAN_MO196_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A894u)

/** Alias (User Manual Name) for CAN_MO196_EDATA5.
* To use register names with standard convension, please use CAN_MO196_EDATA5.
*/
#define	CAN_EMO196DATA5	(CAN_MO196_EDATA5)

/** \brief  2898, Message Object  Arbitration Register */
#define CAN_MO196_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A898u)

/** Alias (User Manual Name) for CAN_MO196_EDATA6.
* To use register names with standard convension, please use CAN_MO196_EDATA6.
*/
#define	CAN_EMO196DATA6	(CAN_MO196_EDATA6)

/** \brief  2880, Message Object  Function Control Register */
#define CAN_MO196_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A880u)

/** Alias (User Manual Name) for CAN_MO196_FCR.
* To use register names with standard convension, please use CAN_MO196_FCR.
*/
#define	CAN_MOFCR196	(CAN_MO196_FCR)

/** \brief  2884, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO196_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A884u)

/** Alias (User Manual Name) for CAN_MO196_FGPR.
* To use register names with standard convension, please use CAN_MO196_FGPR.
*/
#define	CAN_MOFGPR196	(CAN_MO196_FGPR)

/** \brief  2888, Message Object  Interrupt Pointer Register */
#define CAN_MO196_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A888u)

/** Alias (User Manual Name) for CAN_MO196_IPR.
* To use register names with standard convension, please use CAN_MO196_IPR.
*/
#define	CAN_MOIPR196	(CAN_MO196_IPR)

/** \brief  289C, Message Object  Control Register */
#define CAN_MO196_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A89Cu)

/** Alias (User Manual Name) for CAN_MO196_STAT.
* To use register names with standard convension, please use CAN_MO196_STAT.
*/
#define	CAN_MOSTAT196	(CAN_MO196_STAT)

/** \brief  28AC, Message Object  Acceptance Mask Register */
#define CAN_MO197_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A8ACu)

/** Alias (User Manual Name) for CAN_MO197_AMR.
* To use register names with standard convension, please use CAN_MO197_AMR.
*/
#define	CAN_MOAMR197	(CAN_MO197_AMR)

/** \brief  28B8, Message Object  Arbitration Register */
#define CAN_MO197_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A8B8u)

/** Alias (User Manual Name) for CAN_MO197_AR.
* To use register names with standard convension, please use CAN_MO197_AR.
*/
#define	CAN_MOAR197	(CAN_MO197_AR)

/** \brief  28BC, Message Object  Control Register */
#define CAN_MO197_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A8BCu)

