luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO197_CTR.
* To use register names with standard convension, please use CAN_MO197_CTR.
*/
#define	CAN_MOCTR197	(CAN_MO197_CTR)

/** \brief  28B4, Message Object  Data Register High */
#define CAN_MO197_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A8B4u)

/** Alias (User Manual Name) for CAN_MO197_DATAH.
* To use register names with standard convension, please use CAN_MO197_DATAH.
*/
#define	CAN_MODATAH197	(CAN_MO197_DATAH)

/** \brief  28B0, Message Object  Data Register Low */
#define CAN_MO197_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A8B0u)

/** Alias (User Manual Name) for CAN_MO197_DATAL.
* To use register names with standard convension, please use CAN_MO197_DATAL.
*/
#define	CAN_MODATAL197	(CAN_MO197_DATAL)

/** \brief  28A0, Message Object  Function Control Register */
#define CAN_MO197_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A8A0u)

/** Alias (User Manual Name) for CAN_MO197_EDATA0.
* To use register names with standard convension, please use CAN_MO197_EDATA0.
*/
#define	CAN_EMO197DATA0	(CAN_MO197_EDATA0)

/** \brief  28A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO197_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A8A4u)

/** Alias (User Manual Name) for CAN_MO197_EDATA1.
* To use register names with standard convension, please use CAN_MO197_EDATA1.
*/
#define	CAN_EMO197DATA1	(CAN_MO197_EDATA1)

/** \brief  28A8, Message Object  Interrupt Pointer Register */
#define CAN_MO197_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A8A8u)

/** Alias (User Manual Name) for CAN_MO197_EDATA2.
* To use register names with standard convension, please use CAN_MO197_EDATA2.
*/
#define	CAN_EMO197DATA2	(CAN_MO197_EDATA2)

/** \brief  28AC, Message Object  Acceptance Mask Register */
#define CAN_MO197_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A8ACu)

/** Alias (User Manual Name) for CAN_MO197_EDATA3.
* To use register names with standard convension, please use CAN_MO197_EDATA3.
*/
#define	CAN_EMO197DATA3	(CAN_MO197_EDATA3)

/** \brief  28B0, Message Object  Data Register Low */
#define CAN_MO197_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A8B0u)

/** Alias (User Manual Name) for CAN_MO197_EDATA4.
* To use register names with standard convension, please use CAN_MO197_EDATA4.
*/
#define	CAN_EMO197DATA4	(CAN_MO197_EDATA4)

/** \brief  28B4, Message Object  Data Register High */
#define CAN_MO197_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A8B4u)

/** Alias (User Manual Name) for CAN_MO197_EDATA5.
* To use register names with standard convension, please use CAN_MO197_EDATA5.
*/
#define	CAN_EMO197DATA5	(CAN_MO197_EDATA5)

/** \brief  28B8, Message Object  Arbitration Register */
#define CAN_MO197_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A8B8u)

/** Alias (User Manual Name) for CAN_MO197_EDATA6.
* To use register names with standard convension, please use CAN_MO197_EDATA6.
*/
#define	CAN_EMO197DATA6	(CAN_MO197_EDATA6)

/** \brief  28A0, Message Object  Function Control Register */
#define CAN_MO197_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A8A0u)

/** Alias (User Manual Name) for CAN_MO197_FCR.
* To use register names with standard convension, please use CAN_MO197_FCR.
*/
#define	CAN_MOFCR197	(CAN_MO197_FCR)

/** \brief  28A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO197_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A8A4u)

/** Alias (User Manual Name) for CAN_MO197_FGPR.
* To use register names with standard convension, please use CAN_MO197_FGPR.
*/
#define	CAN_MOFGPR197	(CAN_MO197_FGPR)

/** \brief  28A8, Message Object  Interrupt Pointer Register */
#define CAN_MO197_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A8A8u)

/** Alias (User Manual Name) for CAN_MO197_IPR.
* To use register names with standard convension, please use CAN_MO197_IPR.
*/
#define	CAN_MOIPR197	(CAN_MO197_IPR)

/** \brief  28BC, Message Object  Control Register */
#define CAN_MO197_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A8BCu)

/** Alias (User Manual Name) for CAN_MO197_STAT.
* To use register names with standard convension, please use CAN_MO197_STAT.
*/
#define	CAN_MOSTAT197	(CAN_MO197_STAT)

/** \brief  28CC, Message Object  Acceptance Mask Register */
#define CAN_MO198_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A8CCu)

/** Alias (User Manual Name) for CAN_MO198_AMR.
* To use register names with standard convension, please use CAN_MO198_AMR.
*/
#define	CAN_MOAMR198	(CAN_MO198_AMR)

/** \brief  28D8, Message Object  Arbitration Register */
#define CAN_MO198_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A8D8u)

/** Alias (User Manual Name) for CAN_MO198_AR.
* To use register names with standard convension, please use CAN_MO198_AR.
*/
#define	CAN_MOAR198	(CAN_MO198_AR)

/** \brief  28DC, Message Object  Control Register */
#define CAN_MO198_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A8DCu)

/** Alias (User Manual Name) for CAN_MO198_CTR.
* To use register names with standard convension, please use CAN_MO198_CTR.
*/
#define	CAN_MOCTR198	(CAN_MO198_CTR)

/** \brief  28D4, Message Object  Data Register High */
#define CAN_MO198_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A8D4u)

/** Alias (User Manual Name) for CAN_MO198_DATAH.
* To use register names with standard convension, please use CAN_MO198_DATAH.
*/
#define	CAN_MODATAH198	(CAN_MO198_DATAH)

/** \brief  28D0, Message Object  Data Register Low */
#define CAN_MO198_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A8D0u)

/** Alias (User Manual Name) for CAN_MO198_DATAL.
* To use register names with standard convension, please use CAN_MO198_DATAL.
*/
#define	CAN_MODATAL198	(CAN_MO198_DATAL)

/** \brief  28C0, Message Object  Function Control Register */
#define CAN_MO198_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A8C0u)

