luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO198_EDATA0.
* To use register names with standard convension, please use CAN_MO198_EDATA0.
*/
#define	CAN_EMO198DATA0	(CAN_MO198_EDATA0)

/** \brief  28C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO198_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A8C4u)

/** Alias (User Manual Name) for CAN_MO198_EDATA1.
* To use register names with standard convension, please use CAN_MO198_EDATA1.
*/
#define	CAN_EMO198DATA1	(CAN_MO198_EDATA1)

/** \brief  28C8, Message Object  Interrupt Pointer Register */
#define CAN_MO198_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A8C8u)

/** Alias (User Manual Name) for CAN_MO198_EDATA2.
* To use register names with standard convension, please use CAN_MO198_EDATA2.
*/
#define	CAN_EMO198DATA2	(CAN_MO198_EDATA2)

/** \brief  28CC, Message Object  Acceptance Mask Register */
#define CAN_MO198_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A8CCu)

/** Alias (User Manual Name) for CAN_MO198_EDATA3.
* To use register names with standard convension, please use CAN_MO198_EDATA3.
*/
#define	CAN_EMO198DATA3	(CAN_MO198_EDATA3)

/** \brief  28D0, Message Object  Data Register Low */
#define CAN_MO198_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A8D0u)

/** Alias (User Manual Name) for CAN_MO198_EDATA4.
* To use register names with standard convension, please use CAN_MO198_EDATA4.
*/
#define	CAN_EMO198DATA4	(CAN_MO198_EDATA4)

/** \brief  28D4, Message Object  Data Register High */
#define CAN_MO198_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A8D4u)

/** Alias (User Manual Name) for CAN_MO198_EDATA5.
* To use register names with standard convension, please use CAN_MO198_EDATA5.
*/
#define	CAN_EMO198DATA5	(CAN_MO198_EDATA5)

/** \brief  28D8, Message Object  Arbitration Register */
#define CAN_MO198_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A8D8u)

/** Alias (User Manual Name) for CAN_MO198_EDATA6.
* To use register names with standard convension, please use CAN_MO198_EDATA6.
*/
#define	CAN_EMO198DATA6	(CAN_MO198_EDATA6)

/** \brief  28C0, Message Object  Function Control Register */
#define CAN_MO198_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A8C0u)

/** Alias (User Manual Name) for CAN_MO198_FCR.
* To use register names with standard convension, please use CAN_MO198_FCR.
*/
#define	CAN_MOFCR198	(CAN_MO198_FCR)

/** \brief  28C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO198_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A8C4u)

/** Alias (User Manual Name) for CAN_MO198_FGPR.
* To use register names with standard convension, please use CAN_MO198_FGPR.
*/
#define	CAN_MOFGPR198	(CAN_MO198_FGPR)

/** \brief  28C8, Message Object  Interrupt Pointer Register */
#define CAN_MO198_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A8C8u)

/** Alias (User Manual Name) for CAN_MO198_IPR.
* To use register names with standard convension, please use CAN_MO198_IPR.
*/
#define	CAN_MOIPR198	(CAN_MO198_IPR)

/** \brief  28DC, Message Object  Control Register */
#define CAN_MO198_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A8DCu)

/** Alias (User Manual Name) for CAN_MO198_STAT.
* To use register names with standard convension, please use CAN_MO198_STAT.
*/
#define	CAN_MOSTAT198	(CAN_MO198_STAT)

/** \brief  28EC, Message Object  Acceptance Mask Register */
#define CAN_MO199_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A8ECu)

/** Alias (User Manual Name) for CAN_MO199_AMR.
* To use register names with standard convension, please use CAN_MO199_AMR.
*/
#define	CAN_MOAMR199	(CAN_MO199_AMR)

/** \brief  28F8, Message Object  Arbitration Register */
#define CAN_MO199_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A8F8u)

/** Alias (User Manual Name) for CAN_MO199_AR.
* To use register names with standard convension, please use CAN_MO199_AR.
*/
#define	CAN_MOAR199	(CAN_MO199_AR)

/** \brief  28FC, Message Object  Control Register */
#define CAN_MO199_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A8FCu)

/** Alias (User Manual Name) for CAN_MO199_CTR.
* To use register names with standard convension, please use CAN_MO199_CTR.
*/
#define	CAN_MOCTR199	(CAN_MO199_CTR)

/** \brief  28F4, Message Object  Data Register High */
#define CAN_MO199_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A8F4u)

/** Alias (User Manual Name) for CAN_MO199_DATAH.
* To use register names with standard convension, please use CAN_MO199_DATAH.
*/
#define	CAN_MODATAH199	(CAN_MO199_DATAH)

/** \brief  28F0, Message Object  Data Register Low */
#define CAN_MO199_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A8F0u)

/** Alias (User Manual Name) for CAN_MO199_DATAL.
* To use register names with standard convension, please use CAN_MO199_DATAL.
*/
#define	CAN_MODATAL199	(CAN_MO199_DATAL)

/** \brief  28E0, Message Object  Function Control Register */
#define CAN_MO199_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A8E0u)

/** Alias (User Manual Name) for CAN_MO199_EDATA0.
* To use register names with standard convension, please use CAN_MO199_EDATA0.
*/
#define	CAN_EMO199DATA0	(CAN_MO199_EDATA0)

/** \brief  28E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO199_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A8E4u)

/** Alias (User Manual Name) for CAN_MO199_EDATA1.
* To use register names with standard convension, please use CAN_MO199_EDATA1.
*/
#define	CAN_EMO199DATA1	(CAN_MO199_EDATA1)

/** \brief  28E8, Message Object  Interrupt Pointer Register */
#define CAN_MO199_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A8E8u)

/** Alias (User Manual Name) for CAN_MO199_EDATA2.
* To use register names with standard convension, please use CAN_MO199_EDATA2.
*/
#define	CAN_EMO199DATA2	(CAN_MO199_EDATA2)

/** \brief  28EC, Message Object  Acceptance Mask Register */
#define CAN_MO199_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A8ECu)

