luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO199_EDATA3.
* To use register names with standard convension, please use CAN_MO199_EDATA3.
*/
#define	CAN_EMO199DATA3	(CAN_MO199_EDATA3)

/** \brief  28F0, Message Object  Data Register Low */
#define CAN_MO199_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A8F0u)

/** Alias (User Manual Name) for CAN_MO199_EDATA4.
* To use register names with standard convension, please use CAN_MO199_EDATA4.
*/
#define	CAN_EMO199DATA4	(CAN_MO199_EDATA4)

/** \brief  28F4, Message Object  Data Register High */
#define CAN_MO199_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A8F4u)

/** Alias (User Manual Name) for CAN_MO199_EDATA5.
* To use register names with standard convension, please use CAN_MO199_EDATA5.
*/
#define	CAN_EMO199DATA5	(CAN_MO199_EDATA5)

/** \brief  28F8, Message Object  Arbitration Register */
#define CAN_MO199_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A8F8u)

/** Alias (User Manual Name) for CAN_MO199_EDATA6.
* To use register names with standard convension, please use CAN_MO199_EDATA6.
*/
#define	CAN_EMO199DATA6	(CAN_MO199_EDATA6)

/** \brief  28E0, Message Object  Function Control Register */
#define CAN_MO199_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A8E0u)

/** Alias (User Manual Name) for CAN_MO199_FCR.
* To use register names with standard convension, please use CAN_MO199_FCR.
*/
#define	CAN_MOFCR199	(CAN_MO199_FCR)

/** \brief  28E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO199_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A8E4u)

/** Alias (User Manual Name) for CAN_MO199_FGPR.
* To use register names with standard convension, please use CAN_MO199_FGPR.
*/
#define	CAN_MOFGPR199	(CAN_MO199_FGPR)

/** \brief  28E8, Message Object  Interrupt Pointer Register */
#define CAN_MO199_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A8E8u)

/** Alias (User Manual Name) for CAN_MO199_IPR.
* To use register names with standard convension, please use CAN_MO199_IPR.
*/
#define	CAN_MOIPR199	(CAN_MO199_IPR)

/** \brief  28FC, Message Object  Control Register */
#define CAN_MO199_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A8FCu)

/** Alias (User Manual Name) for CAN_MO199_STAT.
* To use register names with standard convension, please use CAN_MO199_STAT.
*/
#define	CAN_MOSTAT199	(CAN_MO199_STAT)

/** \brief  126C, Message Object  Acceptance Mask Register */
#define CAN_MO19_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001926Cu)

/** Alias (User Manual Name) for CAN_MO19_AMR.
* To use register names with standard convension, please use CAN_MO19_AMR.
*/
#define	CAN_MOAMR19	(CAN_MO19_AMR)

/** \brief  1278, Message Object  Arbitration Register */
#define CAN_MO19_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019278u)

/** Alias (User Manual Name) for CAN_MO19_AR.
* To use register names with standard convension, please use CAN_MO19_AR.
*/
#define	CAN_MOAR19	(CAN_MO19_AR)

/** \brief  127C, Message Object  Control Register */
#define CAN_MO19_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001927Cu)

/** Alias (User Manual Name) for CAN_MO19_CTR.
* To use register names with standard convension, please use CAN_MO19_CTR.
*/
#define	CAN_MOCTR19	(CAN_MO19_CTR)

/** \brief  1274, Message Object  Data Register High */
#define CAN_MO19_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019274u)

/** Alias (User Manual Name) for CAN_MO19_DATAH.
* To use register names with standard convension, please use CAN_MO19_DATAH.
*/
#define	CAN_MODATAH19	(CAN_MO19_DATAH)

/** \brief  1270, Message Object  Data Register Low */
#define CAN_MO19_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019270u)

/** Alias (User Manual Name) for CAN_MO19_DATAL.
* To use register names with standard convension, please use CAN_MO19_DATAL.
*/
#define	CAN_MODATAL19	(CAN_MO19_DATAL)

/** \brief  1260, Message Object  Function Control Register */
#define CAN_MO19_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019260u)

/** Alias (User Manual Name) for CAN_MO19_EDATA0.
* To use register names with standard convension, please use CAN_MO19_EDATA0.
*/
#define	CAN_EMO19DATA0	(CAN_MO19_EDATA0)

/** \brief  1264, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO19_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019264u)

/** Alias (User Manual Name) for CAN_MO19_EDATA1.
* To use register names with standard convension, please use CAN_MO19_EDATA1.
*/
#define	CAN_EMO19DATA1	(CAN_MO19_EDATA1)

/** \brief  1268, Message Object  Interrupt Pointer Register */
#define CAN_MO19_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019268u)

/** Alias (User Manual Name) for CAN_MO19_EDATA2.
* To use register names with standard convension, please use CAN_MO19_EDATA2.
*/
#define	CAN_EMO19DATA2	(CAN_MO19_EDATA2)

/** \brief  126C, Message Object  Acceptance Mask Register */
#define CAN_MO19_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001926Cu)

/** Alias (User Manual Name) for CAN_MO19_EDATA3.
* To use register names with standard convension, please use CAN_MO19_EDATA3.
*/
#define	CAN_EMO19DATA3	(CAN_MO19_EDATA3)

/** \brief  1270, Message Object  Data Register Low */
#define CAN_MO19_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019270u)

/** Alias (User Manual Name) for CAN_MO19_EDATA4.
* To use register names with standard convension, please use CAN_MO19_EDATA4.
*/
#define	CAN_EMO19DATA4	(CAN_MO19_EDATA4)

/** \brief  1274, Message Object  Data Register High */
#define CAN_MO19_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019274u)

/** Alias (User Manual Name) for CAN_MO19_EDATA5.
* To use register names with standard convension, please use CAN_MO19_EDATA5.
*/
#define	CAN_EMO19DATA5	(CAN_MO19_EDATA5)

/** \brief  1278, Message Object  Arbitration Register */
#define CAN_MO19_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019278u)

/** Alias (User Manual Name) for CAN_MO19_EDATA6.
* To use register names with standard convension, please use CAN_MO19_EDATA6.
*/
#define	CAN_EMO19DATA6	(CAN_MO19_EDATA6)

/** \brief  1260, Message Object  Function Control Register */
#define CAN_MO19_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019260u)

/** Alias (User Manual Name) for CAN_MO19_FCR.
* To use register names with standard convension, please use CAN_MO19_FCR.
*/
#define	CAN_MOFCR19	(CAN_MO19_FCR)

