luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2918, Message Object  Arbitration Register */
#define CAN_MO200_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A918u)

/** Alias (User Manual Name) for CAN_MO200_AR.
* To use register names with standard convension, please use CAN_MO200_AR.
*/
#define	CAN_MOAR200	(CAN_MO200_AR)

/** \brief  291C, Message Object  Control Register */
#define CAN_MO200_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A91Cu)

/** Alias (User Manual Name) for CAN_MO200_CTR.
* To use register names with standard convension, please use CAN_MO200_CTR.
*/
#define	CAN_MOCTR200	(CAN_MO200_CTR)

/** \brief  2914, Message Object  Data Register High */
#define CAN_MO200_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A914u)

/** Alias (User Manual Name) for CAN_MO200_DATAH.
* To use register names with standard convension, please use CAN_MO200_DATAH.
*/
#define	CAN_MODATAH200	(CAN_MO200_DATAH)

/** \brief  2910, Message Object  Data Register Low */
#define CAN_MO200_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A910u)

/** Alias (User Manual Name) for CAN_MO200_DATAL.
* To use register names with standard convension, please use CAN_MO200_DATAL.
*/
#define	CAN_MODATAL200	(CAN_MO200_DATAL)

/** \brief  2900, Message Object  Function Control Register */
#define CAN_MO200_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A900u)

/** Alias (User Manual Name) for CAN_MO200_EDATA0.
* To use register names with standard convension, please use CAN_MO200_EDATA0.
*/
#define	CAN_EMO200DATA0	(CAN_MO200_EDATA0)

/** \brief  2904, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO200_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A904u)

/** Alias (User Manual Name) for CAN_MO200_EDATA1.
* To use register names with standard convension, please use CAN_MO200_EDATA1.
*/
#define	CAN_EMO200DATA1	(CAN_MO200_EDATA1)

/** \brief  2908, Message Object  Interrupt Pointer Register */
#define CAN_MO200_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A908u)

/** Alias (User Manual Name) for CAN_MO200_EDATA2.
* To use register names with standard convension, please use CAN_MO200_EDATA2.
*/
#define	CAN_EMO200DATA2	(CAN_MO200_EDATA2)

/** \brief  290C, Message Object  Acceptance Mask Register */
#define CAN_MO200_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A90Cu)

/** Alias (User Manual Name) for CAN_MO200_EDATA3.
* To use register names with standard convension, please use CAN_MO200_EDATA3.
*/
#define	CAN_EMO200DATA3	(CAN_MO200_EDATA3)

/** \brief  2910, Message Object  Data Register Low */
#define CAN_MO200_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A910u)

/** Alias (User Manual Name) for CAN_MO200_EDATA4.
* To use register names with standard convension, please use CAN_MO200_EDATA4.
*/
#define	CAN_EMO200DATA4	(CAN_MO200_EDATA4)

/** \brief  2914, Message Object  Data Register High */
#define CAN_MO200_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A914u)

/** Alias (User Manual Name) for CAN_MO200_EDATA5.
* To use register names with standard convension, please use CAN_MO200_EDATA5.
*/
#define	CAN_EMO200DATA5	(CAN_MO200_EDATA5)

/** \brief  2918, Message Object  Arbitration Register */
#define CAN_MO200_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A918u)

/** Alias (User Manual Name) for CAN_MO200_EDATA6.
* To use register names with standard convension, please use CAN_MO200_EDATA6.
*/
#define	CAN_EMO200DATA6	(CAN_MO200_EDATA6)

/** \brief  2900, Message Object  Function Control Register */
#define CAN_MO200_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A900u)

/** Alias (User Manual Name) for CAN_MO200_FCR.
* To use register names with standard convension, please use CAN_MO200_FCR.
*/
#define	CAN_MOFCR200	(CAN_MO200_FCR)

/** \brief  2904, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO200_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A904u)

/** Alias (User Manual Name) for CAN_MO200_FGPR.
* To use register names with standard convension, please use CAN_MO200_FGPR.
*/
#define	CAN_MOFGPR200	(CAN_MO200_FGPR)

/** \brief  2908, Message Object  Interrupt Pointer Register */
#define CAN_MO200_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A908u)

/** Alias (User Manual Name) for CAN_MO200_IPR.
* To use register names with standard convension, please use CAN_MO200_IPR.
*/
#define	CAN_MOIPR200	(CAN_MO200_IPR)

/** \brief  291C, Message Object  Control Register */
#define CAN_MO200_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A91Cu)

/** Alias (User Manual Name) for CAN_MO200_STAT.
* To use register names with standard convension, please use CAN_MO200_STAT.
*/
#define	CAN_MOSTAT200	(CAN_MO200_STAT)

/** \brief  292C, Message Object  Acceptance Mask Register */
#define CAN_MO201_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A92Cu)

/** Alias (User Manual Name) for CAN_MO201_AMR.
* To use register names with standard convension, please use CAN_MO201_AMR.
*/
#define	CAN_MOAMR201	(CAN_MO201_AMR)

/** \brief  2938, Message Object  Arbitration Register */
#define CAN_MO201_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A938u)

/** Alias (User Manual Name) for CAN_MO201_AR.
* To use register names with standard convension, please use CAN_MO201_AR.
*/
#define	CAN_MOAR201	(CAN_MO201_AR)

/** \brief  293C, Message Object  Control Register */
#define CAN_MO201_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A93Cu)

/** Alias (User Manual Name) for CAN_MO201_CTR.
* To use register names with standard convension, please use CAN_MO201_CTR.
*/
#define	CAN_MOCTR201	(CAN_MO201_CTR)

/** \brief  2934, Message Object  Data Register High */
#define CAN_MO201_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A934u)

/** Alias (User Manual Name) for CAN_MO201_DATAH.
* To use register names with standard convension, please use CAN_MO201_DATAH.
*/
#define	CAN_MODATAH201	(CAN_MO201_DATAH)

/** \brief  2930, Message Object  Data Register Low */
#define CAN_MO201_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A930u)

/** Alias (User Manual Name) for CAN_MO201_DATAL.
* To use register names with standard convension, please use CAN_MO201_DATAL.
*/
#define	CAN_MODATAL201	(CAN_MO201_DATAL)

/** \brief  2920, Message Object  Function Control Register */
#define CAN_MO201_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A920u)

