luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO201_EDATA0.
* To use register names with standard convension, please use CAN_MO201_EDATA0.
*/
#define	CAN_EMO201DATA0	(CAN_MO201_EDATA0)

/** \brief  2924, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO201_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A924u)

/** Alias (User Manual Name) for CAN_MO201_EDATA1.
* To use register names with standard convension, please use CAN_MO201_EDATA1.
*/
#define	CAN_EMO201DATA1	(CAN_MO201_EDATA1)

/** \brief  2928, Message Object  Interrupt Pointer Register */
#define CAN_MO201_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A928u)

/** Alias (User Manual Name) for CAN_MO201_EDATA2.
* To use register names with standard convension, please use CAN_MO201_EDATA2.
*/
#define	CAN_EMO201DATA2	(CAN_MO201_EDATA2)

/** \brief  292C, Message Object  Acceptance Mask Register */
#define CAN_MO201_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A92Cu)

/** Alias (User Manual Name) for CAN_MO201_EDATA3.
* To use register names with standard convension, please use CAN_MO201_EDATA3.
*/
#define	CAN_EMO201DATA3	(CAN_MO201_EDATA3)

/** \brief  2930, Message Object  Data Register Low */
#define CAN_MO201_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A930u)

/** Alias (User Manual Name) for CAN_MO201_EDATA4.
* To use register names with standard convension, please use CAN_MO201_EDATA4.
*/
#define	CAN_EMO201DATA4	(CAN_MO201_EDATA4)

/** \brief  2934, Message Object  Data Register High */
#define CAN_MO201_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A934u)

/** Alias (User Manual Name) for CAN_MO201_EDATA5.
* To use register names with standard convension, please use CAN_MO201_EDATA5.
*/
#define	CAN_EMO201DATA5	(CAN_MO201_EDATA5)

/** \brief  2938, Message Object  Arbitration Register */
#define CAN_MO201_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A938u)

/** Alias (User Manual Name) for CAN_MO201_EDATA6.
* To use register names with standard convension, please use CAN_MO201_EDATA6.
*/
#define	CAN_EMO201DATA6	(CAN_MO201_EDATA6)

/** \brief  2920, Message Object  Function Control Register */
#define CAN_MO201_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A920u)

/** Alias (User Manual Name) for CAN_MO201_FCR.
* To use register names with standard convension, please use CAN_MO201_FCR.
*/
#define	CAN_MOFCR201	(CAN_MO201_FCR)

/** \brief  2924, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO201_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A924u)

/** Alias (User Manual Name) for CAN_MO201_FGPR.
* To use register names with standard convension, please use CAN_MO201_FGPR.
*/
#define	CAN_MOFGPR201	(CAN_MO201_FGPR)

/** \brief  2928, Message Object  Interrupt Pointer Register */
#define CAN_MO201_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A928u)

/** Alias (User Manual Name) for CAN_MO201_IPR.
* To use register names with standard convension, please use CAN_MO201_IPR.
*/
#define	CAN_MOIPR201	(CAN_MO201_IPR)

/** \brief  293C, Message Object  Control Register */
#define CAN_MO201_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A93Cu)

/** Alias (User Manual Name) for CAN_MO201_STAT.
* To use register names with standard convension, please use CAN_MO201_STAT.
*/
#define	CAN_MOSTAT201	(CAN_MO201_STAT)

/** \brief  294C, Message Object  Acceptance Mask Register */
#define CAN_MO202_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A94Cu)

/** Alias (User Manual Name) for CAN_MO202_AMR.
* To use register names with standard convension, please use CAN_MO202_AMR.
*/
#define	CAN_MOAMR202	(CAN_MO202_AMR)

/** \brief  2958, Message Object  Arbitration Register */
#define CAN_MO202_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A958u)

/** Alias (User Manual Name) for CAN_MO202_AR.
* To use register names with standard convension, please use CAN_MO202_AR.
*/
#define	CAN_MOAR202	(CAN_MO202_AR)

/** \brief  295C, Message Object  Control Register */
#define CAN_MO202_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A95Cu)

/** Alias (User Manual Name) for CAN_MO202_CTR.
* To use register names with standard convension, please use CAN_MO202_CTR.
*/
#define	CAN_MOCTR202	(CAN_MO202_CTR)

/** \brief  2954, Message Object  Data Register High */
#define CAN_MO202_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A954u)

/** Alias (User Manual Name) for CAN_MO202_DATAH.
* To use register names with standard convension, please use CAN_MO202_DATAH.
*/
#define	CAN_MODATAH202	(CAN_MO202_DATAH)

/** \brief  2950, Message Object  Data Register Low */
#define CAN_MO202_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A950u)

/** Alias (User Manual Name) for CAN_MO202_DATAL.
* To use register names with standard convension, please use CAN_MO202_DATAL.
*/
#define	CAN_MODATAL202	(CAN_MO202_DATAL)

/** \brief  2940, Message Object  Function Control Register */
#define CAN_MO202_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A940u)

/** Alias (User Manual Name) for CAN_MO202_EDATA0.
* To use register names with standard convension, please use CAN_MO202_EDATA0.
*/
#define	CAN_EMO202DATA0	(CAN_MO202_EDATA0)

/** \brief  2944, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO202_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A944u)

/** Alias (User Manual Name) for CAN_MO202_EDATA1.
* To use register names with standard convension, please use CAN_MO202_EDATA1.
*/
#define	CAN_EMO202DATA1	(CAN_MO202_EDATA1)

/** \brief  2948, Message Object  Interrupt Pointer Register */
#define CAN_MO202_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A948u)

/** Alias (User Manual Name) for CAN_MO202_EDATA2.
* To use register names with standard convension, please use CAN_MO202_EDATA2.
*/
#define	CAN_EMO202DATA2	(CAN_MO202_EDATA2)

/** \brief  294C, Message Object  Acceptance Mask Register */
#define CAN_MO202_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A94Cu)

/** Alias (User Manual Name) for CAN_MO202_EDATA3.
* To use register names with standard convension, please use CAN_MO202_EDATA3.
*/
#define	CAN_EMO202DATA3	(CAN_MO202_EDATA3)

/** \brief  2950, Message Object  Data Register Low */
#define CAN_MO202_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A950u)

/** Alias (User Manual Name) for CAN_MO202_EDATA4.
* To use register names with standard convension, please use CAN_MO202_EDATA4.
*/
#define	CAN_EMO202DATA4	(CAN_MO202_EDATA4)

/** \brief  2954, Message Object  Data Register High */
#define CAN_MO202_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A954u)

