luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO202_EDATA5.
* To use register names with standard convension, please use CAN_MO202_EDATA5.
*/
#define	CAN_EMO202DATA5	(CAN_MO202_EDATA5)

/** \brief  2958, Message Object  Arbitration Register */
#define CAN_MO202_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A958u)

/** Alias (User Manual Name) for CAN_MO202_EDATA6.
* To use register names with standard convension, please use CAN_MO202_EDATA6.
*/
#define	CAN_EMO202DATA6	(CAN_MO202_EDATA6)

/** \brief  2940, Message Object  Function Control Register */
#define CAN_MO202_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A940u)

/** Alias (User Manual Name) for CAN_MO202_FCR.
* To use register names with standard convension, please use CAN_MO202_FCR.
*/
#define	CAN_MOFCR202	(CAN_MO202_FCR)

/** \brief  2944, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO202_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A944u)

/** Alias (User Manual Name) for CAN_MO202_FGPR.
* To use register names with standard convension, please use CAN_MO202_FGPR.
*/
#define	CAN_MOFGPR202	(CAN_MO202_FGPR)

/** \brief  2948, Message Object  Interrupt Pointer Register */
#define CAN_MO202_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A948u)

/** Alias (User Manual Name) for CAN_MO202_IPR.
* To use register names with standard convension, please use CAN_MO202_IPR.
*/
#define	CAN_MOIPR202	(CAN_MO202_IPR)

/** \brief  295C, Message Object  Control Register */
#define CAN_MO202_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A95Cu)

/** Alias (User Manual Name) for CAN_MO202_STAT.
* To use register names with standard convension, please use CAN_MO202_STAT.
*/
#define	CAN_MOSTAT202	(CAN_MO202_STAT)

/** \brief  296C, Message Object  Acceptance Mask Register */
#define CAN_MO203_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A96Cu)

/** Alias (User Manual Name) for CAN_MO203_AMR.
* To use register names with standard convension, please use CAN_MO203_AMR.
*/
#define	CAN_MOAMR203	(CAN_MO203_AMR)

/** \brief  2978, Message Object  Arbitration Register */
#define CAN_MO203_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A978u)

/** Alias (User Manual Name) for CAN_MO203_AR.
* To use register names with standard convension, please use CAN_MO203_AR.
*/
#define	CAN_MOAR203	(CAN_MO203_AR)

/** \brief  297C, Message Object  Control Register */
#define CAN_MO203_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A97Cu)

/** Alias (User Manual Name) for CAN_MO203_CTR.
* To use register names with standard convension, please use CAN_MO203_CTR.
*/
#define	CAN_MOCTR203	(CAN_MO203_CTR)

/** \brief  2974, Message Object  Data Register High */
#define CAN_MO203_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A974u)

/** Alias (User Manual Name) for CAN_MO203_DATAH.
* To use register names with standard convension, please use CAN_MO203_DATAH.
*/
#define	CAN_MODATAH203	(CAN_MO203_DATAH)

/** \brief  2970, Message Object  Data Register Low */
#define CAN_MO203_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A970u)

/** Alias (User Manual Name) for CAN_MO203_DATAL.
* To use register names with standard convension, please use CAN_MO203_DATAL.
*/
#define	CAN_MODATAL203	(CAN_MO203_DATAL)

/** \brief  2960, Message Object  Function Control Register */
#define CAN_MO203_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A960u)

/** Alias (User Manual Name) for CAN_MO203_EDATA0.
* To use register names with standard convension, please use CAN_MO203_EDATA0.
*/
#define	CAN_EMO203DATA0	(CAN_MO203_EDATA0)

/** \brief  2964, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO203_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A964u)

/** Alias (User Manual Name) for CAN_MO203_EDATA1.
* To use register names with standard convension, please use CAN_MO203_EDATA1.
*/
#define	CAN_EMO203DATA1	(CAN_MO203_EDATA1)

/** \brief  2968, Message Object  Interrupt Pointer Register */
#define CAN_MO203_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A968u)

/** Alias (User Manual Name) for CAN_MO203_EDATA2.
* To use register names with standard convension, please use CAN_MO203_EDATA2.
*/
#define	CAN_EMO203DATA2	(CAN_MO203_EDATA2)

/** \brief  296C, Message Object  Acceptance Mask Register */
#define CAN_MO203_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A96Cu)

/** Alias (User Manual Name) for CAN_MO203_EDATA3.
* To use register names with standard convension, please use CAN_MO203_EDATA3.
*/
#define	CAN_EMO203DATA3	(CAN_MO203_EDATA3)

/** \brief  2970, Message Object  Data Register Low */
#define CAN_MO203_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A970u)

/** Alias (User Manual Name) for CAN_MO203_EDATA4.
* To use register names with standard convension, please use CAN_MO203_EDATA4.
*/
#define	CAN_EMO203DATA4	(CAN_MO203_EDATA4)

/** \brief  2974, Message Object  Data Register High */
#define CAN_MO203_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A974u)

/** Alias (User Manual Name) for CAN_MO203_EDATA5.
* To use register names with standard convension, please use CAN_MO203_EDATA5.
*/
#define	CAN_EMO203DATA5	(CAN_MO203_EDATA5)

/** \brief  2978, Message Object  Arbitration Register */
#define CAN_MO203_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A978u)

/** Alias (User Manual Name) for CAN_MO203_EDATA6.
* To use register names with standard convension, please use CAN_MO203_EDATA6.
*/
#define	CAN_EMO203DATA6	(CAN_MO203_EDATA6)

/** \brief  2960, Message Object  Function Control Register */
#define CAN_MO203_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A960u)

/** Alias (User Manual Name) for CAN_MO203_FCR.
* To use register names with standard convension, please use CAN_MO203_FCR.
*/
#define	CAN_MOFCR203	(CAN_MO203_FCR)

/** \brief  2964, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO203_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A964u)

