luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO203_FGPR.
* To use register names with standard convension, please use CAN_MO203_FGPR.
*/
#define	CAN_MOFGPR203	(CAN_MO203_FGPR)

/** \brief  2968, Message Object  Interrupt Pointer Register */
#define CAN_MO203_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A968u)

/** Alias (User Manual Name) for CAN_MO203_IPR.
* To use register names with standard convension, please use CAN_MO203_IPR.
*/
#define	CAN_MOIPR203	(CAN_MO203_IPR)

/** \brief  297C, Message Object  Control Register */
#define CAN_MO203_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A97Cu)

/** Alias (User Manual Name) for CAN_MO203_STAT.
* To use register names with standard convension, please use CAN_MO203_STAT.
*/
#define	CAN_MOSTAT203	(CAN_MO203_STAT)

/** \brief  298C, Message Object  Acceptance Mask Register */
#define CAN_MO204_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A98Cu)

/** Alias (User Manual Name) for CAN_MO204_AMR.
* To use register names with standard convension, please use CAN_MO204_AMR.
*/
#define	CAN_MOAMR204	(CAN_MO204_AMR)

/** \brief  2998, Message Object  Arbitration Register */
#define CAN_MO204_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A998u)

/** Alias (User Manual Name) for CAN_MO204_AR.
* To use register names with standard convension, please use CAN_MO204_AR.
*/
#define	CAN_MOAR204	(CAN_MO204_AR)

/** \brief  299C, Message Object  Control Register */
#define CAN_MO204_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A99Cu)

/** Alias (User Manual Name) for CAN_MO204_CTR.
* To use register names with standard convension, please use CAN_MO204_CTR.
*/
#define	CAN_MOCTR204	(CAN_MO204_CTR)

/** \brief  2994, Message Object  Data Register High */
#define CAN_MO204_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A994u)

/** Alias (User Manual Name) for CAN_MO204_DATAH.
* To use register names with standard convension, please use CAN_MO204_DATAH.
*/
#define	CAN_MODATAH204	(CAN_MO204_DATAH)

/** \brief  2990, Message Object  Data Register Low */
#define CAN_MO204_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A990u)

/** Alias (User Manual Name) for CAN_MO204_DATAL.
* To use register names with standard convension, please use CAN_MO204_DATAL.
*/
#define	CAN_MODATAL204	(CAN_MO204_DATAL)

/** \brief  2980, Message Object  Function Control Register */
#define CAN_MO204_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A980u)

/** Alias (User Manual Name) for CAN_MO204_EDATA0.
* To use register names with standard convension, please use CAN_MO204_EDATA0.
*/
#define	CAN_EMO204DATA0	(CAN_MO204_EDATA0)

/** \brief  2984, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO204_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A984u)

/** Alias (User Manual Name) for CAN_MO204_EDATA1.
* To use register names with standard convension, please use CAN_MO204_EDATA1.
*/
#define	CAN_EMO204DATA1	(CAN_MO204_EDATA1)

/** \brief  2988, Message Object  Interrupt Pointer Register */
#define CAN_MO204_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A988u)

/** Alias (User Manual Name) for CAN_MO204_EDATA2.
* To use register names with standard convension, please use CAN_MO204_EDATA2.
*/
#define	CAN_EMO204DATA2	(CAN_MO204_EDATA2)

/** \brief  298C, Message Object  Acceptance Mask Register */
#define CAN_MO204_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A98Cu)

/** Alias (User Manual Name) for CAN_MO204_EDATA3.
* To use register names with standard convension, please use CAN_MO204_EDATA3.
*/
#define	CAN_EMO204DATA3	(CAN_MO204_EDATA3)

/** \brief  2990, Message Object  Data Register Low */
#define CAN_MO204_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A990u)

/** Alias (User Manual Name) for CAN_MO204_EDATA4.
* To use register names with standard convension, please use CAN_MO204_EDATA4.
*/
#define	CAN_EMO204DATA4	(CAN_MO204_EDATA4)

/** \brief  2994, Message Object  Data Register High */
#define CAN_MO204_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A994u)

/** Alias (User Manual Name) for CAN_MO204_EDATA5.
* To use register names with standard convension, please use CAN_MO204_EDATA5.
*/
#define	CAN_EMO204DATA5	(CAN_MO204_EDATA5)

/** \brief  2998, Message Object  Arbitration Register */
#define CAN_MO204_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A998u)

/** Alias (User Manual Name) for CAN_MO204_EDATA6.
* To use register names with standard convension, please use CAN_MO204_EDATA6.
*/
#define	CAN_EMO204DATA6	(CAN_MO204_EDATA6)

/** \brief  2980, Message Object  Function Control Register */
#define CAN_MO204_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A980u)

/** Alias (User Manual Name) for CAN_MO204_FCR.
* To use register names with standard convension, please use CAN_MO204_FCR.
*/
#define	CAN_MOFCR204	(CAN_MO204_FCR)

/** \brief  2984, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO204_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A984u)

/** Alias (User Manual Name) for CAN_MO204_FGPR.
* To use register names with standard convension, please use CAN_MO204_FGPR.
*/
#define	CAN_MOFGPR204	(CAN_MO204_FGPR)

/** \brief  2988, Message Object  Interrupt Pointer Register */
#define CAN_MO204_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A988u)

/** Alias (User Manual Name) for CAN_MO204_IPR.
* To use register names with standard convension, please use CAN_MO204_IPR.
*/
#define	CAN_MOIPR204	(CAN_MO204_IPR)

/** \brief  299C, Message Object  Control Register */
#define CAN_MO204_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A99Cu)

/** Alias (User Manual Name) for CAN_MO204_STAT.
* To use register names with standard convension, please use CAN_MO204_STAT.
*/
#define	CAN_MOSTAT204	(CAN_MO204_STAT)

/** \brief  29AC, Message Object  Acceptance Mask Register */
#define CAN_MO205_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A9ACu)

/** Alias (User Manual Name) for CAN_MO205_AMR.
* To use register names with standard convension, please use CAN_MO205_AMR.
*/
#define	CAN_MOAMR205	(CAN_MO205_AMR)

/** \brief  29B8, Message Object  Arbitration Register */
#define CAN_MO205_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A9B8u)

/** Alias (User Manual Name) for CAN_MO205_AR.
* To use register names with standard convension, please use CAN_MO205_AR.
*/
#define	CAN_MOAR205	(CAN_MO205_AR)

/** \brief  29BC, Message Object  Control Register */
#define CAN_MO205_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A9BCu)

/** Alias (User Manual Name) for CAN_MO205_CTR.
* To use register names with standard convension, please use CAN_MO205_CTR.
*/
#define	CAN_MOCTR205	(CAN_MO205_CTR)

/** \brief  29B4, Message Object  Data Register High */
#define CAN_MO205_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A9B4u)

