luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO205_DATAH.
* To use register names with standard convension, please use CAN_MO205_DATAH.
*/
#define	CAN_MODATAH205	(CAN_MO205_DATAH)

/** \brief  29B0, Message Object  Data Register Low */
#define CAN_MO205_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A9B0u)

/** Alias (User Manual Name) for CAN_MO205_DATAL.
* To use register names with standard convension, please use CAN_MO205_DATAL.
*/
#define	CAN_MODATAL205	(CAN_MO205_DATAL)

/** \brief  29A0, Message Object  Function Control Register */
#define CAN_MO205_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A9A0u)

/** Alias (User Manual Name) for CAN_MO205_EDATA0.
* To use register names with standard convension, please use CAN_MO205_EDATA0.
*/
#define	CAN_EMO205DATA0	(CAN_MO205_EDATA0)

/** \brief  29A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO205_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A9A4u)

/** Alias (User Manual Name) for CAN_MO205_EDATA1.
* To use register names with standard convension, please use CAN_MO205_EDATA1.
*/
#define	CAN_EMO205DATA1	(CAN_MO205_EDATA1)

/** \brief  29A8, Message Object  Interrupt Pointer Register */
#define CAN_MO205_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A9A8u)

/** Alias (User Manual Name) for CAN_MO205_EDATA2.
* To use register names with standard convension, please use CAN_MO205_EDATA2.
*/
#define	CAN_EMO205DATA2	(CAN_MO205_EDATA2)

/** \brief  29AC, Message Object  Acceptance Mask Register */
#define CAN_MO205_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A9ACu)

/** Alias (User Manual Name) for CAN_MO205_EDATA3.
* To use register names with standard convension, please use CAN_MO205_EDATA3.
*/
#define	CAN_EMO205DATA3	(CAN_MO205_EDATA3)

/** \brief  29B0, Message Object  Data Register Low */
#define CAN_MO205_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A9B0u)

/** Alias (User Manual Name) for CAN_MO205_EDATA4.
* To use register names with standard convension, please use CAN_MO205_EDATA4.
*/
#define	CAN_EMO205DATA4	(CAN_MO205_EDATA4)

/** \brief  29B4, Message Object  Data Register High */
#define CAN_MO205_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A9B4u)

/** Alias (User Manual Name) for CAN_MO205_EDATA5.
* To use register names with standard convension, please use CAN_MO205_EDATA5.
*/
#define	CAN_EMO205DATA5	(CAN_MO205_EDATA5)

/** \brief  29B8, Message Object  Arbitration Register */
#define CAN_MO205_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A9B8u)

/** Alias (User Manual Name) for CAN_MO205_EDATA6.
* To use register names with standard convension, please use CAN_MO205_EDATA6.
*/
#define	CAN_EMO205DATA6	(CAN_MO205_EDATA6)

/** \brief  29A0, Message Object  Function Control Register */
#define CAN_MO205_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A9A0u)

/** Alias (User Manual Name) for CAN_MO205_FCR.
* To use register names with standard convension, please use CAN_MO205_FCR.
*/
#define	CAN_MOFCR205	(CAN_MO205_FCR)

/** \brief  29A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO205_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A9A4u)

/** Alias (User Manual Name) for CAN_MO205_FGPR.
* To use register names with standard convension, please use CAN_MO205_FGPR.
*/
#define	CAN_MOFGPR205	(CAN_MO205_FGPR)

/** \brief  29A8, Message Object  Interrupt Pointer Register */
#define CAN_MO205_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A9A8u)

/** Alias (User Manual Name) for CAN_MO205_IPR.
* To use register names with standard convension, please use CAN_MO205_IPR.
*/
#define	CAN_MOIPR205	(CAN_MO205_IPR)

/** \brief  29BC, Message Object  Control Register */
#define CAN_MO205_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A9BCu)

/** Alias (User Manual Name) for CAN_MO205_STAT.
* To use register names with standard convension, please use CAN_MO205_STAT.
*/
#define	CAN_MOSTAT205	(CAN_MO205_STAT)

/** \brief  29CC, Message Object  Acceptance Mask Register */
#define CAN_MO206_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A9CCu)

/** Alias (User Manual Name) for CAN_MO206_AMR.
* To use register names with standard convension, please use CAN_MO206_AMR.
*/
#define	CAN_MOAMR206	(CAN_MO206_AMR)

/** \brief  29D8, Message Object  Arbitration Register */
#define CAN_MO206_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A9D8u)

/** Alias (User Manual Name) for CAN_MO206_AR.
* To use register names with standard convension, please use CAN_MO206_AR.
*/
#define	CAN_MOAR206	(CAN_MO206_AR)

/** \brief  29DC, Message Object  Control Register */
#define CAN_MO206_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A9DCu)

/** Alias (User Manual Name) for CAN_MO206_CTR.
* To use register names with standard convension, please use CAN_MO206_CTR.
*/
#define	CAN_MOCTR206	(CAN_MO206_CTR)

/** \brief  29D4, Message Object  Data Register High */
#define CAN_MO206_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A9D4u)

/** Alias (User Manual Name) for CAN_MO206_DATAH.
* To use register names with standard convension, please use CAN_MO206_DATAH.
*/
#define	CAN_MODATAH206	(CAN_MO206_DATAH)

/** \brief  29D0, Message Object  Data Register Low */
#define CAN_MO206_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A9D0u)

/** Alias (User Manual Name) for CAN_MO206_DATAL.
* To use register names with standard convension, please use CAN_MO206_DATAL.
*/
#define	CAN_MODATAL206	(CAN_MO206_DATAL)

/** \brief  29C0, Message Object  Function Control Register */
#define CAN_MO206_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A9C0u)

/** Alias (User Manual Name) for CAN_MO206_EDATA0.
* To use register names with standard convension, please use CAN_MO206_EDATA0.
*/
#define	CAN_EMO206DATA0	(CAN_MO206_EDATA0)

/** \brief  29C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO206_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A9C4u)

