luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO206_EDATA1.
* To use register names with standard convension, please use CAN_MO206_EDATA1.
*/
#define	CAN_EMO206DATA1	(CAN_MO206_EDATA1)

/** \brief  29C8, Message Object  Interrupt Pointer Register */
#define CAN_MO206_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A9C8u)

/** Alias (User Manual Name) for CAN_MO206_EDATA2.
* To use register names with standard convension, please use CAN_MO206_EDATA2.
*/
#define	CAN_EMO206DATA2	(CAN_MO206_EDATA2)

/** \brief  29CC, Message Object  Acceptance Mask Register */
#define CAN_MO206_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A9CCu)

/** Alias (User Manual Name) for CAN_MO206_EDATA3.
* To use register names with standard convension, please use CAN_MO206_EDATA3.
*/
#define	CAN_EMO206DATA3	(CAN_MO206_EDATA3)

/** \brief  29D0, Message Object  Data Register Low */
#define CAN_MO206_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A9D0u)

/** Alias (User Manual Name) for CAN_MO206_EDATA4.
* To use register names with standard convension, please use CAN_MO206_EDATA4.
*/
#define	CAN_EMO206DATA4	(CAN_MO206_EDATA4)

/** \brief  29D4, Message Object  Data Register High */
#define CAN_MO206_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001A9D4u)

/** Alias (User Manual Name) for CAN_MO206_EDATA5.
* To use register names with standard convension, please use CAN_MO206_EDATA5.
*/
#define	CAN_EMO206DATA5	(CAN_MO206_EDATA5)

/** \brief  29D8, Message Object  Arbitration Register */
#define CAN_MO206_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001A9D8u)

/** Alias (User Manual Name) for CAN_MO206_EDATA6.
* To use register names with standard convension, please use CAN_MO206_EDATA6.
*/
#define	CAN_EMO206DATA6	(CAN_MO206_EDATA6)

/** \brief  29C0, Message Object  Function Control Register */
#define CAN_MO206_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A9C0u)

/** Alias (User Manual Name) for CAN_MO206_FCR.
* To use register names with standard convension, please use CAN_MO206_FCR.
*/
#define	CAN_MOFCR206	(CAN_MO206_FCR)

/** \brief  29C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO206_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A9C4u)

/** Alias (User Manual Name) for CAN_MO206_FGPR.
* To use register names with standard convension, please use CAN_MO206_FGPR.
*/
#define	CAN_MOFGPR206	(CAN_MO206_FGPR)

/** \brief  29C8, Message Object  Interrupt Pointer Register */
#define CAN_MO206_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A9C8u)

/** Alias (User Manual Name) for CAN_MO206_IPR.
* To use register names with standard convension, please use CAN_MO206_IPR.
*/
#define	CAN_MOIPR206	(CAN_MO206_IPR)

/** \brief  29DC, Message Object  Control Register */
#define CAN_MO206_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A9DCu)

/** Alias (User Manual Name) for CAN_MO206_STAT.
* To use register names with standard convension, please use CAN_MO206_STAT.
*/
#define	CAN_MOSTAT206	(CAN_MO206_STAT)

/** \brief  29EC, Message Object  Acceptance Mask Register */
#define CAN_MO207_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A9ECu)

/** Alias (User Manual Name) for CAN_MO207_AMR.
* To use register names with standard convension, please use CAN_MO207_AMR.
*/
#define	CAN_MOAMR207	(CAN_MO207_AMR)

/** \brief  29F8, Message Object  Arbitration Register */
#define CAN_MO207_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A9F8u)

/** Alias (User Manual Name) for CAN_MO207_AR.
* To use register names with standard convension, please use CAN_MO207_AR.
*/
#define	CAN_MOAR207	(CAN_MO207_AR)

/** \brief  29FC, Message Object  Control Register */
#define CAN_MO207_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A9FCu)

/** Alias (User Manual Name) for CAN_MO207_CTR.
* To use register names with standard convension, please use CAN_MO207_CTR.
*/
#define	CAN_MOCTR207	(CAN_MO207_CTR)

/** \brief  29F4, Message Object  Data Register High */
#define CAN_MO207_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A9F4u)

/** Alias (User Manual Name) for CAN_MO207_DATAH.
* To use register names with standard convension, please use CAN_MO207_DATAH.
*/
#define	CAN_MODATAH207	(CAN_MO207_DATAH)

/** \brief  29F0, Message Object  Data Register Low */
#define CAN_MO207_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A9F0u)

/** Alias (User Manual Name) for CAN_MO207_DATAL.
* To use register names with standard convension, please use CAN_MO207_DATAL.
*/
#define	CAN_MODATAL207	(CAN_MO207_DATAL)

/** \brief  29E0, Message Object  Function Control Register */
#define CAN_MO207_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001A9E0u)

/** Alias (User Manual Name) for CAN_MO207_EDATA0.
* To use register names with standard convension, please use CAN_MO207_EDATA0.
*/
#define	CAN_EMO207DATA0	(CAN_MO207_EDATA0)

/** \brief  29E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO207_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001A9E4u)

/** Alias (User Manual Name) for CAN_MO207_EDATA1.
* To use register names with standard convension, please use CAN_MO207_EDATA1.
*/
#define	CAN_EMO207DATA1	(CAN_MO207_EDATA1)

/** \brief  29E8, Message Object  Interrupt Pointer Register */
#define CAN_MO207_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001A9E8u)

/** Alias (User Manual Name) for CAN_MO207_EDATA2.
* To use register names with standard convension, please use CAN_MO207_EDATA2.
*/
#define	CAN_EMO207DATA2	(CAN_MO207_EDATA2)

/** \brief  29EC, Message Object  Acceptance Mask Register */
#define CAN_MO207_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001A9ECu)

/** Alias (User Manual Name) for CAN_MO207_EDATA3.
* To use register names with standard convension, please use CAN_MO207_EDATA3.
*/
#define	CAN_EMO207DATA3	(CAN_MO207_EDATA3)

/** \brief  29F0, Message Object  Data Register Low */
#define CAN_MO207_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001A9F0u)

/** Alias (User Manual Name) for CAN_MO207_EDATA4.
* To use register names with standard convension, please use CAN_MO207_EDATA4.
*/
#define	CAN_EMO207DATA4	(CAN_MO207_EDATA4)

