luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2A04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO208_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AA04u)

/** Alias (User Manual Name) for CAN_MO208_FGPR.
* To use register names with standard convension, please use CAN_MO208_FGPR.
*/
#define	CAN_MOFGPR208	(CAN_MO208_FGPR)

/** \brief  2A08, Message Object  Interrupt Pointer Register */
#define CAN_MO208_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AA08u)

/** Alias (User Manual Name) for CAN_MO208_IPR.
* To use register names with standard convension, please use CAN_MO208_IPR.
*/
#define	CAN_MOIPR208	(CAN_MO208_IPR)

/** \brief  2A1C, Message Object  Control Register */
#define CAN_MO208_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AA1Cu)

/** Alias (User Manual Name) for CAN_MO208_STAT.
* To use register names with standard convension, please use CAN_MO208_STAT.
*/
#define	CAN_MOSTAT208	(CAN_MO208_STAT)

/** \brief  2A2C, Message Object  Acceptance Mask Register */
#define CAN_MO209_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AA2Cu)

/** Alias (User Manual Name) for CAN_MO209_AMR.
* To use register names with standard convension, please use CAN_MO209_AMR.
*/
#define	CAN_MOAMR209	(CAN_MO209_AMR)

/** \brief  2A38, Message Object  Arbitration Register */
#define CAN_MO209_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AA38u)

/** Alias (User Manual Name) for CAN_MO209_AR.
* To use register names with standard convension, please use CAN_MO209_AR.
*/
#define	CAN_MOAR209	(CAN_MO209_AR)

/** \brief  2A3C, Message Object  Control Register */
#define CAN_MO209_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AA3Cu)

/** Alias (User Manual Name) for CAN_MO209_CTR.
* To use register names with standard convension, please use CAN_MO209_CTR.
*/
#define	CAN_MOCTR209	(CAN_MO209_CTR)

/** \brief  2A34, Message Object  Data Register High */
#define CAN_MO209_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AA34u)

/** Alias (User Manual Name) for CAN_MO209_DATAH.
* To use register names with standard convension, please use CAN_MO209_DATAH.
*/
#define	CAN_MODATAH209	(CAN_MO209_DATAH)

/** \brief  2A30, Message Object  Data Register Low */
#define CAN_MO209_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AA30u)

/** Alias (User Manual Name) for CAN_MO209_DATAL.
* To use register names with standard convension, please use CAN_MO209_DATAL.
*/
#define	CAN_MODATAL209	(CAN_MO209_DATAL)

/** \brief  2A20, Message Object  Function Control Register */
#define CAN_MO209_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AA20u)

/** Alias (User Manual Name) for CAN_MO209_EDATA0.
* To use register names with standard convension, please use CAN_MO209_EDATA0.
*/
#define	CAN_EMO209DATA0	(CAN_MO209_EDATA0)

/** \brief  2A24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO209_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AA24u)

/** Alias (User Manual Name) for CAN_MO209_EDATA1.
* To use register names with standard convension, please use CAN_MO209_EDATA1.
*/
#define	CAN_EMO209DATA1	(CAN_MO209_EDATA1)

/** \brief  2A28, Message Object  Interrupt Pointer Register */
#define CAN_MO209_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AA28u)

/** Alias (User Manual Name) for CAN_MO209_EDATA2.
* To use register names with standard convension, please use CAN_MO209_EDATA2.
*/
#define	CAN_EMO209DATA2	(CAN_MO209_EDATA2)

/** \brief  2A2C, Message Object  Acceptance Mask Register */
#define CAN_MO209_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AA2Cu)

/** Alias (User Manual Name) for CAN_MO209_EDATA3.
* To use register names with standard convension, please use CAN_MO209_EDATA3.
*/
#define	CAN_EMO209DATA3	(CAN_MO209_EDATA3)

/** \brief  2A30, Message Object  Data Register Low */
#define CAN_MO209_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AA30u)

/** Alias (User Manual Name) for CAN_MO209_EDATA4.
* To use register names with standard convension, please use CAN_MO209_EDATA4.
*/
#define	CAN_EMO209DATA4	(CAN_MO209_EDATA4)

/** \brief  2A34, Message Object  Data Register High */
#define CAN_MO209_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AA34u)

/** Alias (User Manual Name) for CAN_MO209_EDATA5.
* To use register names with standard convension, please use CAN_MO209_EDATA5.
*/
#define	CAN_EMO209DATA5	(CAN_MO209_EDATA5)

/** \brief  2A38, Message Object  Arbitration Register */
#define CAN_MO209_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AA38u)

/** Alias (User Manual Name) for CAN_MO209_EDATA6.
* To use register names with standard convension, please use CAN_MO209_EDATA6.
*/
#define	CAN_EMO209DATA6	(CAN_MO209_EDATA6)

/** \brief  2A20, Message Object  Function Control Register */
#define CAN_MO209_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AA20u)

/** Alias (User Manual Name) for CAN_MO209_FCR.
* To use register names with standard convension, please use CAN_MO209_FCR.
*/
#define	CAN_MOFCR209	(CAN_MO209_FCR)

/** \brief  2A24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO209_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AA24u)

/** Alias (User Manual Name) for CAN_MO209_FGPR.
* To use register names with standard convension, please use CAN_MO209_FGPR.
*/
#define	CAN_MOFGPR209	(CAN_MO209_FGPR)

/** \brief  2A28, Message Object  Interrupt Pointer Register */
#define CAN_MO209_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AA28u)

/** Alias (User Manual Name) for CAN_MO209_IPR.
* To use register names with standard convension, please use CAN_MO209_IPR.
*/
#define	CAN_MOIPR209	(CAN_MO209_IPR)

/** \brief  2A3C, Message Object  Control Register */
#define CAN_MO209_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AA3Cu)

/** Alias (User Manual Name) for CAN_MO209_STAT.
* To use register names with standard convension, please use CAN_MO209_STAT.
*/
#define	CAN_MOSTAT209	(CAN_MO209_STAT)

/** \brief  128C, Message Object  Acceptance Mask Register */
#define CAN_MO20_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001928Cu)

/** Alias (User Manual Name) for CAN_MO20_AMR.
* To use register names with standard convension, please use CAN_MO20_AMR.
*/
#define	CAN_MOAMR20	(CAN_MO20_AMR)

/** \brief  1298, Message Object  Arbitration Register */
#define CAN_MO20_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019298u)

/** Alias (User Manual Name) for CAN_MO20_AR.
* To use register names with standard convension, please use CAN_MO20_AR.
*/
#define	CAN_MOAR20	(CAN_MO20_AR)

/** \brief  129C, Message Object  Control Register */
#define CAN_MO20_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001929Cu)

/** Alias (User Manual Name) for CAN_MO20_CTR.
* To use register names with standard convension, please use CAN_MO20_CTR.
*/
#define	CAN_MOCTR20	(CAN_MO20_CTR)

