luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO210_EDATA1.
* To use register names with standard convension, please use CAN_MO210_EDATA1.
*/
#define	CAN_EMO210DATA1	(CAN_MO210_EDATA1)

/** \brief  2A48, Message Object  Interrupt Pointer Register */
#define CAN_MO210_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AA48u)

/** Alias (User Manual Name) for CAN_MO210_EDATA2.
* To use register names with standard convension, please use CAN_MO210_EDATA2.
*/
#define	CAN_EMO210DATA2	(CAN_MO210_EDATA2)

/** \brief  2A4C, Message Object  Acceptance Mask Register */
#define CAN_MO210_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AA4Cu)

/** Alias (User Manual Name) for CAN_MO210_EDATA3.
* To use register names with standard convension, please use CAN_MO210_EDATA3.
*/
#define	CAN_EMO210DATA3	(CAN_MO210_EDATA3)

/** \brief  2A50, Message Object  Data Register Low */
#define CAN_MO210_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AA50u)

/** Alias (User Manual Name) for CAN_MO210_EDATA4.
* To use register names with standard convension, please use CAN_MO210_EDATA4.
*/
#define	CAN_EMO210DATA4	(CAN_MO210_EDATA4)

/** \brief  2A54, Message Object  Data Register High */
#define CAN_MO210_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AA54u)

/** Alias (User Manual Name) for CAN_MO210_EDATA5.
* To use register names with standard convension, please use CAN_MO210_EDATA5.
*/
#define	CAN_EMO210DATA5	(CAN_MO210_EDATA5)

/** \brief  2A58, Message Object  Arbitration Register */
#define CAN_MO210_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AA58u)

/** Alias (User Manual Name) for CAN_MO210_EDATA6.
* To use register names with standard convension, please use CAN_MO210_EDATA6.
*/
#define	CAN_EMO210DATA6	(CAN_MO210_EDATA6)

/** \brief  2A40, Message Object  Function Control Register */
#define CAN_MO210_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AA40u)

/** Alias (User Manual Name) for CAN_MO210_FCR.
* To use register names with standard convension, please use CAN_MO210_FCR.
*/
#define	CAN_MOFCR210	(CAN_MO210_FCR)

/** \brief  2A44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO210_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AA44u)

/** Alias (User Manual Name) for CAN_MO210_FGPR.
* To use register names with standard convension, please use CAN_MO210_FGPR.
*/
#define	CAN_MOFGPR210	(CAN_MO210_FGPR)

/** \brief  2A48, Message Object  Interrupt Pointer Register */
#define CAN_MO210_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AA48u)

/** Alias (User Manual Name) for CAN_MO210_IPR.
* To use register names with standard convension, please use CAN_MO210_IPR.
*/
#define	CAN_MOIPR210	(CAN_MO210_IPR)

/** \brief  2A5C, Message Object  Control Register */
#define CAN_MO210_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AA5Cu)

/** Alias (User Manual Name) for CAN_MO210_STAT.
* To use register names with standard convension, please use CAN_MO210_STAT.
*/
#define	CAN_MOSTAT210	(CAN_MO210_STAT)

/** \brief  2A6C, Message Object  Acceptance Mask Register */
#define CAN_MO211_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AA6Cu)

/** Alias (User Manual Name) for CAN_MO211_AMR.
* To use register names with standard convension, please use CAN_MO211_AMR.
*/
#define	CAN_MOAMR211	(CAN_MO211_AMR)

/** \brief  2A78, Message Object  Arbitration Register */
#define CAN_MO211_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AA78u)

/** Alias (User Manual Name) for CAN_MO211_AR.
* To use register names with standard convension, please use CAN_MO211_AR.
*/
#define	CAN_MOAR211	(CAN_MO211_AR)

/** \brief  2A7C, Message Object  Control Register */
#define CAN_MO211_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AA7Cu)

/** Alias (User Manual Name) for CAN_MO211_CTR.
* To use register names with standard convension, please use CAN_MO211_CTR.
*/
#define	CAN_MOCTR211	(CAN_MO211_CTR)

/** \brief  2A74, Message Object  Data Register High */
#define CAN_MO211_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AA74u)

/** Alias (User Manual Name) for CAN_MO211_DATAH.
* To use register names with standard convension, please use CAN_MO211_DATAH.
*/
#define	CAN_MODATAH211	(CAN_MO211_DATAH)

/** \brief  2A70, Message Object  Data Register Low */
#define CAN_MO211_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AA70u)

/** Alias (User Manual Name) for CAN_MO211_DATAL.
* To use register names with standard convension, please use CAN_MO211_DATAL.
*/
#define	CAN_MODATAL211	(CAN_MO211_DATAL)

/** \brief  2A60, Message Object  Function Control Register */
#define CAN_MO211_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AA60u)

/** Alias (User Manual Name) for CAN_MO211_EDATA0.
* To use register names with standard convension, please use CAN_MO211_EDATA0.
*/
#define	CAN_EMO211DATA0	(CAN_MO211_EDATA0)

/** \brief  2A64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO211_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AA64u)

/** Alias (User Manual Name) for CAN_MO211_EDATA1.
* To use register names with standard convension, please use CAN_MO211_EDATA1.
*/
#define	CAN_EMO211DATA1	(CAN_MO211_EDATA1)

/** \brief  2A68, Message Object  Interrupt Pointer Register */
#define CAN_MO211_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AA68u)

/** Alias (User Manual Name) for CAN_MO211_EDATA2.
* To use register names with standard convension, please use CAN_MO211_EDATA2.
*/
#define	CAN_EMO211DATA2	(CAN_MO211_EDATA2)

/** \brief  2A6C, Message Object  Acceptance Mask Register */
#define CAN_MO211_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AA6Cu)

/** Alias (User Manual Name) for CAN_MO211_EDATA3.
* To use register names with standard convension, please use CAN_MO211_EDATA3.
*/
#define	CAN_EMO211DATA3	(CAN_MO211_EDATA3)

/** \brief  2A70, Message Object  Data Register Low */
#define CAN_MO211_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AA70u)

/** Alias (User Manual Name) for CAN_MO211_EDATA4.
* To use register names with standard convension, please use CAN_MO211_EDATA4.
*/
#define	CAN_EMO211DATA4	(CAN_MO211_EDATA4)

/** \brief  2A74, Message Object  Data Register High */
#define CAN_MO211_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AA74u)

/** Alias (User Manual Name) for CAN_MO211_EDATA5.
* To use register names with standard convension, please use CAN_MO211_EDATA5.
*/
#define	CAN_EMO211DATA5	(CAN_MO211_EDATA5)

