luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO212_STAT.
* To use register names with standard convension, please use CAN_MO212_STAT.
*/
#define	CAN_MOSTAT212	(CAN_MO212_STAT)

/** \brief  2AAC, Message Object  Acceptance Mask Register */
#define CAN_MO213_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AAACu)

/** Alias (User Manual Name) for CAN_MO213_AMR.
* To use register names with standard convension, please use CAN_MO213_AMR.
*/
#define	CAN_MOAMR213	(CAN_MO213_AMR)

/** \brief  2AB8, Message Object  Arbitration Register */
#define CAN_MO213_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AAB8u)

/** Alias (User Manual Name) for CAN_MO213_AR.
* To use register names with standard convension, please use CAN_MO213_AR.
*/
#define	CAN_MOAR213	(CAN_MO213_AR)

/** \brief  2ABC, Message Object  Control Register */
#define CAN_MO213_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AABCu)

/** Alias (User Manual Name) for CAN_MO213_CTR.
* To use register names with standard convension, please use CAN_MO213_CTR.
*/
#define	CAN_MOCTR213	(CAN_MO213_CTR)

/** \brief  2AB4, Message Object  Data Register High */
#define CAN_MO213_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AAB4u)

/** Alias (User Manual Name) for CAN_MO213_DATAH.
* To use register names with standard convension, please use CAN_MO213_DATAH.
*/
#define	CAN_MODATAH213	(CAN_MO213_DATAH)

/** \brief  2AB0, Message Object  Data Register Low */
#define CAN_MO213_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AAB0u)

/** Alias (User Manual Name) for CAN_MO213_DATAL.
* To use register names with standard convension, please use CAN_MO213_DATAL.
*/
#define	CAN_MODATAL213	(CAN_MO213_DATAL)

/** \brief  2AA0, Message Object  Function Control Register */
#define CAN_MO213_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AAA0u)

/** Alias (User Manual Name) for CAN_MO213_EDATA0.
* To use register names with standard convension, please use CAN_MO213_EDATA0.
*/
#define	CAN_EMO213DATA0	(CAN_MO213_EDATA0)

/** \brief  2AA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO213_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AAA4u)

/** Alias (User Manual Name) for CAN_MO213_EDATA1.
* To use register names with standard convension, please use CAN_MO213_EDATA1.
*/
#define	CAN_EMO213DATA1	(CAN_MO213_EDATA1)

/** \brief  2AA8, Message Object  Interrupt Pointer Register */
#define CAN_MO213_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AAA8u)

/** Alias (User Manual Name) for CAN_MO213_EDATA2.
* To use register names with standard convension, please use CAN_MO213_EDATA2.
*/
#define	CAN_EMO213DATA2	(CAN_MO213_EDATA2)

/** \brief  2AAC, Message Object  Acceptance Mask Register */
#define CAN_MO213_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AAACu)

/** Alias (User Manual Name) for CAN_MO213_EDATA3.
* To use register names with standard convension, please use CAN_MO213_EDATA3.
*/
#define	CAN_EMO213DATA3	(CAN_MO213_EDATA3)

/** \brief  2AB0, Message Object  Data Register Low */
#define CAN_MO213_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AAB0u)

/** Alias (User Manual Name) for CAN_MO213_EDATA4.
* To use register names with standard convension, please use CAN_MO213_EDATA4.
*/
#define	CAN_EMO213DATA4	(CAN_MO213_EDATA4)

/** \brief  2AB4, Message Object  Data Register High */
#define CAN_MO213_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AAB4u)

/** Alias (User Manual Name) for CAN_MO213_EDATA5.
* To use register names with standard convension, please use CAN_MO213_EDATA5.
*/
#define	CAN_EMO213DATA5	(CAN_MO213_EDATA5)

/** \brief  2AB8, Message Object  Arbitration Register */
#define CAN_MO213_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AAB8u)

/** Alias (User Manual Name) for CAN_MO213_EDATA6.
* To use register names with standard convension, please use CAN_MO213_EDATA6.
*/
#define	CAN_EMO213DATA6	(CAN_MO213_EDATA6)

/** \brief  2AA0, Message Object  Function Control Register */
#define CAN_MO213_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AAA0u)

/** Alias (User Manual Name) for CAN_MO213_FCR.
* To use register names with standard convension, please use CAN_MO213_FCR.
*/
#define	CAN_MOFCR213	(CAN_MO213_FCR)

/** \brief  2AA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO213_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AAA4u)

/** Alias (User Manual Name) for CAN_MO213_FGPR.
* To use register names with standard convension, please use CAN_MO213_FGPR.
*/
#define	CAN_MOFGPR213	(CAN_MO213_FGPR)

/** \brief  2AA8, Message Object  Interrupt Pointer Register */
#define CAN_MO213_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AAA8u)

/** Alias (User Manual Name) for CAN_MO213_IPR.
* To use register names with standard convension, please use CAN_MO213_IPR.
*/
#define	CAN_MOIPR213	(CAN_MO213_IPR)

/** \brief  2ABC, Message Object  Control Register */
#define CAN_MO213_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AABCu)

/** Alias (User Manual Name) for CAN_MO213_STAT.
* To use register names with standard convension, please use CAN_MO213_STAT.
*/
#define	CAN_MOSTAT213	(CAN_MO213_STAT)

/** \brief  2ACC, Message Object  Acceptance Mask Register */
#define CAN_MO214_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AACCu)

/** Alias (User Manual Name) for CAN_MO214_AMR.
* To use register names with standard convension, please use CAN_MO214_AMR.
*/
#define	CAN_MOAMR214	(CAN_MO214_AMR)

/** \brief  2AD8, Message Object  Arbitration Register */
#define CAN_MO214_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AAD8u)

/** Alias (User Manual Name) for CAN_MO214_AR.
* To use register names with standard convension, please use CAN_MO214_AR.
*/
#define	CAN_MOAR214	(CAN_MO214_AR)

/** \brief  2ADC, Message Object  Control Register */
#define CAN_MO214_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AADCu)

/** Alias (User Manual Name) for CAN_MO214_CTR.
* To use register names with standard convension, please use CAN_MO214_CTR.
*/
#define	CAN_MOCTR214	(CAN_MO214_CTR)

/** \brief  2AD4, Message Object  Data Register High */
#define CAN_MO214_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AAD4u)

/** Alias (User Manual Name) for CAN_MO214_DATAH.
* To use register names with standard convension, please use CAN_MO214_DATAH.
*/
#define	CAN_MODATAH214	(CAN_MO214_DATAH)

/** \brief  2AD0, Message Object  Data Register Low */
#define CAN_MO214_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AAD0u)

/** Alias (User Manual Name) for CAN_MO214_DATAL.
* To use register names with standard convension, please use CAN_MO214_DATAL.
*/
#define	CAN_MODATAL214	(CAN_MO214_DATAL)

/** \brief  2AC0, Message Object  Function Control Register */
#define CAN_MO214_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AAC0u)

/** Alias (User Manual Name) for CAN_MO214_EDATA0.
* To use register names with standard convension, please use CAN_MO214_EDATA0.
*/
#define	CAN_EMO214DATA0	(CAN_MO214_EDATA0)

