luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2AC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO214_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AAC4u)

/** Alias (User Manual Name) for CAN_MO214_EDATA1.
* To use register names with standard convension, please use CAN_MO214_EDATA1.
*/
#define	CAN_EMO214DATA1	(CAN_MO214_EDATA1)

/** \brief  2AC8, Message Object  Interrupt Pointer Register */
#define CAN_MO214_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AAC8u)

/** Alias (User Manual Name) for CAN_MO214_EDATA2.
* To use register names with standard convension, please use CAN_MO214_EDATA2.
*/
#define	CAN_EMO214DATA2	(CAN_MO214_EDATA2)

/** \brief  2ACC, Message Object  Acceptance Mask Register */
#define CAN_MO214_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AACCu)

/** Alias (User Manual Name) for CAN_MO214_EDATA3.
* To use register names with standard convension, please use CAN_MO214_EDATA3.
*/
#define	CAN_EMO214DATA3	(CAN_MO214_EDATA3)

/** \brief  2AD0, Message Object  Data Register Low */
#define CAN_MO214_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AAD0u)

/** Alias (User Manual Name) for CAN_MO214_EDATA4.
* To use register names with standard convension, please use CAN_MO214_EDATA4.
*/
#define	CAN_EMO214DATA4	(CAN_MO214_EDATA4)

/** \brief  2AD4, Message Object  Data Register High */
#define CAN_MO214_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AAD4u)

/** Alias (User Manual Name) for CAN_MO214_EDATA5.
* To use register names with standard convension, please use CAN_MO214_EDATA5.
*/
#define	CAN_EMO214DATA5	(CAN_MO214_EDATA5)

/** \brief  2AD8, Message Object  Arbitration Register */
#define CAN_MO214_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AAD8u)

/** Alias (User Manual Name) for CAN_MO214_EDATA6.
* To use register names with standard convension, please use CAN_MO214_EDATA6.
*/
#define	CAN_EMO214DATA6	(CAN_MO214_EDATA6)

/** \brief  2AC0, Message Object  Function Control Register */
#define CAN_MO214_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AAC0u)

/** Alias (User Manual Name) for CAN_MO214_FCR.
* To use register names with standard convension, please use CAN_MO214_FCR.
*/
#define	CAN_MOFCR214	(CAN_MO214_FCR)

/** \brief  2AC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO214_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AAC4u)

/** Alias (User Manual Name) for CAN_MO214_FGPR.
* To use register names with standard convension, please use CAN_MO214_FGPR.
*/
#define	CAN_MOFGPR214	(CAN_MO214_FGPR)

/** \brief  2AC8, Message Object  Interrupt Pointer Register */
#define CAN_MO214_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AAC8u)

/** Alias (User Manual Name) for CAN_MO214_IPR.
* To use register names with standard convension, please use CAN_MO214_IPR.
*/
#define	CAN_MOIPR214	(CAN_MO214_IPR)

/** \brief  2ADC, Message Object  Control Register */
#define CAN_MO214_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AADCu)

/** Alias (User Manual Name) for CAN_MO214_STAT.
* To use register names with standard convension, please use CAN_MO214_STAT.
*/
#define	CAN_MOSTAT214	(CAN_MO214_STAT)

/** \brief  2AEC, Message Object  Acceptance Mask Register */
#define CAN_MO215_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AAECu)

/** Alias (User Manual Name) for CAN_MO215_AMR.
* To use register names with standard convension, please use CAN_MO215_AMR.
*/
#define	CAN_MOAMR215	(CAN_MO215_AMR)

/** \brief  2AF8, Message Object  Arbitration Register */
#define CAN_MO215_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AAF8u)

/** Alias (User Manual Name) for CAN_MO215_AR.
* To use register names with standard convension, please use CAN_MO215_AR.
*/
#define	CAN_MOAR215	(CAN_MO215_AR)

/** \brief  2AFC, Message Object  Control Register */
#define CAN_MO215_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AAFCu)

/** Alias (User Manual Name) for CAN_MO215_CTR.
* To use register names with standard convension, please use CAN_MO215_CTR.
*/
#define	CAN_MOCTR215	(CAN_MO215_CTR)

/** \brief  2AF4, Message Object  Data Register High */
#define CAN_MO215_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AAF4u)

/** Alias (User Manual Name) for CAN_MO215_DATAH.
* To use register names with standard convension, please use CAN_MO215_DATAH.
*/
#define	CAN_MODATAH215	(CAN_MO215_DATAH)

/** \brief  2AF0, Message Object  Data Register Low */
#define CAN_MO215_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AAF0u)

/** Alias (User Manual Name) for CAN_MO215_DATAL.
* To use register names with standard convension, please use CAN_MO215_DATAL.
*/
#define	CAN_MODATAL215	(CAN_MO215_DATAL)

/** \brief  2AE0, Message Object  Function Control Register */
#define CAN_MO215_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AAE0u)

/** Alias (User Manual Name) for CAN_MO215_EDATA0.
* To use register names with standard convension, please use CAN_MO215_EDATA0.
*/
#define	CAN_EMO215DATA0	(CAN_MO215_EDATA0)

/** \brief  2AE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO215_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AAE4u)

/** Alias (User Manual Name) for CAN_MO215_EDATA1.
* To use register names with standard convension, please use CAN_MO215_EDATA1.
*/
#define	CAN_EMO215DATA1	(CAN_MO215_EDATA1)

/** \brief  2AE8, Message Object  Interrupt Pointer Register */
#define CAN_MO215_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AAE8u)

/** Alias (User Manual Name) for CAN_MO215_EDATA2.
* To use register names with standard convension, please use CAN_MO215_EDATA2.
*/
#define	CAN_EMO215DATA2	(CAN_MO215_EDATA2)

/** \brief  2AEC, Message Object  Acceptance Mask Register */
#define CAN_MO215_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AAECu)

/** Alias (User Manual Name) for CAN_MO215_EDATA3.
* To use register names with standard convension, please use CAN_MO215_EDATA3.
*/
#define	CAN_EMO215DATA3	(CAN_MO215_EDATA3)

/** \brief  2AF0, Message Object  Data Register Low */
#define CAN_MO215_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AAF0u)

/** Alias (User Manual Name) for CAN_MO215_EDATA4.
* To use register names with standard convension, please use CAN_MO215_EDATA4.
*/
#define	CAN_EMO215DATA4	(CAN_MO215_EDATA4)

/** \brief  2AF4, Message Object  Data Register High */
#define CAN_MO215_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AAF4u)

/** Alias (User Manual Name) for CAN_MO215_EDATA5.
* To use register names with standard convension, please use CAN_MO215_EDATA5.
*/
#define	CAN_EMO215DATA5	(CAN_MO215_EDATA5)

/** \brief  2AF8, Message Object  Arbitration Register */
#define CAN_MO215_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AAF8u)

