luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO217_AMR.
* To use register names with standard convension, please use CAN_MO217_AMR.
*/
#define	CAN_MOAMR217	(CAN_MO217_AMR)

/** \brief  2B38, Message Object  Arbitration Register */
#define CAN_MO217_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AB38u)

/** Alias (User Manual Name) for CAN_MO217_AR.
* To use register names with standard convension, please use CAN_MO217_AR.
*/
#define	CAN_MOAR217	(CAN_MO217_AR)

/** \brief  2B3C, Message Object  Control Register */
#define CAN_MO217_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AB3Cu)

/** Alias (User Manual Name) for CAN_MO217_CTR.
* To use register names with standard convension, please use CAN_MO217_CTR.
*/
#define	CAN_MOCTR217	(CAN_MO217_CTR)

/** \brief  2B34, Message Object  Data Register High */
#define CAN_MO217_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AB34u)

/** Alias (User Manual Name) for CAN_MO217_DATAH.
* To use register names with standard convension, please use CAN_MO217_DATAH.
*/
#define	CAN_MODATAH217	(CAN_MO217_DATAH)

/** \brief  2B30, Message Object  Data Register Low */
#define CAN_MO217_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AB30u)

/** Alias (User Manual Name) for CAN_MO217_DATAL.
* To use register names with standard convension, please use CAN_MO217_DATAL.
*/
#define	CAN_MODATAL217	(CAN_MO217_DATAL)

/** \brief  2B20, Message Object  Function Control Register */
#define CAN_MO217_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AB20u)

/** Alias (User Manual Name) for CAN_MO217_EDATA0.
* To use register names with standard convension, please use CAN_MO217_EDATA0.
*/
#define	CAN_EMO217DATA0	(CAN_MO217_EDATA0)

/** \brief  2B24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO217_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AB24u)

/** Alias (User Manual Name) for CAN_MO217_EDATA1.
* To use register names with standard convension, please use CAN_MO217_EDATA1.
*/
#define	CAN_EMO217DATA1	(CAN_MO217_EDATA1)

/** \brief  2B28, Message Object  Interrupt Pointer Register */
#define CAN_MO217_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AB28u)

/** Alias (User Manual Name) for CAN_MO217_EDATA2.
* To use register names with standard convension, please use CAN_MO217_EDATA2.
*/
#define	CAN_EMO217DATA2	(CAN_MO217_EDATA2)

/** \brief  2B2C, Message Object  Acceptance Mask Register */
#define CAN_MO217_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AB2Cu)

/** Alias (User Manual Name) for CAN_MO217_EDATA3.
* To use register names with standard convension, please use CAN_MO217_EDATA3.
*/
#define	CAN_EMO217DATA3	(CAN_MO217_EDATA3)

/** \brief  2B30, Message Object  Data Register Low */
#define CAN_MO217_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AB30u)

/** Alias (User Manual Name) for CAN_MO217_EDATA4.
* To use register names with standard convension, please use CAN_MO217_EDATA4.
*/
#define	CAN_EMO217DATA4	(CAN_MO217_EDATA4)

/** \brief  2B34, Message Object  Data Register High */
#define CAN_MO217_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AB34u)

/** Alias (User Manual Name) for CAN_MO217_EDATA5.
* To use register names with standard convension, please use CAN_MO217_EDATA5.
*/
#define	CAN_EMO217DATA5	(CAN_MO217_EDATA5)

/** \brief  2B38, Message Object  Arbitration Register */
#define CAN_MO217_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AB38u)

/** Alias (User Manual Name) for CAN_MO217_EDATA6.
* To use register names with standard convension, please use CAN_MO217_EDATA6.
*/
#define	CAN_EMO217DATA6	(CAN_MO217_EDATA6)

/** \brief  2B20, Message Object  Function Control Register */
#define CAN_MO217_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AB20u)

/** Alias (User Manual Name) for CAN_MO217_FCR.
* To use register names with standard convension, please use CAN_MO217_FCR.
*/
#define	CAN_MOFCR217	(CAN_MO217_FCR)

/** \brief  2B24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO217_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AB24u)

/** Alias (User Manual Name) for CAN_MO217_FGPR.
* To use register names with standard convension, please use CAN_MO217_FGPR.
*/
#define	CAN_MOFGPR217	(CAN_MO217_FGPR)

/** \brief  2B28, Message Object  Interrupt Pointer Register */
#define CAN_MO217_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AB28u)

/** Alias (User Manual Name) for CAN_MO217_IPR.
* To use register names with standard convension, please use CAN_MO217_IPR.
*/
#define	CAN_MOIPR217	(CAN_MO217_IPR)

/** \brief  2B3C, Message Object  Control Register */
#define CAN_MO217_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AB3Cu)

/** Alias (User Manual Name) for CAN_MO217_STAT.
* To use register names with standard convension, please use CAN_MO217_STAT.
*/
#define	CAN_MOSTAT217	(CAN_MO217_STAT)

/** \brief  2B4C, Message Object  Acceptance Mask Register */
#define CAN_MO218_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AB4Cu)

/** Alias (User Manual Name) for CAN_MO218_AMR.
* To use register names with standard convension, please use CAN_MO218_AMR.
*/
#define	CAN_MOAMR218	(CAN_MO218_AMR)

/** \brief  2B58, Message Object  Arbitration Register */
#define CAN_MO218_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AB58u)

/** Alias (User Manual Name) for CAN_MO218_AR.
* To use register names with standard convension, please use CAN_MO218_AR.
*/
#define	CAN_MOAR218	(CAN_MO218_AR)

/** \brief  2B5C, Message Object  Control Register */
#define CAN_MO218_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AB5Cu)

/** Alias (User Manual Name) for CAN_MO218_CTR.
* To use register names with standard convension, please use CAN_MO218_CTR.
*/
#define	CAN_MOCTR218	(CAN_MO218_CTR)

/** \brief  2B54, Message Object  Data Register High */
#define CAN_MO218_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AB54u)

/** Alias (User Manual Name) for CAN_MO218_DATAH.
* To use register names with standard convension, please use CAN_MO218_DATAH.
*/
#define	CAN_MODATAH218	(CAN_MO218_DATAH)

/** \brief  2B50, Message Object  Data Register Low */
#define CAN_MO218_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AB50u)

/** Alias (User Manual Name) for CAN_MO218_DATAL.
* To use register names with standard convension, please use CAN_MO218_DATAL.
*/
#define	CAN_MODATAL218	(CAN_MO218_DATAL)

