luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2B40, Message Object  Function Control Register */
#define CAN_MO218_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AB40u)

/** Alias (User Manual Name) for CAN_MO218_EDATA0.
* To use register names with standard convension, please use CAN_MO218_EDATA0.
*/
#define	CAN_EMO218DATA0	(CAN_MO218_EDATA0)

/** \brief  2B44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO218_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AB44u)

/** Alias (User Manual Name) for CAN_MO218_EDATA1.
* To use register names with standard convension, please use CAN_MO218_EDATA1.
*/
#define	CAN_EMO218DATA1	(CAN_MO218_EDATA1)

/** \brief  2B48, Message Object  Interrupt Pointer Register */
#define CAN_MO218_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AB48u)

/** Alias (User Manual Name) for CAN_MO218_EDATA2.
* To use register names with standard convension, please use CAN_MO218_EDATA2.
*/
#define	CAN_EMO218DATA2	(CAN_MO218_EDATA2)

/** \brief  2B4C, Message Object  Acceptance Mask Register */
#define CAN_MO218_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AB4Cu)

/** Alias (User Manual Name) for CAN_MO218_EDATA3.
* To use register names with standard convension, please use CAN_MO218_EDATA3.
*/
#define	CAN_EMO218DATA3	(CAN_MO218_EDATA3)

/** \brief  2B50, Message Object  Data Register Low */
#define CAN_MO218_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AB50u)

/** Alias (User Manual Name) for CAN_MO218_EDATA4.
* To use register names with standard convension, please use CAN_MO218_EDATA4.
*/
#define	CAN_EMO218DATA4	(CAN_MO218_EDATA4)

/** \brief  2B54, Message Object  Data Register High */
#define CAN_MO218_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AB54u)

/** Alias (User Manual Name) for CAN_MO218_EDATA5.
* To use register names with standard convension, please use CAN_MO218_EDATA5.
*/
#define	CAN_EMO218DATA5	(CAN_MO218_EDATA5)

/** \brief  2B58, Message Object  Arbitration Register */
#define CAN_MO218_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AB58u)

/** Alias (User Manual Name) for CAN_MO218_EDATA6.
* To use register names with standard convension, please use CAN_MO218_EDATA6.
*/
#define	CAN_EMO218DATA6	(CAN_MO218_EDATA6)

/** \brief  2B40, Message Object  Function Control Register */
#define CAN_MO218_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AB40u)

/** Alias (User Manual Name) for CAN_MO218_FCR.
* To use register names with standard convension, please use CAN_MO218_FCR.
*/
#define	CAN_MOFCR218	(CAN_MO218_FCR)

/** \brief  2B44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO218_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AB44u)

/** Alias (User Manual Name) for CAN_MO218_FGPR.
* To use register names with standard convension, please use CAN_MO218_FGPR.
*/
#define	CAN_MOFGPR218	(CAN_MO218_FGPR)

/** \brief  2B48, Message Object  Interrupt Pointer Register */
#define CAN_MO218_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AB48u)

/** Alias (User Manual Name) for CAN_MO218_IPR.
* To use register names with standard convension, please use CAN_MO218_IPR.
*/
#define	CAN_MOIPR218	(CAN_MO218_IPR)

/** \brief  2B5C, Message Object  Control Register */
#define CAN_MO218_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AB5Cu)

/** Alias (User Manual Name) for CAN_MO218_STAT.
* To use register names with standard convension, please use CAN_MO218_STAT.
*/
#define	CAN_MOSTAT218	(CAN_MO218_STAT)

/** \brief  2B6C, Message Object  Acceptance Mask Register */
#define CAN_MO219_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AB6Cu)

/** Alias (User Manual Name) for CAN_MO219_AMR.
* To use register names with standard convension, please use CAN_MO219_AMR.
*/
#define	CAN_MOAMR219	(CAN_MO219_AMR)

/** \brief  2B78, Message Object  Arbitration Register */
#define CAN_MO219_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AB78u)

/** Alias (User Manual Name) for CAN_MO219_AR.
* To use register names with standard convension, please use CAN_MO219_AR.
*/
#define	CAN_MOAR219	(CAN_MO219_AR)

/** \brief  2B7C, Message Object  Control Register */
#define CAN_MO219_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AB7Cu)

/** Alias (User Manual Name) for CAN_MO219_CTR.
* To use register names with standard convension, please use CAN_MO219_CTR.
*/
#define	CAN_MOCTR219	(CAN_MO219_CTR)

/** \brief  2B74, Message Object  Data Register High */
#define CAN_MO219_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AB74u)

/** Alias (User Manual Name) for CAN_MO219_DATAH.
* To use register names with standard convension, please use CAN_MO219_DATAH.
*/
#define	CAN_MODATAH219	(CAN_MO219_DATAH)

/** \brief  2B70, Message Object  Data Register Low */
#define CAN_MO219_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AB70u)

/** Alias (User Manual Name) for CAN_MO219_DATAL.
* To use register names with standard convension, please use CAN_MO219_DATAL.
*/
#define	CAN_MODATAL219	(CAN_MO219_DATAL)

/** \brief  2B60, Message Object  Function Control Register */
#define CAN_MO219_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AB60u)

/** Alias (User Manual Name) for CAN_MO219_EDATA0.
* To use register names with standard convension, please use CAN_MO219_EDATA0.
*/
#define	CAN_EMO219DATA0	(CAN_MO219_EDATA0)

/** \brief  2B64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO219_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AB64u)

/** Alias (User Manual Name) for CAN_MO219_EDATA1.
* To use register names with standard convension, please use CAN_MO219_EDATA1.
*/
#define	CAN_EMO219DATA1	(CAN_MO219_EDATA1)

/** \brief  2B68, Message Object  Interrupt Pointer Register */
#define CAN_MO219_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AB68u)

/** Alias (User Manual Name) for CAN_MO219_EDATA2.
* To use register names with standard convension, please use CAN_MO219_EDATA2.
*/
#define	CAN_EMO219DATA2	(CAN_MO219_EDATA2)

