luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2B6C, Message Object  Acceptance Mask Register */
#define CAN_MO219_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AB6Cu)

/** Alias (User Manual Name) for CAN_MO219_EDATA3.
* To use register names with standard convension, please use CAN_MO219_EDATA3.
*/
#define	CAN_EMO219DATA3	(CAN_MO219_EDATA3)

/** \brief  2B70, Message Object  Data Register Low */
#define CAN_MO219_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AB70u)

/** Alias (User Manual Name) for CAN_MO219_EDATA4.
* To use register names with standard convension, please use CAN_MO219_EDATA4.
*/
#define	CAN_EMO219DATA4	(CAN_MO219_EDATA4)

/** \brief  2B74, Message Object  Data Register High */
#define CAN_MO219_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AB74u)

/** Alias (User Manual Name) for CAN_MO219_EDATA5.
* To use register names with standard convension, please use CAN_MO219_EDATA5.
*/
#define	CAN_EMO219DATA5	(CAN_MO219_EDATA5)

/** \brief  2B78, Message Object  Arbitration Register */
#define CAN_MO219_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AB78u)

/** Alias (User Manual Name) for CAN_MO219_EDATA6.
* To use register names with standard convension, please use CAN_MO219_EDATA6.
*/
#define	CAN_EMO219DATA6	(CAN_MO219_EDATA6)

/** \brief  2B60, Message Object  Function Control Register */
#define CAN_MO219_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AB60u)

/** Alias (User Manual Name) for CAN_MO219_FCR.
* To use register names with standard convension, please use CAN_MO219_FCR.
*/
#define	CAN_MOFCR219	(CAN_MO219_FCR)

/** \brief  2B64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO219_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AB64u)

/** Alias (User Manual Name) for CAN_MO219_FGPR.
* To use register names with standard convension, please use CAN_MO219_FGPR.
*/
#define	CAN_MOFGPR219	(CAN_MO219_FGPR)

/** \brief  2B68, Message Object  Interrupt Pointer Register */
#define CAN_MO219_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AB68u)

/** Alias (User Manual Name) for CAN_MO219_IPR.
* To use register names with standard convension, please use CAN_MO219_IPR.
*/
#define	CAN_MOIPR219	(CAN_MO219_IPR)

/** \brief  2B7C, Message Object  Control Register */
#define CAN_MO219_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AB7Cu)

/** Alias (User Manual Name) for CAN_MO219_STAT.
* To use register names with standard convension, please use CAN_MO219_STAT.
*/
#define	CAN_MOSTAT219	(CAN_MO219_STAT)

/** \brief  12AC, Message Object  Acceptance Mask Register */
#define CAN_MO21_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00192ACu)

/** Alias (User Manual Name) for CAN_MO21_AMR.
* To use register names with standard convension, please use CAN_MO21_AMR.
*/
#define	CAN_MOAMR21	(CAN_MO21_AMR)

/** \brief  12B8, Message Object  Arbitration Register */
#define CAN_MO21_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00192B8u)

/** Alias (User Manual Name) for CAN_MO21_AR.
* To use register names with standard convension, please use CAN_MO21_AR.
*/
#define	CAN_MOAR21	(CAN_MO21_AR)

/** \brief  12BC, Message Object  Control Register */
#define CAN_MO21_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00192BCu)

/** Alias (User Manual Name) for CAN_MO21_CTR.
* To use register names with standard convension, please use CAN_MO21_CTR.
*/
#define	CAN_MOCTR21	(CAN_MO21_CTR)

/** \brief  12B4, Message Object  Data Register High */
#define CAN_MO21_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00192B4u)

/** Alias (User Manual Name) for CAN_MO21_DATAH.
* To use register names with standard convension, please use CAN_MO21_DATAH.
*/
#define	CAN_MODATAH21	(CAN_MO21_DATAH)

/** \brief  12B0, Message Object  Data Register Low */
#define CAN_MO21_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00192B0u)

/** Alias (User Manual Name) for CAN_MO21_DATAL.
* To use register names with standard convension, please use CAN_MO21_DATAL.
*/
#define	CAN_MODATAL21	(CAN_MO21_DATAL)

/** \brief  12A0, Message Object  Function Control Register */
#define CAN_MO21_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00192A0u)

/** Alias (User Manual Name) for CAN_MO21_EDATA0.
* To use register names with standard convension, please use CAN_MO21_EDATA0.
*/
#define	CAN_EMO21DATA0	(CAN_MO21_EDATA0)

/** \brief  12A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO21_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00192A4u)

/** Alias (User Manual Name) for CAN_MO21_EDATA1.
* To use register names with standard convension, please use CAN_MO21_EDATA1.
*/
#define	CAN_EMO21DATA1	(CAN_MO21_EDATA1)

/** \brief  12A8, Message Object  Interrupt Pointer Register */
#define CAN_MO21_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00192A8u)

/** Alias (User Manual Name) for CAN_MO21_EDATA2.
* To use register names with standard convension, please use CAN_MO21_EDATA2.
*/
#define	CAN_EMO21DATA2	(CAN_MO21_EDATA2)

/** \brief  12AC, Message Object  Acceptance Mask Register */
#define CAN_MO21_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00192ACu)

/** Alias (User Manual Name) for CAN_MO21_EDATA3.
* To use register names with standard convension, please use CAN_MO21_EDATA3.
*/
#define	CAN_EMO21DATA3	(CAN_MO21_EDATA3)

/** \brief  12B0, Message Object  Data Register Low */
#define CAN_MO21_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00192B0u)

/** Alias (User Manual Name) for CAN_MO21_EDATA4.
* To use register names with standard convension, please use CAN_MO21_EDATA4.
*/
#define	CAN_EMO21DATA4	(CAN_MO21_EDATA4)

/** \brief  12B4, Message Object  Data Register High */
#define CAN_MO21_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00192B4u)

/** Alias (User Manual Name) for CAN_MO21_EDATA5.
* To use register names with standard convension, please use CAN_MO21_EDATA5.
*/
#define	CAN_EMO21DATA5	(CAN_MO21_EDATA5)

/** \brief  12B8, Message Object  Arbitration Register */
#define CAN_MO21_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00192B8u)

