luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO21_EDATA6.
* To use register names with standard convension, please use CAN_MO21_EDATA6.
*/
#define	CAN_EMO21DATA6	(CAN_MO21_EDATA6)

/** \brief  12A0, Message Object  Function Control Register */
#define CAN_MO21_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00192A0u)

/** Alias (User Manual Name) for CAN_MO21_FCR.
* To use register names with standard convension, please use CAN_MO21_FCR.
*/
#define	CAN_MOFCR21	(CAN_MO21_FCR)

/** \brief  12A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO21_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00192A4u)

/** Alias (User Manual Name) for CAN_MO21_FGPR.
* To use register names with standard convension, please use CAN_MO21_FGPR.
*/
#define	CAN_MOFGPR21	(CAN_MO21_FGPR)

/** \brief  12A8, Message Object  Interrupt Pointer Register */
#define CAN_MO21_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00192A8u)

/** Alias (User Manual Name) for CAN_MO21_IPR.
* To use register names with standard convension, please use CAN_MO21_IPR.
*/
#define	CAN_MOIPR21	(CAN_MO21_IPR)

/** \brief  12BC, Message Object  Control Register */
#define CAN_MO21_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00192BCu)

/** Alias (User Manual Name) for CAN_MO21_STAT.
* To use register names with standard convension, please use CAN_MO21_STAT.
*/
#define	CAN_MOSTAT21	(CAN_MO21_STAT)

/** \brief  2B8C, Message Object  Acceptance Mask Register */
#define CAN_MO220_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AB8Cu)

/** Alias (User Manual Name) for CAN_MO220_AMR.
* To use register names with standard convension, please use CAN_MO220_AMR.
*/
#define	CAN_MOAMR220	(CAN_MO220_AMR)

/** \brief  2B98, Message Object  Arbitration Register */
#define CAN_MO220_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AB98u)

/** Alias (User Manual Name) for CAN_MO220_AR.
* To use register names with standard convension, please use CAN_MO220_AR.
*/
#define	CAN_MOAR220	(CAN_MO220_AR)

/** \brief  2B9C, Message Object  Control Register */
#define CAN_MO220_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AB9Cu)

/** Alias (User Manual Name) for CAN_MO220_CTR.
* To use register names with standard convension, please use CAN_MO220_CTR.
*/
#define	CAN_MOCTR220	(CAN_MO220_CTR)

/** \brief  2B94, Message Object  Data Register High */
#define CAN_MO220_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AB94u)

/** Alias (User Manual Name) for CAN_MO220_DATAH.
* To use register names with standard convension, please use CAN_MO220_DATAH.
*/
#define	CAN_MODATAH220	(CAN_MO220_DATAH)

/** \brief  2B90, Message Object  Data Register Low */
#define CAN_MO220_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AB90u)

/** Alias (User Manual Name) for CAN_MO220_DATAL.
* To use register names with standard convension, please use CAN_MO220_DATAL.
*/
#define	CAN_MODATAL220	(CAN_MO220_DATAL)

/** \brief  2B80, Message Object  Function Control Register */
#define CAN_MO220_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AB80u)

/** Alias (User Manual Name) for CAN_MO220_EDATA0.
* To use register names with standard convension, please use CAN_MO220_EDATA0.
*/
#define	CAN_EMO220DATA0	(CAN_MO220_EDATA0)

/** \brief  2B84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO220_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AB84u)

/** Alias (User Manual Name) for CAN_MO220_EDATA1.
* To use register names with standard convension, please use CAN_MO220_EDATA1.
*/
#define	CAN_EMO220DATA1	(CAN_MO220_EDATA1)

/** \brief  2B88, Message Object  Interrupt Pointer Register */
#define CAN_MO220_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AB88u)

/** Alias (User Manual Name) for CAN_MO220_EDATA2.
* To use register names with standard convension, please use CAN_MO220_EDATA2.
*/
#define	CAN_EMO220DATA2	(CAN_MO220_EDATA2)

/** \brief  2B8C, Message Object  Acceptance Mask Register */
#define CAN_MO220_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AB8Cu)

/** Alias (User Manual Name) for CAN_MO220_EDATA3.
* To use register names with standard convension, please use CAN_MO220_EDATA3.
*/
#define	CAN_EMO220DATA3	(CAN_MO220_EDATA3)

/** \brief  2B90, Message Object  Data Register Low */
#define CAN_MO220_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AB90u)

/** Alias (User Manual Name) for CAN_MO220_EDATA4.
* To use register names with standard convension, please use CAN_MO220_EDATA4.
*/
#define	CAN_EMO220DATA4	(CAN_MO220_EDATA4)

/** \brief  2B94, Message Object  Data Register High */
#define CAN_MO220_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AB94u)

/** Alias (User Manual Name) for CAN_MO220_EDATA5.
* To use register names with standard convension, please use CAN_MO220_EDATA5.
*/
#define	CAN_EMO220DATA5	(CAN_MO220_EDATA5)

/** \brief  2B98, Message Object  Arbitration Register */
#define CAN_MO220_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AB98u)

/** Alias (User Manual Name) for CAN_MO220_EDATA6.
* To use register names with standard convension, please use CAN_MO220_EDATA6.
*/
#define	CAN_EMO220DATA6	(CAN_MO220_EDATA6)

/** \brief  2B80, Message Object  Function Control Register */
#define CAN_MO220_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AB80u)

/** Alias (User Manual Name) for CAN_MO220_FCR.
* To use register names with standard convension, please use CAN_MO220_FCR.
*/
#define	CAN_MOFCR220	(CAN_MO220_FCR)

/** \brief  2B84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO220_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AB84u)

/** Alias (User Manual Name) for CAN_MO220_FGPR.
* To use register names with standard convension, please use CAN_MO220_FGPR.
*/
#define	CAN_MOFGPR220	(CAN_MO220_FGPR)

/** \brief  2B88, Message Object  Interrupt Pointer Register */
#define CAN_MO220_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AB88u)

/** Alias (User Manual Name) for CAN_MO220_IPR.
* To use register names with standard convension, please use CAN_MO220_IPR.
*/
#define	CAN_MOIPR220	(CAN_MO220_IPR)

/** \brief  2B9C, Message Object  Control Register */
#define CAN_MO220_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AB9Cu)

/** Alias (User Manual Name) for CAN_MO220_STAT.
* To use register names with standard convension, please use CAN_MO220_STAT.
*/
#define	CAN_MOSTAT220	(CAN_MO220_STAT)

/** \brief  2BAC, Message Object  Acceptance Mask Register */
#define CAN_MO221_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001ABACu)

