luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO221_AMR.
* To use register names with standard convension, please use CAN_MO221_AMR.
*/
#define	CAN_MOAMR221	(CAN_MO221_AMR)

/** \brief  2BB8, Message Object  Arbitration Register */
#define CAN_MO221_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001ABB8u)

/** Alias (User Manual Name) for CAN_MO221_AR.
* To use register names with standard convension, please use CAN_MO221_AR.
*/
#define	CAN_MOAR221	(CAN_MO221_AR)

/** \brief  2BBC, Message Object  Control Register */
#define CAN_MO221_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001ABBCu)

/** Alias (User Manual Name) for CAN_MO221_CTR.
* To use register names with standard convension, please use CAN_MO221_CTR.
*/
#define	CAN_MOCTR221	(CAN_MO221_CTR)

/** \brief  2BB4, Message Object  Data Register High */
#define CAN_MO221_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001ABB4u)

/** Alias (User Manual Name) for CAN_MO221_DATAH.
* To use register names with standard convension, please use CAN_MO221_DATAH.
*/
#define	CAN_MODATAH221	(CAN_MO221_DATAH)

/** \brief  2BB0, Message Object  Data Register Low */
#define CAN_MO221_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ABB0u)

/** Alias (User Manual Name) for CAN_MO221_DATAL.
* To use register names with standard convension, please use CAN_MO221_DATAL.
*/
#define	CAN_MODATAL221	(CAN_MO221_DATAL)

/** \brief  2BA0, Message Object  Function Control Register */
#define CAN_MO221_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001ABA0u)

/** Alias (User Manual Name) for CAN_MO221_EDATA0.
* To use register names with standard convension, please use CAN_MO221_EDATA0.
*/
#define	CAN_EMO221DATA0	(CAN_MO221_EDATA0)

/** \brief  2BA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO221_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001ABA4u)

/** Alias (User Manual Name) for CAN_MO221_EDATA1.
* To use register names with standard convension, please use CAN_MO221_EDATA1.
*/
#define	CAN_EMO221DATA1	(CAN_MO221_EDATA1)

/** \brief  2BA8, Message Object  Interrupt Pointer Register */
#define CAN_MO221_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001ABA8u)

/** Alias (User Manual Name) for CAN_MO221_EDATA2.
* To use register names with standard convension, please use CAN_MO221_EDATA2.
*/
#define	CAN_EMO221DATA2	(CAN_MO221_EDATA2)

/** \brief  2BAC, Message Object  Acceptance Mask Register */
#define CAN_MO221_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001ABACu)

/** Alias (User Manual Name) for CAN_MO221_EDATA3.
* To use register names with standard convension, please use CAN_MO221_EDATA3.
*/
#define	CAN_EMO221DATA3	(CAN_MO221_EDATA3)

/** \brief  2BB0, Message Object  Data Register Low */
#define CAN_MO221_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001ABB0u)

/** Alias (User Manual Name) for CAN_MO221_EDATA4.
* To use register names with standard convension, please use CAN_MO221_EDATA4.
*/
#define	CAN_EMO221DATA4	(CAN_MO221_EDATA4)

/** \brief  2BB4, Message Object  Data Register High */
#define CAN_MO221_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001ABB4u)

/** Alias (User Manual Name) for CAN_MO221_EDATA5.
* To use register names with standard convension, please use CAN_MO221_EDATA5.
*/
#define	CAN_EMO221DATA5	(CAN_MO221_EDATA5)

/** \brief  2BB8, Message Object  Arbitration Register */
#define CAN_MO221_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001ABB8u)

/** Alias (User Manual Name) for CAN_MO221_EDATA6.
* To use register names with standard convension, please use CAN_MO221_EDATA6.
*/
#define	CAN_EMO221DATA6	(CAN_MO221_EDATA6)

/** \brief  2BA0, Message Object  Function Control Register */
#define CAN_MO221_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ABA0u)

/** Alias (User Manual Name) for CAN_MO221_FCR.
* To use register names with standard convension, please use CAN_MO221_FCR.
*/
#define	CAN_MOFCR221	(CAN_MO221_FCR)

/** \brief  2BA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO221_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ABA4u)

/** Alias (User Manual Name) for CAN_MO221_FGPR.
* To use register names with standard convension, please use CAN_MO221_FGPR.
*/
#define	CAN_MOFGPR221	(CAN_MO221_FGPR)

/** \brief  2BA8, Message Object  Interrupt Pointer Register */
#define CAN_MO221_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ABA8u)

/** Alias (User Manual Name) for CAN_MO221_IPR.
* To use register names with standard convension, please use CAN_MO221_IPR.
*/
#define	CAN_MOIPR221	(CAN_MO221_IPR)

/** \brief  2BBC, Message Object  Control Register */
#define CAN_MO221_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001ABBCu)

/** Alias (User Manual Name) for CAN_MO221_STAT.
* To use register names with standard convension, please use CAN_MO221_STAT.
*/
#define	CAN_MOSTAT221	(CAN_MO221_STAT)

/** \brief  2BCC, Message Object  Acceptance Mask Register */
#define CAN_MO222_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001ABCCu)

/** Alias (User Manual Name) for CAN_MO222_AMR.
* To use register names with standard convension, please use CAN_MO222_AMR.
*/
#define	CAN_MOAMR222	(CAN_MO222_AMR)

/** \brief  2BD8, Message Object  Arbitration Register */
#define CAN_MO222_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001ABD8u)

/** Alias (User Manual Name) for CAN_MO222_AR.
* To use register names with standard convension, please use CAN_MO222_AR.
*/
#define	CAN_MOAR222	(CAN_MO222_AR)

/** \brief  2BDC, Message Object  Control Register */
#define CAN_MO222_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001ABDCu)

/** Alias (User Manual Name) for CAN_MO222_CTR.
* To use register names with standard convension, please use CAN_MO222_CTR.
*/
#define	CAN_MOCTR222	(CAN_MO222_CTR)

/** \brief  2BD4, Message Object  Data Register High */
#define CAN_MO222_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001ABD4u)

/** Alias (User Manual Name) for CAN_MO222_DATAH.
* To use register names with standard convension, please use CAN_MO222_DATAH.
*/
#define	CAN_MODATAH222	(CAN_MO222_DATAH)

/** \brief  2BD0, Message Object  Data Register Low */
#define CAN_MO222_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ABD0u)

/** Alias (User Manual Name) for CAN_MO222_DATAL.
* To use register names with standard convension, please use CAN_MO222_DATAL.
*/
#define	CAN_MODATAL222	(CAN_MO222_DATAL)

/** \brief  2BC0, Message Object  Function Control Register */
#define CAN_MO222_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001ABC0u)

