luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO222_EDATA0.
* To use register names with standard convension, please use CAN_MO222_EDATA0.
*/
#define	CAN_EMO222DATA0	(CAN_MO222_EDATA0)

/** \brief  2BC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO222_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001ABC4u)

/** Alias (User Manual Name) for CAN_MO222_EDATA1.
* To use register names with standard convension, please use CAN_MO222_EDATA1.
*/
#define	CAN_EMO222DATA1	(CAN_MO222_EDATA1)

/** \brief  2BC8, Message Object  Interrupt Pointer Register */
#define CAN_MO222_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001ABC8u)

/** Alias (User Manual Name) for CAN_MO222_EDATA2.
* To use register names with standard convension, please use CAN_MO222_EDATA2.
*/
#define	CAN_EMO222DATA2	(CAN_MO222_EDATA2)

/** \brief  2BCC, Message Object  Acceptance Mask Register */
#define CAN_MO222_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001ABCCu)

/** Alias (User Manual Name) for CAN_MO222_EDATA3.
* To use register names with standard convension, please use CAN_MO222_EDATA3.
*/
#define	CAN_EMO222DATA3	(CAN_MO222_EDATA3)

/** \brief  2BD0, Message Object  Data Register Low */
#define CAN_MO222_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001ABD0u)

/** Alias (User Manual Name) for CAN_MO222_EDATA4.
* To use register names with standard convension, please use CAN_MO222_EDATA4.
*/
#define	CAN_EMO222DATA4	(CAN_MO222_EDATA4)

/** \brief  2BD4, Message Object  Data Register High */
#define CAN_MO222_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001ABD4u)

/** Alias (User Manual Name) for CAN_MO222_EDATA5.
* To use register names with standard convension, please use CAN_MO222_EDATA5.
*/
#define	CAN_EMO222DATA5	(CAN_MO222_EDATA5)

/** \brief  2BD8, Message Object  Arbitration Register */
#define CAN_MO222_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001ABD8u)

/** Alias (User Manual Name) for CAN_MO222_EDATA6.
* To use register names with standard convension, please use CAN_MO222_EDATA6.
*/
#define	CAN_EMO222DATA6	(CAN_MO222_EDATA6)

/** \brief  2BC0, Message Object  Function Control Register */
#define CAN_MO222_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ABC0u)

/** Alias (User Manual Name) for CAN_MO222_FCR.
* To use register names with standard convension, please use CAN_MO222_FCR.
*/
#define	CAN_MOFCR222	(CAN_MO222_FCR)

/** \brief  2BC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO222_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ABC4u)

/** Alias (User Manual Name) for CAN_MO222_FGPR.
* To use register names with standard convension, please use CAN_MO222_FGPR.
*/
#define	CAN_MOFGPR222	(CAN_MO222_FGPR)

/** \brief  2BC8, Message Object  Interrupt Pointer Register */
#define CAN_MO222_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ABC8u)

/** Alias (User Manual Name) for CAN_MO222_IPR.
* To use register names with standard convension, please use CAN_MO222_IPR.
*/
#define	CAN_MOIPR222	(CAN_MO222_IPR)

/** \brief  2BDC, Message Object  Control Register */
#define CAN_MO222_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001ABDCu)

/** Alias (User Manual Name) for CAN_MO222_STAT.
* To use register names with standard convension, please use CAN_MO222_STAT.
*/
#define	CAN_MOSTAT222	(CAN_MO222_STAT)

/** \brief  2BEC, Message Object  Acceptance Mask Register */
#define CAN_MO223_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001ABECu)

/** Alias (User Manual Name) for CAN_MO223_AMR.
* To use register names with standard convension, please use CAN_MO223_AMR.
*/
#define	CAN_MOAMR223	(CAN_MO223_AMR)

/** \brief  2BF8, Message Object  Arbitration Register */
#define CAN_MO223_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001ABF8u)

/** Alias (User Manual Name) for CAN_MO223_AR.
* To use register names with standard convension, please use CAN_MO223_AR.
*/
#define	CAN_MOAR223	(CAN_MO223_AR)

/** \brief  2BFC, Message Object  Control Register */
#define CAN_MO223_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001ABFCu)

/** Alias (User Manual Name) for CAN_MO223_CTR.
* To use register names with standard convension, please use CAN_MO223_CTR.
*/
#define	CAN_MOCTR223	(CAN_MO223_CTR)

/** \brief  2BF4, Message Object  Data Register High */
#define CAN_MO223_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001ABF4u)

/** Alias (User Manual Name) for CAN_MO223_DATAH.
* To use register names with standard convension, please use CAN_MO223_DATAH.
*/
#define	CAN_MODATAH223	(CAN_MO223_DATAH)

/** \brief  2BF0, Message Object  Data Register Low */
#define CAN_MO223_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ABF0u)

/** Alias (User Manual Name) for CAN_MO223_DATAL.
* To use register names with standard convension, please use CAN_MO223_DATAL.
*/
#define	CAN_MODATAL223	(CAN_MO223_DATAL)

/** \brief  2BE0, Message Object  Function Control Register */
#define CAN_MO223_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001ABE0u)

/** Alias (User Manual Name) for CAN_MO223_EDATA0.
* To use register names with standard convension, please use CAN_MO223_EDATA0.
*/
#define	CAN_EMO223DATA0	(CAN_MO223_EDATA0)

/** \brief  2BE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO223_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001ABE4u)

/** Alias (User Manual Name) for CAN_MO223_EDATA1.
* To use register names with standard convension, please use CAN_MO223_EDATA1.
*/
#define	CAN_EMO223DATA1	(CAN_MO223_EDATA1)

/** \brief  2BE8, Message Object  Interrupt Pointer Register */
#define CAN_MO223_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001ABE8u)

/** Alias (User Manual Name) for CAN_MO223_EDATA2.
* To use register names with standard convension, please use CAN_MO223_EDATA2.
*/
#define	CAN_EMO223DATA2	(CAN_MO223_EDATA2)

/** \brief  2BEC, Message Object  Acceptance Mask Register */
#define CAN_MO223_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001ABECu)

