luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO223_EDATA3.
* To use register names with standard convension, please use CAN_MO223_EDATA3.
*/
#define	CAN_EMO223DATA3	(CAN_MO223_EDATA3)

/** \brief  2BF0, Message Object  Data Register Low */
#define CAN_MO223_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001ABF0u)

/** Alias (User Manual Name) for CAN_MO223_EDATA4.
* To use register names with standard convension, please use CAN_MO223_EDATA4.
*/
#define	CAN_EMO223DATA4	(CAN_MO223_EDATA4)

/** \brief  2BF4, Message Object  Data Register High */
#define CAN_MO223_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001ABF4u)

/** Alias (User Manual Name) for CAN_MO223_EDATA5.
* To use register names with standard convension, please use CAN_MO223_EDATA5.
*/
#define	CAN_EMO223DATA5	(CAN_MO223_EDATA5)

/** \brief  2BF8, Message Object  Arbitration Register */
#define CAN_MO223_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001ABF8u)

/** Alias (User Manual Name) for CAN_MO223_EDATA6.
* To use register names with standard convension, please use CAN_MO223_EDATA6.
*/
#define	CAN_EMO223DATA6	(CAN_MO223_EDATA6)

/** \brief  2BE0, Message Object  Function Control Register */
#define CAN_MO223_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ABE0u)

/** Alias (User Manual Name) for CAN_MO223_FCR.
* To use register names with standard convension, please use CAN_MO223_FCR.
*/
#define	CAN_MOFCR223	(CAN_MO223_FCR)

/** \brief  2BE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO223_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ABE4u)

/** Alias (User Manual Name) for CAN_MO223_FGPR.
* To use register names with standard convension, please use CAN_MO223_FGPR.
*/
#define	CAN_MOFGPR223	(CAN_MO223_FGPR)

/** \brief  2BE8, Message Object  Interrupt Pointer Register */
#define CAN_MO223_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ABE8u)

/** Alias (User Manual Name) for CAN_MO223_IPR.
* To use register names with standard convension, please use CAN_MO223_IPR.
*/
#define	CAN_MOIPR223	(CAN_MO223_IPR)

/** \brief  2BFC, Message Object  Control Register */
#define CAN_MO223_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001ABFCu)

/** Alias (User Manual Name) for CAN_MO223_STAT.
* To use register names with standard convension, please use CAN_MO223_STAT.
*/
#define	CAN_MOSTAT223	(CAN_MO223_STAT)

/** \brief  2C0C, Message Object  Acceptance Mask Register */
#define CAN_MO224_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AC0Cu)

/** Alias (User Manual Name) for CAN_MO224_AMR.
* To use register names with standard convension, please use CAN_MO224_AMR.
*/
#define	CAN_MOAMR224	(CAN_MO224_AMR)

/** \brief  2C18, Message Object  Arbitration Register */
#define CAN_MO224_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AC18u)

/** Alias (User Manual Name) for CAN_MO224_AR.
* To use register names with standard convension, please use CAN_MO224_AR.
*/
#define	CAN_MOAR224	(CAN_MO224_AR)

/** \brief  2C1C, Message Object  Control Register */
#define CAN_MO224_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AC1Cu)

/** Alias (User Manual Name) for CAN_MO224_CTR.
* To use register names with standard convension, please use CAN_MO224_CTR.
*/
#define	CAN_MOCTR224	(CAN_MO224_CTR)

/** \brief  2C14, Message Object  Data Register High */
#define CAN_MO224_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AC14u)

/** Alias (User Manual Name) for CAN_MO224_DATAH.
* To use register names with standard convension, please use CAN_MO224_DATAH.
*/
#define	CAN_MODATAH224	(CAN_MO224_DATAH)

/** \brief  2C10, Message Object  Data Register Low */
#define CAN_MO224_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AC10u)

/** Alias (User Manual Name) for CAN_MO224_DATAL.
* To use register names with standard convension, please use CAN_MO224_DATAL.
*/
#define	CAN_MODATAL224	(CAN_MO224_DATAL)

/** \brief  2C00, Message Object  Function Control Register */
#define CAN_MO224_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AC00u)

/** Alias (User Manual Name) for CAN_MO224_EDATA0.
* To use register names with standard convension, please use CAN_MO224_EDATA0.
*/
#define	CAN_EMO224DATA0	(CAN_MO224_EDATA0)

/** \brief  2C04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO224_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AC04u)

/** Alias (User Manual Name) for CAN_MO224_EDATA1.
* To use register names with standard convension, please use CAN_MO224_EDATA1.
*/
#define	CAN_EMO224DATA1	(CAN_MO224_EDATA1)

/** \brief  2C08, Message Object  Interrupt Pointer Register */
#define CAN_MO224_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AC08u)

/** Alias (User Manual Name) for CAN_MO224_EDATA2.
* To use register names with standard convension, please use CAN_MO224_EDATA2.
*/
#define	CAN_EMO224DATA2	(CAN_MO224_EDATA2)

/** \brief  2C0C, Message Object  Acceptance Mask Register */
#define CAN_MO224_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AC0Cu)

/** Alias (User Manual Name) for CAN_MO224_EDATA3.
* To use register names with standard convension, please use CAN_MO224_EDATA3.
*/
#define	CAN_EMO224DATA3	(CAN_MO224_EDATA3)

/** \brief  2C10, Message Object  Data Register Low */
#define CAN_MO224_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AC10u)

/** Alias (User Manual Name) for CAN_MO224_EDATA4.
* To use register names with standard convension, please use CAN_MO224_EDATA4.
*/
#define	CAN_EMO224DATA4	(CAN_MO224_EDATA4)

/** \brief  2C14, Message Object  Data Register High */
#define CAN_MO224_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AC14u)

/** Alias (User Manual Name) for CAN_MO224_EDATA5.
* To use register names with standard convension, please use CAN_MO224_EDATA5.
*/
#define	CAN_EMO224DATA5	(CAN_MO224_EDATA5)

/** \brief  2C18, Message Object  Arbitration Register */
#define CAN_MO224_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AC18u)

