luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO224_EDATA6.
* To use register names with standard convension, please use CAN_MO224_EDATA6.
*/
#define	CAN_EMO224DATA6	(CAN_MO224_EDATA6)

/** \brief  2C00, Message Object  Function Control Register */
#define CAN_MO224_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AC00u)

/** Alias (User Manual Name) for CAN_MO224_FCR.
* To use register names with standard convension, please use CAN_MO224_FCR.
*/
#define	CAN_MOFCR224	(CAN_MO224_FCR)

/** \brief  2C04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO224_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AC04u)

/** Alias (User Manual Name) for CAN_MO224_FGPR.
* To use register names with standard convension, please use CAN_MO224_FGPR.
*/
#define	CAN_MOFGPR224	(CAN_MO224_FGPR)

/** \brief  2C08, Message Object  Interrupt Pointer Register */
#define CAN_MO224_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AC08u)

/** Alias (User Manual Name) for CAN_MO224_IPR.
* To use register names with standard convension, please use CAN_MO224_IPR.
*/
#define	CAN_MOIPR224	(CAN_MO224_IPR)

/** \brief  2C1C, Message Object  Control Register */
#define CAN_MO224_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AC1Cu)

/** Alias (User Manual Name) for CAN_MO224_STAT.
* To use register names with standard convension, please use CAN_MO224_STAT.
*/
#define	CAN_MOSTAT224	(CAN_MO224_STAT)

/** \brief  2C2C, Message Object  Acceptance Mask Register */
#define CAN_MO225_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AC2Cu)

/** Alias (User Manual Name) for CAN_MO225_AMR.
* To use register names with standard convension, please use CAN_MO225_AMR.
*/
#define	CAN_MOAMR225	(CAN_MO225_AMR)

/** \brief  2C38, Message Object  Arbitration Register */
#define CAN_MO225_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AC38u)

/** Alias (User Manual Name) for CAN_MO225_AR.
* To use register names with standard convension, please use CAN_MO225_AR.
*/
#define	CAN_MOAR225	(CAN_MO225_AR)

/** \brief  2C3C, Message Object  Control Register */
#define CAN_MO225_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AC3Cu)

/** Alias (User Manual Name) for CAN_MO225_CTR.
* To use register names with standard convension, please use CAN_MO225_CTR.
*/
#define	CAN_MOCTR225	(CAN_MO225_CTR)

/** \brief  2C34, Message Object  Data Register High */
#define CAN_MO225_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AC34u)

/** Alias (User Manual Name) for CAN_MO225_DATAH.
* To use register names with standard convension, please use CAN_MO225_DATAH.
*/
#define	CAN_MODATAH225	(CAN_MO225_DATAH)

/** \brief  2C30, Message Object  Data Register Low */
#define CAN_MO225_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AC30u)

/** Alias (User Manual Name) for CAN_MO225_DATAL.
* To use register names with standard convension, please use CAN_MO225_DATAL.
*/
#define	CAN_MODATAL225	(CAN_MO225_DATAL)

/** \brief  2C20, Message Object  Function Control Register */
#define CAN_MO225_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AC20u)

/** Alias (User Manual Name) for CAN_MO225_EDATA0.
* To use register names with standard convension, please use CAN_MO225_EDATA0.
*/
#define	CAN_EMO225DATA0	(CAN_MO225_EDATA0)

/** \brief  2C24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO225_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AC24u)

/** Alias (User Manual Name) for CAN_MO225_EDATA1.
* To use register names with standard convension, please use CAN_MO225_EDATA1.
*/
#define	CAN_EMO225DATA1	(CAN_MO225_EDATA1)

/** \brief  2C28, Message Object  Interrupt Pointer Register */
#define CAN_MO225_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AC28u)

/** Alias (User Manual Name) for CAN_MO225_EDATA2.
* To use register names with standard convension, please use CAN_MO225_EDATA2.
*/
#define	CAN_EMO225DATA2	(CAN_MO225_EDATA2)

/** \brief  2C2C, Message Object  Acceptance Mask Register */
#define CAN_MO225_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AC2Cu)

/** Alias (User Manual Name) for CAN_MO225_EDATA3.
* To use register names with standard convension, please use CAN_MO225_EDATA3.
*/
#define	CAN_EMO225DATA3	(CAN_MO225_EDATA3)

/** \brief  2C30, Message Object  Data Register Low */
#define CAN_MO225_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AC30u)

/** Alias (User Manual Name) for CAN_MO225_EDATA4.
* To use register names with standard convension, please use CAN_MO225_EDATA4.
*/
#define	CAN_EMO225DATA4	(CAN_MO225_EDATA4)

/** \brief  2C34, Message Object  Data Register High */
#define CAN_MO225_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AC34u)

/** Alias (User Manual Name) for CAN_MO225_EDATA5.
* To use register names with standard convension, please use CAN_MO225_EDATA5.
*/
#define	CAN_EMO225DATA5	(CAN_MO225_EDATA5)

/** \brief  2C38, Message Object  Arbitration Register */
#define CAN_MO225_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AC38u)

/** Alias (User Manual Name) for CAN_MO225_EDATA6.
* To use register names with standard convension, please use CAN_MO225_EDATA6.
*/
#define	CAN_EMO225DATA6	(CAN_MO225_EDATA6)

/** \brief  2C20, Message Object  Function Control Register */
#define CAN_MO225_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AC20u)

/** Alias (User Manual Name) for CAN_MO225_FCR.
* To use register names with standard convension, please use CAN_MO225_FCR.
*/
#define	CAN_MOFCR225	(CAN_MO225_FCR)

/** \brief  2C24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO225_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AC24u)

/** Alias (User Manual Name) for CAN_MO225_FGPR.
* To use register names with standard convension, please use CAN_MO225_FGPR.
*/
#define	CAN_MOFGPR225	(CAN_MO225_FGPR)

/** \brief  2C28, Message Object  Interrupt Pointer Register */
#define CAN_MO225_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AC28u)

/** Alias (User Manual Name) for CAN_MO225_IPR.
* To use register names with standard convension, please use CAN_MO225_IPR.
*/
#define	CAN_MOIPR225	(CAN_MO225_IPR)

/** \brief  2C3C, Message Object  Control Register */
#define CAN_MO225_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AC3Cu)

/** Alias (User Manual Name) for CAN_MO225_STAT.
* To use register names with standard convension, please use CAN_MO225_STAT.
*/
#define	CAN_MOSTAT225	(CAN_MO225_STAT)

/** \brief  2C4C, Message Object  Acceptance Mask Register */
#define CAN_MO226_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AC4Cu)

