luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO226_AMR.
* To use register names with standard convension, please use CAN_MO226_AMR.
*/
#define	CAN_MOAMR226	(CAN_MO226_AMR)

/** \brief  2C58, Message Object  Arbitration Register */
#define CAN_MO226_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AC58u)

/** Alias (User Manual Name) for CAN_MO226_AR.
* To use register names with standard convension, please use CAN_MO226_AR.
*/
#define	CAN_MOAR226	(CAN_MO226_AR)

/** \brief  2C5C, Message Object  Control Register */
#define CAN_MO226_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AC5Cu)

/** Alias (User Manual Name) for CAN_MO226_CTR.
* To use register names with standard convension, please use CAN_MO226_CTR.
*/
#define	CAN_MOCTR226	(CAN_MO226_CTR)

/** \brief  2C54, Message Object  Data Register High */
#define CAN_MO226_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AC54u)

/** Alias (User Manual Name) for CAN_MO226_DATAH.
* To use register names with standard convension, please use CAN_MO226_DATAH.
*/
#define	CAN_MODATAH226	(CAN_MO226_DATAH)

/** \brief  2C50, Message Object  Data Register Low */
#define CAN_MO226_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AC50u)

/** Alias (User Manual Name) for CAN_MO226_DATAL.
* To use register names with standard convension, please use CAN_MO226_DATAL.
*/
#define	CAN_MODATAL226	(CAN_MO226_DATAL)

/** \brief  2C40, Message Object  Function Control Register */
#define CAN_MO226_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AC40u)

/** Alias (User Manual Name) for CAN_MO226_EDATA0.
* To use register names with standard convension, please use CAN_MO226_EDATA0.
*/
#define	CAN_EMO226DATA0	(CAN_MO226_EDATA0)

/** \brief  2C44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO226_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AC44u)

/** Alias (User Manual Name) for CAN_MO226_EDATA1.
* To use register names with standard convension, please use CAN_MO226_EDATA1.
*/
#define	CAN_EMO226DATA1	(CAN_MO226_EDATA1)

/** \brief  2C48, Message Object  Interrupt Pointer Register */
#define CAN_MO226_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AC48u)

/** Alias (User Manual Name) for CAN_MO226_EDATA2.
* To use register names with standard convension, please use CAN_MO226_EDATA2.
*/
#define	CAN_EMO226DATA2	(CAN_MO226_EDATA2)

/** \brief  2C4C, Message Object  Acceptance Mask Register */
#define CAN_MO226_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AC4Cu)

/** Alias (User Manual Name) for CAN_MO226_EDATA3.
* To use register names with standard convension, please use CAN_MO226_EDATA3.
*/
#define	CAN_EMO226DATA3	(CAN_MO226_EDATA3)

/** \brief  2C50, Message Object  Data Register Low */
#define CAN_MO226_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AC50u)

/** Alias (User Manual Name) for CAN_MO226_EDATA4.
* To use register names with standard convension, please use CAN_MO226_EDATA4.
*/
#define	CAN_EMO226DATA4	(CAN_MO226_EDATA4)

/** \brief  2C54, Message Object  Data Register High */
#define CAN_MO226_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AC54u)

/** Alias (User Manual Name) for CAN_MO226_EDATA5.
* To use register names with standard convension, please use CAN_MO226_EDATA5.
*/
#define	CAN_EMO226DATA5	(CAN_MO226_EDATA5)

/** \brief  2C58, Message Object  Arbitration Register */
#define CAN_MO226_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AC58u)

/** Alias (User Manual Name) for CAN_MO226_EDATA6.
* To use register names with standard convension, please use CAN_MO226_EDATA6.
*/
#define	CAN_EMO226DATA6	(CAN_MO226_EDATA6)

/** \brief  2C40, Message Object  Function Control Register */
#define CAN_MO226_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AC40u)

/** Alias (User Manual Name) for CAN_MO226_FCR.
* To use register names with standard convension, please use CAN_MO226_FCR.
*/
#define	CAN_MOFCR226	(CAN_MO226_FCR)

/** \brief  2C44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO226_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AC44u)

/** Alias (User Manual Name) for CAN_MO226_FGPR.
* To use register names with standard convension, please use CAN_MO226_FGPR.
*/
#define	CAN_MOFGPR226	(CAN_MO226_FGPR)

/** \brief  2C48, Message Object  Interrupt Pointer Register */
#define CAN_MO226_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AC48u)

/** Alias (User Manual Name) for CAN_MO226_IPR.
* To use register names with standard convension, please use CAN_MO226_IPR.
*/
#define	CAN_MOIPR226	(CAN_MO226_IPR)

/** \brief  2C5C, Message Object  Control Register */
#define CAN_MO226_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AC5Cu)

/** Alias (User Manual Name) for CAN_MO226_STAT.
* To use register names with standard convension, please use CAN_MO226_STAT.
*/
#define	CAN_MOSTAT226	(CAN_MO226_STAT)

/** \brief  2C6C, Message Object  Acceptance Mask Register */
#define CAN_MO227_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AC6Cu)

/** Alias (User Manual Name) for CAN_MO227_AMR.
* To use register names with standard convension, please use CAN_MO227_AMR.
*/
#define	CAN_MOAMR227	(CAN_MO227_AMR)

/** \brief  2C78, Message Object  Arbitration Register */
#define CAN_MO227_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AC78u)

/** Alias (User Manual Name) for CAN_MO227_AR.
* To use register names with standard convension, please use CAN_MO227_AR.
*/
#define	CAN_MOAR227	(CAN_MO227_AR)

/** \brief  2C7C, Message Object  Control Register */
#define CAN_MO227_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AC7Cu)

/** Alias (User Manual Name) for CAN_MO227_CTR.
* To use register names with standard convension, please use CAN_MO227_CTR.
*/
#define	CAN_MOCTR227	(CAN_MO227_CTR)

/** \brief  2C74, Message Object  Data Register High */
#define CAN_MO227_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AC74u)

/** Alias (User Manual Name) for CAN_MO227_DATAH.
* To use register names with standard convension, please use CAN_MO227_DATAH.
*/
#define	CAN_MODATAH227	(CAN_MO227_DATAH)

/** \brief  2C70, Message Object  Data Register Low */
#define CAN_MO227_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AC70u)

/** Alias (User Manual Name) for CAN_MO227_DATAL.
* To use register names with standard convension, please use CAN_MO227_DATAL.
*/
#define	CAN_MODATAL227	(CAN_MO227_DATAL)

/** \brief  2C60, Message Object  Function Control Register */
#define CAN_MO227_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AC60u)

/** Alias (User Manual Name) for CAN_MO227_EDATA0.
* To use register names with standard convension, please use CAN_MO227_EDATA0.
*/
#define	CAN_EMO227DATA0	(CAN_MO227_EDATA0)

/** \brief  2C64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO227_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AC64u)

/** Alias (User Manual Name) for CAN_MO227_EDATA1.
* To use register names with standard convension, please use CAN_MO227_EDATA1.
*/
#define	CAN_EMO227DATA1	(CAN_MO227_EDATA1)

