luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2C68, Message Object  Interrupt Pointer Register */
#define CAN_MO227_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AC68u)

/** Alias (User Manual Name) for CAN_MO227_EDATA2.
* To use register names with standard convension, please use CAN_MO227_EDATA2.
*/
#define	CAN_EMO227DATA2	(CAN_MO227_EDATA2)

/** \brief  2C6C, Message Object  Acceptance Mask Register */
#define CAN_MO227_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AC6Cu)

/** Alias (User Manual Name) for CAN_MO227_EDATA3.
* To use register names with standard convension, please use CAN_MO227_EDATA3.
*/
#define	CAN_EMO227DATA3	(CAN_MO227_EDATA3)

/** \brief  2C70, Message Object  Data Register Low */
#define CAN_MO227_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AC70u)

/** Alias (User Manual Name) for CAN_MO227_EDATA4.
* To use register names with standard convension, please use CAN_MO227_EDATA4.
*/
#define	CAN_EMO227DATA4	(CAN_MO227_EDATA4)

/** \brief  2C74, Message Object  Data Register High */
#define CAN_MO227_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AC74u)

/** Alias (User Manual Name) for CAN_MO227_EDATA5.
* To use register names with standard convension, please use CAN_MO227_EDATA5.
*/
#define	CAN_EMO227DATA5	(CAN_MO227_EDATA5)

/** \brief  2C78, Message Object  Arbitration Register */
#define CAN_MO227_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AC78u)

/** Alias (User Manual Name) for CAN_MO227_EDATA6.
* To use register names with standard convension, please use CAN_MO227_EDATA6.
*/
#define	CAN_EMO227DATA6	(CAN_MO227_EDATA6)

/** \brief  2C60, Message Object  Function Control Register */
#define CAN_MO227_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AC60u)

/** Alias (User Manual Name) for CAN_MO227_FCR.
* To use register names with standard convension, please use CAN_MO227_FCR.
*/
#define	CAN_MOFCR227	(CAN_MO227_FCR)

/** \brief  2C64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO227_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AC64u)

/** Alias (User Manual Name) for CAN_MO227_FGPR.
* To use register names with standard convension, please use CAN_MO227_FGPR.
*/
#define	CAN_MOFGPR227	(CAN_MO227_FGPR)

/** \brief  2C68, Message Object  Interrupt Pointer Register */
#define CAN_MO227_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AC68u)

/** Alias (User Manual Name) for CAN_MO227_IPR.
* To use register names with standard convension, please use CAN_MO227_IPR.
*/
#define	CAN_MOIPR227	(CAN_MO227_IPR)

/** \brief  2C7C, Message Object  Control Register */
#define CAN_MO227_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AC7Cu)

/** Alias (User Manual Name) for CAN_MO227_STAT.
* To use register names with standard convension, please use CAN_MO227_STAT.
*/
#define	CAN_MOSTAT227	(CAN_MO227_STAT)

/** \brief  2C8C, Message Object  Acceptance Mask Register */
#define CAN_MO228_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AC8Cu)

/** Alias (User Manual Name) for CAN_MO228_AMR.
* To use register names with standard convension, please use CAN_MO228_AMR.
*/
#define	CAN_MOAMR228	(CAN_MO228_AMR)

/** \brief  2C98, Message Object  Arbitration Register */
#define CAN_MO228_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AC98u)

/** Alias (User Manual Name) for CAN_MO228_AR.
* To use register names with standard convension, please use CAN_MO228_AR.
*/
#define	CAN_MOAR228	(CAN_MO228_AR)

/** \brief  2C9C, Message Object  Control Register */
#define CAN_MO228_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AC9Cu)

/** Alias (User Manual Name) for CAN_MO228_CTR.
* To use register names with standard convension, please use CAN_MO228_CTR.
*/
#define	CAN_MOCTR228	(CAN_MO228_CTR)

/** \brief  2C94, Message Object  Data Register High */
#define CAN_MO228_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AC94u)

/** Alias (User Manual Name) for CAN_MO228_DATAH.
* To use register names with standard convension, please use CAN_MO228_DATAH.
*/
#define	CAN_MODATAH228	(CAN_MO228_DATAH)

/** \brief  2C90, Message Object  Data Register Low */
#define CAN_MO228_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AC90u)

/** Alias (User Manual Name) for CAN_MO228_DATAL.
* To use register names with standard convension, please use CAN_MO228_DATAL.
*/
#define	CAN_MODATAL228	(CAN_MO228_DATAL)

/** \brief  2C80, Message Object  Function Control Register */
#define CAN_MO228_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AC80u)

/** Alias (User Manual Name) for CAN_MO228_EDATA0.
* To use register names with standard convension, please use CAN_MO228_EDATA0.
*/
#define	CAN_EMO228DATA0	(CAN_MO228_EDATA0)

/** \brief  2C84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO228_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AC84u)

/** Alias (User Manual Name) for CAN_MO228_EDATA1.
* To use register names with standard convension, please use CAN_MO228_EDATA1.
*/
#define	CAN_EMO228DATA1	(CAN_MO228_EDATA1)

/** \brief  2C88, Message Object  Interrupt Pointer Register */
#define CAN_MO228_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AC88u)

/** Alias (User Manual Name) for CAN_MO228_EDATA2.
* To use register names with standard convension, please use CAN_MO228_EDATA2.
*/
#define	CAN_EMO228DATA2	(CAN_MO228_EDATA2)

/** \brief  2C8C, Message Object  Acceptance Mask Register */
#define CAN_MO228_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AC8Cu)

/** Alias (User Manual Name) for CAN_MO228_EDATA3.
* To use register names with standard convension, please use CAN_MO228_EDATA3.
*/
#define	CAN_EMO228DATA3	(CAN_MO228_EDATA3)

/** \brief  2C90, Message Object  Data Register Low */
#define CAN_MO228_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AC90u)

/** Alias (User Manual Name) for CAN_MO228_EDATA4.
* To use register names with standard convension, please use CAN_MO228_EDATA4.
*/
#define	CAN_EMO228DATA4	(CAN_MO228_EDATA4)

/** \brief  2C94, Message Object  Data Register High */
#define CAN_MO228_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AC94u)

/** Alias (User Manual Name) for CAN_MO228_EDATA5.
* To use register names with standard convension, please use CAN_MO228_EDATA5.
*/
#define	CAN_EMO228DATA5	(CAN_MO228_EDATA5)

