luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2C98, Message Object  Arbitration Register */
#define CAN_MO228_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AC98u)

/** Alias (User Manual Name) for CAN_MO228_EDATA6.
* To use register names with standard convension, please use CAN_MO228_EDATA6.
*/
#define	CAN_EMO228DATA6	(CAN_MO228_EDATA6)

/** \brief  2C80, Message Object  Function Control Register */
#define CAN_MO228_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AC80u)

/** Alias (User Manual Name) for CAN_MO228_FCR.
* To use register names with standard convension, please use CAN_MO228_FCR.
*/
#define	CAN_MOFCR228	(CAN_MO228_FCR)

/** \brief  2C84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO228_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AC84u)

/** Alias (User Manual Name) for CAN_MO228_FGPR.
* To use register names with standard convension, please use CAN_MO228_FGPR.
*/
#define	CAN_MOFGPR228	(CAN_MO228_FGPR)

/** \brief  2C88, Message Object  Interrupt Pointer Register */
#define CAN_MO228_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AC88u)

/** Alias (User Manual Name) for CAN_MO228_IPR.
* To use register names with standard convension, please use CAN_MO228_IPR.
*/
#define	CAN_MOIPR228	(CAN_MO228_IPR)

/** \brief  2C9C, Message Object  Control Register */
#define CAN_MO228_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AC9Cu)

/** Alias (User Manual Name) for CAN_MO228_STAT.
* To use register names with standard convension, please use CAN_MO228_STAT.
*/
#define	CAN_MOSTAT228	(CAN_MO228_STAT)

/** \brief  2CAC, Message Object  Acceptance Mask Register */
#define CAN_MO229_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001ACACu)

/** Alias (User Manual Name) for CAN_MO229_AMR.
* To use register names with standard convension, please use CAN_MO229_AMR.
*/
#define	CAN_MOAMR229	(CAN_MO229_AMR)

/** \brief  2CB8, Message Object  Arbitration Register */
#define CAN_MO229_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001ACB8u)

/** Alias (User Manual Name) for CAN_MO229_AR.
* To use register names with standard convension, please use CAN_MO229_AR.
*/
#define	CAN_MOAR229	(CAN_MO229_AR)

/** \brief  2CBC, Message Object  Control Register */
#define CAN_MO229_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001ACBCu)

/** Alias (User Manual Name) for CAN_MO229_CTR.
* To use register names with standard convension, please use CAN_MO229_CTR.
*/
#define	CAN_MOCTR229	(CAN_MO229_CTR)

/** \brief  2CB4, Message Object  Data Register High */
#define CAN_MO229_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001ACB4u)

/** Alias (User Manual Name) for CAN_MO229_DATAH.
* To use register names with standard convension, please use CAN_MO229_DATAH.
*/
#define	CAN_MODATAH229	(CAN_MO229_DATAH)

/** \brief  2CB0, Message Object  Data Register Low */
#define CAN_MO229_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ACB0u)

/** Alias (User Manual Name) for CAN_MO229_DATAL.
* To use register names with standard convension, please use CAN_MO229_DATAL.
*/
#define	CAN_MODATAL229	(CAN_MO229_DATAL)

/** \brief  2CA0, Message Object  Function Control Register */
#define CAN_MO229_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001ACA0u)

/** Alias (User Manual Name) for CAN_MO229_EDATA0.
* To use register names with standard convension, please use CAN_MO229_EDATA0.
*/
#define	CAN_EMO229DATA0	(CAN_MO229_EDATA0)

/** \brief  2CA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO229_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001ACA4u)

/** Alias (User Manual Name) for CAN_MO229_EDATA1.
* To use register names with standard convension, please use CAN_MO229_EDATA1.
*/
#define	CAN_EMO229DATA1	(CAN_MO229_EDATA1)

/** \brief  2CA8, Message Object  Interrupt Pointer Register */
#define CAN_MO229_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001ACA8u)

/** Alias (User Manual Name) for CAN_MO229_EDATA2.
* To use register names with standard convension, please use CAN_MO229_EDATA2.
*/
#define	CAN_EMO229DATA2	(CAN_MO229_EDATA2)

/** \brief  2CAC, Message Object  Acceptance Mask Register */
#define CAN_MO229_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001ACACu)

/** Alias (User Manual Name) for CAN_MO229_EDATA3.
* To use register names with standard convension, please use CAN_MO229_EDATA3.
*/
#define	CAN_EMO229DATA3	(CAN_MO229_EDATA3)

/** \brief  2CB0, Message Object  Data Register Low */
#define CAN_MO229_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001ACB0u)

/** Alias (User Manual Name) for CAN_MO229_EDATA4.
* To use register names with standard convension, please use CAN_MO229_EDATA4.
*/
#define	CAN_EMO229DATA4	(CAN_MO229_EDATA4)

/** \brief  2CB4, Message Object  Data Register High */
#define CAN_MO229_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001ACB4u)

/** Alias (User Manual Name) for CAN_MO229_EDATA5.
* To use register names with standard convension, please use CAN_MO229_EDATA5.
*/
#define	CAN_EMO229DATA5	(CAN_MO229_EDATA5)

/** \brief  2CB8, Message Object  Arbitration Register */
#define CAN_MO229_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001ACB8u)

/** Alias (User Manual Name) for CAN_MO229_EDATA6.
* To use register names with standard convension, please use CAN_MO229_EDATA6.
*/
#define	CAN_EMO229DATA6	(CAN_MO229_EDATA6)

/** \brief  2CA0, Message Object  Function Control Register */
#define CAN_MO229_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ACA0u)

/** Alias (User Manual Name) for CAN_MO229_FCR.
* To use register names with standard convension, please use CAN_MO229_FCR.
*/
#define	CAN_MOFCR229	(CAN_MO229_FCR)

/** \brief  2CA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO229_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ACA4u)

/** Alias (User Manual Name) for CAN_MO229_FGPR.
* To use register names with standard convension, please use CAN_MO229_FGPR.
*/
#define	CAN_MOFGPR229	(CAN_MO229_FGPR)

/** \brief  2CA8, Message Object  Interrupt Pointer Register */
#define CAN_MO229_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ACA8u)

/** Alias (User Manual Name) for CAN_MO229_IPR.
* To use register names with standard convension, please use CAN_MO229_IPR.
*/
#define	CAN_MOIPR229	(CAN_MO229_IPR)

