luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2CC0, Message Object  Function Control Register */
#define CAN_MO230_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001ACC0u)

/** Alias (User Manual Name) for CAN_MO230_EDATA0.
* To use register names with standard convension, please use CAN_MO230_EDATA0.
*/
#define	CAN_EMO230DATA0	(CAN_MO230_EDATA0)

/** \brief  2CC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO230_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001ACC4u)

/** Alias (User Manual Name) for CAN_MO230_EDATA1.
* To use register names with standard convension, please use CAN_MO230_EDATA1.
*/
#define	CAN_EMO230DATA1	(CAN_MO230_EDATA1)

/** \brief  2CC8, Message Object  Interrupt Pointer Register */
#define CAN_MO230_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001ACC8u)

/** Alias (User Manual Name) for CAN_MO230_EDATA2.
* To use register names with standard convension, please use CAN_MO230_EDATA2.
*/
#define	CAN_EMO230DATA2	(CAN_MO230_EDATA2)

/** \brief  2CCC, Message Object  Acceptance Mask Register */
#define CAN_MO230_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001ACCCu)

/** Alias (User Manual Name) for CAN_MO230_EDATA3.
* To use register names with standard convension, please use CAN_MO230_EDATA3.
*/
#define	CAN_EMO230DATA3	(CAN_MO230_EDATA3)

/** \brief  2CD0, Message Object  Data Register Low */
#define CAN_MO230_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001ACD0u)

/** Alias (User Manual Name) for CAN_MO230_EDATA4.
* To use register names with standard convension, please use CAN_MO230_EDATA4.
*/
#define	CAN_EMO230DATA4	(CAN_MO230_EDATA4)

/** \brief  2CD4, Message Object  Data Register High */
#define CAN_MO230_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001ACD4u)

/** Alias (User Manual Name) for CAN_MO230_EDATA5.
* To use register names with standard convension, please use CAN_MO230_EDATA5.
*/
#define	CAN_EMO230DATA5	(CAN_MO230_EDATA5)

/** \brief  2CD8, Message Object  Arbitration Register */
#define CAN_MO230_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001ACD8u)

/** Alias (User Manual Name) for CAN_MO230_EDATA6.
* To use register names with standard convension, please use CAN_MO230_EDATA6.
*/
#define	CAN_EMO230DATA6	(CAN_MO230_EDATA6)

/** \brief  2CC0, Message Object  Function Control Register */
#define CAN_MO230_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ACC0u)

/** Alias (User Manual Name) for CAN_MO230_FCR.
* To use register names with standard convension, please use CAN_MO230_FCR.
*/
#define	CAN_MOFCR230	(CAN_MO230_FCR)

/** \brief  2CC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO230_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ACC4u)

/** Alias (User Manual Name) for CAN_MO230_FGPR.
* To use register names with standard convension, please use CAN_MO230_FGPR.
*/
#define	CAN_MOFGPR230	(CAN_MO230_FGPR)

/** \brief  2CC8, Message Object  Interrupt Pointer Register */
#define CAN_MO230_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ACC8u)

/** Alias (User Manual Name) for CAN_MO230_IPR.
* To use register names with standard convension, please use CAN_MO230_IPR.
*/
#define	CAN_MOIPR230	(CAN_MO230_IPR)

/** \brief  2CDC, Message Object  Control Register */
#define CAN_MO230_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001ACDCu)

/** Alias (User Manual Name) for CAN_MO230_STAT.
* To use register names with standard convension, please use CAN_MO230_STAT.
*/
#define	CAN_MOSTAT230	(CAN_MO230_STAT)

/** \brief  2CEC, Message Object  Acceptance Mask Register */
#define CAN_MO231_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001ACECu)

/** Alias (User Manual Name) for CAN_MO231_AMR.
* To use register names with standard convension, please use CAN_MO231_AMR.
*/
#define	CAN_MOAMR231	(CAN_MO231_AMR)

/** \brief  2CF8, Message Object  Arbitration Register */
#define CAN_MO231_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001ACF8u)

/** Alias (User Manual Name) for CAN_MO231_AR.
* To use register names with standard convension, please use CAN_MO231_AR.
*/
#define	CAN_MOAR231	(CAN_MO231_AR)

/** \brief  2CFC, Message Object  Control Register */
#define CAN_MO231_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001ACFCu)

/** Alias (User Manual Name) for CAN_MO231_CTR.
* To use register names with standard convension, please use CAN_MO231_CTR.
*/
#define	CAN_MOCTR231	(CAN_MO231_CTR)

/** \brief  2CF4, Message Object  Data Register High */
#define CAN_MO231_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001ACF4u)

/** Alias (User Manual Name) for CAN_MO231_DATAH.
* To use register names with standard convension, please use CAN_MO231_DATAH.
*/
#define	CAN_MODATAH231	(CAN_MO231_DATAH)

/** \brief  2CF0, Message Object  Data Register Low */
#define CAN_MO231_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ACF0u)

/** Alias (User Manual Name) for CAN_MO231_DATAL.
* To use register names with standard convension, please use CAN_MO231_DATAL.
*/
#define	CAN_MODATAL231	(CAN_MO231_DATAL)

/** \brief  2CE0, Message Object  Function Control Register */
#define CAN_MO231_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001ACE0u)

/** Alias (User Manual Name) for CAN_MO231_EDATA0.
* To use register names with standard convension, please use CAN_MO231_EDATA0.
*/
#define	CAN_EMO231DATA0	(CAN_MO231_EDATA0)

/** \brief  2CE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO231_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001ACE4u)

/** Alias (User Manual Name) for CAN_MO231_EDATA1.
* To use register names with standard convension, please use CAN_MO231_EDATA1.
*/
#define	CAN_EMO231DATA1	(CAN_MO231_EDATA1)

/** \brief  2CE8, Message Object  Interrupt Pointer Register */
#define CAN_MO231_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001ACE8u)

/** Alias (User Manual Name) for CAN_MO231_EDATA2.
* To use register names with standard convension, please use CAN_MO231_EDATA2.
*/
#define	CAN_EMO231DATA2	(CAN_MO231_EDATA2)

