luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2CEC, Message Object  Acceptance Mask Register */
#define CAN_MO231_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001ACECu)

/** Alias (User Manual Name) for CAN_MO231_EDATA3.
* To use register names with standard convension, please use CAN_MO231_EDATA3.
*/
#define	CAN_EMO231DATA3	(CAN_MO231_EDATA3)

/** \brief  2CF0, Message Object  Data Register Low */
#define CAN_MO231_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001ACF0u)

/** Alias (User Manual Name) for CAN_MO231_EDATA4.
* To use register names with standard convension, please use CAN_MO231_EDATA4.
*/
#define	CAN_EMO231DATA4	(CAN_MO231_EDATA4)

/** \brief  2CF4, Message Object  Data Register High */
#define CAN_MO231_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001ACF4u)

/** Alias (User Manual Name) for CAN_MO231_EDATA5.
* To use register names with standard convension, please use CAN_MO231_EDATA5.
*/
#define	CAN_EMO231DATA5	(CAN_MO231_EDATA5)

/** \brief  2CF8, Message Object  Arbitration Register */
#define CAN_MO231_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001ACF8u)

/** Alias (User Manual Name) for CAN_MO231_EDATA6.
* To use register names with standard convension, please use CAN_MO231_EDATA6.
*/
#define	CAN_EMO231DATA6	(CAN_MO231_EDATA6)

/** \brief  2CE0, Message Object  Function Control Register */
#define CAN_MO231_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ACE0u)

/** Alias (User Manual Name) for CAN_MO231_FCR.
* To use register names with standard convension, please use CAN_MO231_FCR.
*/
#define	CAN_MOFCR231	(CAN_MO231_FCR)

/** \brief  2CE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO231_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ACE4u)

/** Alias (User Manual Name) for CAN_MO231_FGPR.
* To use register names with standard convension, please use CAN_MO231_FGPR.
*/
#define	CAN_MOFGPR231	(CAN_MO231_FGPR)

/** \brief  2CE8, Message Object  Interrupt Pointer Register */
#define CAN_MO231_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ACE8u)

/** Alias (User Manual Name) for CAN_MO231_IPR.
* To use register names with standard convension, please use CAN_MO231_IPR.
*/
#define	CAN_MOIPR231	(CAN_MO231_IPR)

/** \brief  2CFC, Message Object  Control Register */
#define CAN_MO231_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001ACFCu)

/** Alias (User Manual Name) for CAN_MO231_STAT.
* To use register names with standard convension, please use CAN_MO231_STAT.
*/
#define	CAN_MOSTAT231	(CAN_MO231_STAT)

/** \brief  2D0C, Message Object  Acceptance Mask Register */
#define CAN_MO232_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AD0Cu)

/** Alias (User Manual Name) for CAN_MO232_AMR.
* To use register names with standard convension, please use CAN_MO232_AMR.
*/
#define	CAN_MOAMR232	(CAN_MO232_AMR)

/** \brief  2D18, Message Object  Arbitration Register */
#define CAN_MO232_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AD18u)

/** Alias (User Manual Name) for CAN_MO232_AR.
* To use register names with standard convension, please use CAN_MO232_AR.
*/
#define	CAN_MOAR232	(CAN_MO232_AR)

/** \brief  2D1C, Message Object  Control Register */
#define CAN_MO232_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AD1Cu)

/** Alias (User Manual Name) for CAN_MO232_CTR.
* To use register names with standard convension, please use CAN_MO232_CTR.
*/
#define	CAN_MOCTR232	(CAN_MO232_CTR)

/** \brief  2D14, Message Object  Data Register High */
#define CAN_MO232_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AD14u)

/** Alias (User Manual Name) for CAN_MO232_DATAH.
* To use register names with standard convension, please use CAN_MO232_DATAH.
*/
#define	CAN_MODATAH232	(CAN_MO232_DATAH)

/** \brief  2D10, Message Object  Data Register Low */
#define CAN_MO232_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AD10u)

/** Alias (User Manual Name) for CAN_MO232_DATAL.
* To use register names with standard convension, please use CAN_MO232_DATAL.
*/
#define	CAN_MODATAL232	(CAN_MO232_DATAL)

/** \brief  2D00, Message Object  Function Control Register */
#define CAN_MO232_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AD00u)

/** Alias (User Manual Name) for CAN_MO232_EDATA0.
* To use register names with standard convension, please use CAN_MO232_EDATA0.
*/
#define	CAN_EMO232DATA0	(CAN_MO232_EDATA0)

/** \brief  2D04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO232_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AD04u)

/** Alias (User Manual Name) for CAN_MO232_EDATA1.
* To use register names with standard convension, please use CAN_MO232_EDATA1.
*/
#define	CAN_EMO232DATA1	(CAN_MO232_EDATA1)

/** \brief  2D08, Message Object  Interrupt Pointer Register */
#define CAN_MO232_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AD08u)

/** Alias (User Manual Name) for CAN_MO232_EDATA2.
* To use register names with standard convension, please use CAN_MO232_EDATA2.
*/
#define	CAN_EMO232DATA2	(CAN_MO232_EDATA2)

/** \brief  2D0C, Message Object  Acceptance Mask Register */
#define CAN_MO232_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AD0Cu)

/** Alias (User Manual Name) for CAN_MO232_EDATA3.
* To use register names with standard convension, please use CAN_MO232_EDATA3.
*/
#define	CAN_EMO232DATA3	(CAN_MO232_EDATA3)

/** \brief  2D10, Message Object  Data Register Low */
#define CAN_MO232_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AD10u)

/** Alias (User Manual Name) for CAN_MO232_EDATA4.
* To use register names with standard convension, please use CAN_MO232_EDATA4.
*/
#define	CAN_EMO232DATA4	(CAN_MO232_EDATA4)

/** \brief  2D14, Message Object  Data Register High */
#define CAN_MO232_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AD14u)

/** Alias (User Manual Name) for CAN_MO232_EDATA5.
* To use register names with standard convension, please use CAN_MO232_EDATA5.
*/
#define	CAN_EMO232DATA5	(CAN_MO232_EDATA5)

/** \brief  2D18, Message Object  Arbitration Register */
#define CAN_MO232_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AD18u)

