luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO232_EDATA6.
* To use register names with standard convension, please use CAN_MO232_EDATA6.
*/
#define	CAN_EMO232DATA6	(CAN_MO232_EDATA6)

/** \brief  2D00, Message Object  Function Control Register */
#define CAN_MO232_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AD00u)

/** Alias (User Manual Name) for CAN_MO232_FCR.
* To use register names with standard convension, please use CAN_MO232_FCR.
*/
#define	CAN_MOFCR232	(CAN_MO232_FCR)

/** \brief  2D04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO232_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AD04u)

/** Alias (User Manual Name) for CAN_MO232_FGPR.
* To use register names with standard convension, please use CAN_MO232_FGPR.
*/
#define	CAN_MOFGPR232	(CAN_MO232_FGPR)

/** \brief  2D08, Message Object  Interrupt Pointer Register */
#define CAN_MO232_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AD08u)

/** Alias (User Manual Name) for CAN_MO232_IPR.
* To use register names with standard convension, please use CAN_MO232_IPR.
*/
#define	CAN_MOIPR232	(CAN_MO232_IPR)

/** \brief  2D1C, Message Object  Control Register */
#define CAN_MO232_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AD1Cu)

/** Alias (User Manual Name) for CAN_MO232_STAT.
* To use register names with standard convension, please use CAN_MO232_STAT.
*/
#define	CAN_MOSTAT232	(CAN_MO232_STAT)

/** \brief  2D2C, Message Object  Acceptance Mask Register */
#define CAN_MO233_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AD2Cu)

/** Alias (User Manual Name) for CAN_MO233_AMR.
* To use register names with standard convension, please use CAN_MO233_AMR.
*/
#define	CAN_MOAMR233	(CAN_MO233_AMR)

/** \brief  2D38, Message Object  Arbitration Register */
#define CAN_MO233_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AD38u)

/** Alias (User Manual Name) for CAN_MO233_AR.
* To use register names with standard convension, please use CAN_MO233_AR.
*/
#define	CAN_MOAR233	(CAN_MO233_AR)

/** \brief  2D3C, Message Object  Control Register */
#define CAN_MO233_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AD3Cu)

/** Alias (User Manual Name) for CAN_MO233_CTR.
* To use register names with standard convension, please use CAN_MO233_CTR.
*/
#define	CAN_MOCTR233	(CAN_MO233_CTR)

/** \brief  2D34, Message Object  Data Register High */
#define CAN_MO233_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AD34u)

/** Alias (User Manual Name) for CAN_MO233_DATAH.
* To use register names with standard convension, please use CAN_MO233_DATAH.
*/
#define	CAN_MODATAH233	(CAN_MO233_DATAH)

/** \brief  2D30, Message Object  Data Register Low */
#define CAN_MO233_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AD30u)

/** Alias (User Manual Name) for CAN_MO233_DATAL.
* To use register names with standard convension, please use CAN_MO233_DATAL.
*/
#define	CAN_MODATAL233	(CAN_MO233_DATAL)

/** \brief  2D20, Message Object  Function Control Register */
#define CAN_MO233_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AD20u)

/** Alias (User Manual Name) for CAN_MO233_EDATA0.
* To use register names with standard convension, please use CAN_MO233_EDATA0.
*/
#define	CAN_EMO233DATA0	(CAN_MO233_EDATA0)

/** \brief  2D24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO233_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AD24u)

/** Alias (User Manual Name) for CAN_MO233_EDATA1.
* To use register names with standard convension, please use CAN_MO233_EDATA1.
*/
#define	CAN_EMO233DATA1	(CAN_MO233_EDATA1)

/** \brief  2D28, Message Object  Interrupt Pointer Register */
#define CAN_MO233_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AD28u)

/** Alias (User Manual Name) for CAN_MO233_EDATA2.
* To use register names with standard convension, please use CAN_MO233_EDATA2.
*/
#define	CAN_EMO233DATA2	(CAN_MO233_EDATA2)

/** \brief  2D2C, Message Object  Acceptance Mask Register */
#define CAN_MO233_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AD2Cu)

/** Alias (User Manual Name) for CAN_MO233_EDATA3.
* To use register names with standard convension, please use CAN_MO233_EDATA3.
*/
#define	CAN_EMO233DATA3	(CAN_MO233_EDATA3)

/** \brief  2D30, Message Object  Data Register Low */
#define CAN_MO233_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AD30u)

/** Alias (User Manual Name) for CAN_MO233_EDATA4.
* To use register names with standard convension, please use CAN_MO233_EDATA4.
*/
#define	CAN_EMO233DATA4	(CAN_MO233_EDATA4)

/** \brief  2D34, Message Object  Data Register High */
#define CAN_MO233_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AD34u)

/** Alias (User Manual Name) for CAN_MO233_EDATA5.
* To use register names with standard convension, please use CAN_MO233_EDATA5.
*/
#define	CAN_EMO233DATA5	(CAN_MO233_EDATA5)

/** \brief  2D38, Message Object  Arbitration Register */
#define CAN_MO233_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AD38u)

/** Alias (User Manual Name) for CAN_MO233_EDATA6.
* To use register names with standard convension, please use CAN_MO233_EDATA6.
*/
#define	CAN_EMO233DATA6	(CAN_MO233_EDATA6)

/** \brief  2D20, Message Object  Function Control Register */
#define CAN_MO233_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AD20u)

/** Alias (User Manual Name) for CAN_MO233_FCR.
* To use register names with standard convension, please use CAN_MO233_FCR.
*/
#define	CAN_MOFCR233	(CAN_MO233_FCR)

/** \brief  2D24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO233_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AD24u)

/** Alias (User Manual Name) for CAN_MO233_FGPR.
* To use register names with standard convension, please use CAN_MO233_FGPR.
*/
#define	CAN_MOFGPR233	(CAN_MO233_FGPR)

/** \brief  2D28, Message Object  Interrupt Pointer Register */
#define CAN_MO233_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AD28u)

/** Alias (User Manual Name) for CAN_MO233_IPR.
* To use register names with standard convension, please use CAN_MO233_IPR.
*/
#define	CAN_MOIPR233	(CAN_MO233_IPR)

