luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2D3C, Message Object  Control Register */
#define CAN_MO233_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AD3Cu)

/** Alias (User Manual Name) for CAN_MO233_STAT.
* To use register names with standard convension, please use CAN_MO233_STAT.
*/
#define	CAN_MOSTAT233	(CAN_MO233_STAT)

/** \brief  2D4C, Message Object  Acceptance Mask Register */
#define CAN_MO234_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AD4Cu)

/** Alias (User Manual Name) for CAN_MO234_AMR.
* To use register names with standard convension, please use CAN_MO234_AMR.
*/
#define	CAN_MOAMR234	(CAN_MO234_AMR)

/** \brief  2D58, Message Object  Arbitration Register */
#define CAN_MO234_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AD58u)

/** Alias (User Manual Name) for CAN_MO234_AR.
* To use register names with standard convension, please use CAN_MO234_AR.
*/
#define	CAN_MOAR234	(CAN_MO234_AR)

/** \brief  2D5C, Message Object  Control Register */
#define CAN_MO234_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AD5Cu)

/** Alias (User Manual Name) for CAN_MO234_CTR.
* To use register names with standard convension, please use CAN_MO234_CTR.
*/
#define	CAN_MOCTR234	(CAN_MO234_CTR)

/** \brief  2D54, Message Object  Data Register High */
#define CAN_MO234_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AD54u)

/** Alias (User Manual Name) for CAN_MO234_DATAH.
* To use register names with standard convension, please use CAN_MO234_DATAH.
*/
#define	CAN_MODATAH234	(CAN_MO234_DATAH)

/** \brief  2D50, Message Object  Data Register Low */
#define CAN_MO234_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AD50u)

/** Alias (User Manual Name) for CAN_MO234_DATAL.
* To use register names with standard convension, please use CAN_MO234_DATAL.
*/
#define	CAN_MODATAL234	(CAN_MO234_DATAL)

/** \brief  2D40, Message Object  Function Control Register */
#define CAN_MO234_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AD40u)

/** Alias (User Manual Name) for CAN_MO234_EDATA0.
* To use register names with standard convension, please use CAN_MO234_EDATA0.
*/
#define	CAN_EMO234DATA0	(CAN_MO234_EDATA0)

/** \brief  2D44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO234_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AD44u)

/** Alias (User Manual Name) for CAN_MO234_EDATA1.
* To use register names with standard convension, please use CAN_MO234_EDATA1.
*/
#define	CAN_EMO234DATA1	(CAN_MO234_EDATA1)

/** \brief  2D48, Message Object  Interrupt Pointer Register */
#define CAN_MO234_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AD48u)

/** Alias (User Manual Name) for CAN_MO234_EDATA2.
* To use register names with standard convension, please use CAN_MO234_EDATA2.
*/
#define	CAN_EMO234DATA2	(CAN_MO234_EDATA2)

/** \brief  2D4C, Message Object  Acceptance Mask Register */
#define CAN_MO234_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AD4Cu)

/** Alias (User Manual Name) for CAN_MO234_EDATA3.
* To use register names with standard convension, please use CAN_MO234_EDATA3.
*/
#define	CAN_EMO234DATA3	(CAN_MO234_EDATA3)

/** \brief  2D50, Message Object  Data Register Low */
#define CAN_MO234_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AD50u)

/** Alias (User Manual Name) for CAN_MO234_EDATA4.
* To use register names with standard convension, please use CAN_MO234_EDATA4.
*/
#define	CAN_EMO234DATA4	(CAN_MO234_EDATA4)

/** \brief  2D54, Message Object  Data Register High */
#define CAN_MO234_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AD54u)

/** Alias (User Manual Name) for CAN_MO234_EDATA5.
* To use register names with standard convension, please use CAN_MO234_EDATA5.
*/
#define	CAN_EMO234DATA5	(CAN_MO234_EDATA5)

/** \brief  2D58, Message Object  Arbitration Register */
#define CAN_MO234_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AD58u)

/** Alias (User Manual Name) for CAN_MO234_EDATA6.
* To use register names with standard convension, please use CAN_MO234_EDATA6.
*/
#define	CAN_EMO234DATA6	(CAN_MO234_EDATA6)

/** \brief  2D40, Message Object  Function Control Register */
#define CAN_MO234_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AD40u)

/** Alias (User Manual Name) for CAN_MO234_FCR.
* To use register names with standard convension, please use CAN_MO234_FCR.
*/
#define	CAN_MOFCR234	(CAN_MO234_FCR)

/** \brief  2D44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO234_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AD44u)

/** Alias (User Manual Name) for CAN_MO234_FGPR.
* To use register names with standard convension, please use CAN_MO234_FGPR.
*/
#define	CAN_MOFGPR234	(CAN_MO234_FGPR)

/** \brief  2D48, Message Object  Interrupt Pointer Register */
#define CAN_MO234_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AD48u)

/** Alias (User Manual Name) for CAN_MO234_IPR.
* To use register names with standard convension, please use CAN_MO234_IPR.
*/
#define	CAN_MOIPR234	(CAN_MO234_IPR)

/** \brief  2D5C, Message Object  Control Register */
#define CAN_MO234_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AD5Cu)

/** Alias (User Manual Name) for CAN_MO234_STAT.
* To use register names with standard convension, please use CAN_MO234_STAT.
*/
#define	CAN_MOSTAT234	(CAN_MO234_STAT)

/** \brief  2D6C, Message Object  Acceptance Mask Register */
#define CAN_MO235_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AD6Cu)

/** Alias (User Manual Name) for CAN_MO235_AMR.
* To use register names with standard convension, please use CAN_MO235_AMR.
*/
#define	CAN_MOAMR235	(CAN_MO235_AMR)

/** \brief  2D78, Message Object  Arbitration Register */
#define CAN_MO235_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AD78u)

/** Alias (User Manual Name) for CAN_MO235_AR.
* To use register names with standard convension, please use CAN_MO235_AR.
*/
#define	CAN_MOAR235	(CAN_MO235_AR)

/** \brief  2D7C, Message Object  Control Register */
#define CAN_MO235_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AD7Cu)

/** Alias (User Manual Name) for CAN_MO235_CTR.
* To use register names with standard convension, please use CAN_MO235_CTR.
*/
#define	CAN_MOCTR235	(CAN_MO235_CTR)

