luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2D74, Message Object  Data Register High */
#define CAN_MO235_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AD74u)

/** Alias (User Manual Name) for CAN_MO235_DATAH.
* To use register names with standard convension, please use CAN_MO235_DATAH.
*/
#define	CAN_MODATAH235	(CAN_MO235_DATAH)

/** \brief  2D70, Message Object  Data Register Low */
#define CAN_MO235_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AD70u)

/** Alias (User Manual Name) for CAN_MO235_DATAL.
* To use register names with standard convension, please use CAN_MO235_DATAL.
*/
#define	CAN_MODATAL235	(CAN_MO235_DATAL)

/** \brief  2D60, Message Object  Function Control Register */
#define CAN_MO235_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AD60u)

/** Alias (User Manual Name) for CAN_MO235_EDATA0.
* To use register names with standard convension, please use CAN_MO235_EDATA0.
*/
#define	CAN_EMO235DATA0	(CAN_MO235_EDATA0)

/** \brief  2D64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO235_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AD64u)

/** Alias (User Manual Name) for CAN_MO235_EDATA1.
* To use register names with standard convension, please use CAN_MO235_EDATA1.
*/
#define	CAN_EMO235DATA1	(CAN_MO235_EDATA1)

/** \brief  2D68, Message Object  Interrupt Pointer Register */
#define CAN_MO235_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AD68u)

/** Alias (User Manual Name) for CAN_MO235_EDATA2.
* To use register names with standard convension, please use CAN_MO235_EDATA2.
*/
#define	CAN_EMO235DATA2	(CAN_MO235_EDATA2)

/** \brief  2D6C, Message Object  Acceptance Mask Register */
#define CAN_MO235_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AD6Cu)

/** Alias (User Manual Name) for CAN_MO235_EDATA3.
* To use register names with standard convension, please use CAN_MO235_EDATA3.
*/
#define	CAN_EMO235DATA3	(CAN_MO235_EDATA3)

/** \brief  2D70, Message Object  Data Register Low */
#define CAN_MO235_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AD70u)

/** Alias (User Manual Name) for CAN_MO235_EDATA4.
* To use register names with standard convension, please use CAN_MO235_EDATA4.
*/
#define	CAN_EMO235DATA4	(CAN_MO235_EDATA4)

/** \brief  2D74, Message Object  Data Register High */
#define CAN_MO235_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AD74u)

/** Alias (User Manual Name) for CAN_MO235_EDATA5.
* To use register names with standard convension, please use CAN_MO235_EDATA5.
*/
#define	CAN_EMO235DATA5	(CAN_MO235_EDATA5)

/** \brief  2D78, Message Object  Arbitration Register */
#define CAN_MO235_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AD78u)

/** Alias (User Manual Name) for CAN_MO235_EDATA6.
* To use register names with standard convension, please use CAN_MO235_EDATA6.
*/
#define	CAN_EMO235DATA6	(CAN_MO235_EDATA6)

/** \brief  2D60, Message Object  Function Control Register */
#define CAN_MO235_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AD60u)

/** Alias (User Manual Name) for CAN_MO235_FCR.
* To use register names with standard convension, please use CAN_MO235_FCR.
*/
#define	CAN_MOFCR235	(CAN_MO235_FCR)

/** \brief  2D64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO235_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AD64u)

/** Alias (User Manual Name) for CAN_MO235_FGPR.
* To use register names with standard convension, please use CAN_MO235_FGPR.
*/
#define	CAN_MOFGPR235	(CAN_MO235_FGPR)

/** \brief  2D68, Message Object  Interrupt Pointer Register */
#define CAN_MO235_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AD68u)

/** Alias (User Manual Name) for CAN_MO235_IPR.
* To use register names with standard convension, please use CAN_MO235_IPR.
*/
#define	CAN_MOIPR235	(CAN_MO235_IPR)

/** \brief  2D7C, Message Object  Control Register */
#define CAN_MO235_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AD7Cu)

/** Alias (User Manual Name) for CAN_MO235_STAT.
* To use register names with standard convension, please use CAN_MO235_STAT.
*/
#define	CAN_MOSTAT235	(CAN_MO235_STAT)

/** \brief  2D8C, Message Object  Acceptance Mask Register */
#define CAN_MO236_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AD8Cu)

/** Alias (User Manual Name) for CAN_MO236_AMR.
* To use register names with standard convension, please use CAN_MO236_AMR.
*/
#define	CAN_MOAMR236	(CAN_MO236_AMR)

/** \brief  2D98, Message Object  Arbitration Register */
#define CAN_MO236_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AD98u)

/** Alias (User Manual Name) for CAN_MO236_AR.
* To use register names with standard convension, please use CAN_MO236_AR.
*/
#define	CAN_MOAR236	(CAN_MO236_AR)

/** \brief  2D9C, Message Object  Control Register */
#define CAN_MO236_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AD9Cu)

/** Alias (User Manual Name) for CAN_MO236_CTR.
* To use register names with standard convension, please use CAN_MO236_CTR.
*/
#define	CAN_MOCTR236	(CAN_MO236_CTR)

/** \brief  2D94, Message Object  Data Register High */
#define CAN_MO236_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AD94u)

/** Alias (User Manual Name) for CAN_MO236_DATAH.
* To use register names with standard convension, please use CAN_MO236_DATAH.
*/
#define	CAN_MODATAH236	(CAN_MO236_DATAH)

/** \brief  2D90, Message Object  Data Register Low */
#define CAN_MO236_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AD90u)

/** Alias (User Manual Name) for CAN_MO236_DATAL.
* To use register names with standard convension, please use CAN_MO236_DATAL.
*/
#define	CAN_MODATAL236	(CAN_MO236_DATAL)

/** \brief  2D80, Message Object  Function Control Register */
#define CAN_MO236_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AD80u)

/** Alias (User Manual Name) for CAN_MO236_EDATA0.
* To use register names with standard convension, please use CAN_MO236_EDATA0.
*/
#define	CAN_EMO236DATA0	(CAN_MO236_EDATA0)

/** \brief  2D84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO236_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AD84u)

/** Alias (User Manual Name) for CAN_MO236_EDATA1.
* To use register names with standard convension, please use CAN_MO236_EDATA1.
*/
#define	CAN_EMO236DATA1	(CAN_MO236_EDATA1)

/** \brief  2D88, Message Object  Interrupt Pointer Register */
#define CAN_MO236_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AD88u)

