luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO236_EDATA2.
* To use register names with standard convension, please use CAN_MO236_EDATA2.
*/
#define	CAN_EMO236DATA2	(CAN_MO236_EDATA2)

/** \brief  2D8C, Message Object  Acceptance Mask Register */
#define CAN_MO236_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AD8Cu)

/** Alias (User Manual Name) for CAN_MO236_EDATA3.
* To use register names with standard convension, please use CAN_MO236_EDATA3.
*/
#define	CAN_EMO236DATA3	(CAN_MO236_EDATA3)

/** \brief  2D90, Message Object  Data Register Low */
#define CAN_MO236_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AD90u)

/** Alias (User Manual Name) for CAN_MO236_EDATA4.
* To use register names with standard convension, please use CAN_MO236_EDATA4.
*/
#define	CAN_EMO236DATA4	(CAN_MO236_EDATA4)

/** \brief  2D94, Message Object  Data Register High */
#define CAN_MO236_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AD94u)

/** Alias (User Manual Name) for CAN_MO236_EDATA5.
* To use register names with standard convension, please use CAN_MO236_EDATA5.
*/
#define	CAN_EMO236DATA5	(CAN_MO236_EDATA5)

/** \brief  2D98, Message Object  Arbitration Register */
#define CAN_MO236_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AD98u)

/** Alias (User Manual Name) for CAN_MO236_EDATA6.
* To use register names with standard convension, please use CAN_MO236_EDATA6.
*/
#define	CAN_EMO236DATA6	(CAN_MO236_EDATA6)

/** \brief  2D80, Message Object  Function Control Register */
#define CAN_MO236_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AD80u)

/** Alias (User Manual Name) for CAN_MO236_FCR.
* To use register names with standard convension, please use CAN_MO236_FCR.
*/
#define	CAN_MOFCR236	(CAN_MO236_FCR)

/** \brief  2D84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO236_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AD84u)

/** Alias (User Manual Name) for CAN_MO236_FGPR.
* To use register names with standard convension, please use CAN_MO236_FGPR.
*/
#define	CAN_MOFGPR236	(CAN_MO236_FGPR)

/** \brief  2D88, Message Object  Interrupt Pointer Register */
#define CAN_MO236_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AD88u)

/** Alias (User Manual Name) for CAN_MO236_IPR.
* To use register names with standard convension, please use CAN_MO236_IPR.
*/
#define	CAN_MOIPR236	(CAN_MO236_IPR)

/** \brief  2D9C, Message Object  Control Register */
#define CAN_MO236_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AD9Cu)

/** Alias (User Manual Name) for CAN_MO236_STAT.
* To use register names with standard convension, please use CAN_MO236_STAT.
*/
#define	CAN_MOSTAT236	(CAN_MO236_STAT)

/** \brief  2DAC, Message Object  Acceptance Mask Register */
#define CAN_MO237_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001ADACu)

/** Alias (User Manual Name) for CAN_MO237_AMR.
* To use register names with standard convension, please use CAN_MO237_AMR.
*/
#define	CAN_MOAMR237	(CAN_MO237_AMR)

/** \brief  2DB8, Message Object  Arbitration Register */
#define CAN_MO237_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001ADB8u)

/** Alias (User Manual Name) for CAN_MO237_AR.
* To use register names with standard convension, please use CAN_MO237_AR.
*/
#define	CAN_MOAR237	(CAN_MO237_AR)

/** \brief  2DBC, Message Object  Control Register */
#define CAN_MO237_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001ADBCu)

/** Alias (User Manual Name) for CAN_MO237_CTR.
* To use register names with standard convension, please use CAN_MO237_CTR.
*/
#define	CAN_MOCTR237	(CAN_MO237_CTR)

/** \brief  2DB4, Message Object  Data Register High */
#define CAN_MO237_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001ADB4u)

/** Alias (User Manual Name) for CAN_MO237_DATAH.
* To use register names with standard convension, please use CAN_MO237_DATAH.
*/
#define	CAN_MODATAH237	(CAN_MO237_DATAH)

/** \brief  2DB0, Message Object  Data Register Low */
#define CAN_MO237_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ADB0u)

/** Alias (User Manual Name) for CAN_MO237_DATAL.
* To use register names with standard convension, please use CAN_MO237_DATAL.
*/
#define	CAN_MODATAL237	(CAN_MO237_DATAL)

/** \brief  2DA0, Message Object  Function Control Register */
#define CAN_MO237_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001ADA0u)

/** Alias (User Manual Name) for CAN_MO237_EDATA0.
* To use register names with standard convension, please use CAN_MO237_EDATA0.
*/
#define	CAN_EMO237DATA0	(CAN_MO237_EDATA0)

/** \brief  2DA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO237_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001ADA4u)

/** Alias (User Manual Name) for CAN_MO237_EDATA1.
* To use register names with standard convension, please use CAN_MO237_EDATA1.
*/
#define	CAN_EMO237DATA1	(CAN_MO237_EDATA1)

/** \brief  2DA8, Message Object  Interrupt Pointer Register */
#define CAN_MO237_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001ADA8u)

/** Alias (User Manual Name) for CAN_MO237_EDATA2.
* To use register names with standard convension, please use CAN_MO237_EDATA2.
*/
#define	CAN_EMO237DATA2	(CAN_MO237_EDATA2)

/** \brief  2DAC, Message Object  Acceptance Mask Register */
#define CAN_MO237_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001ADACu)

/** Alias (User Manual Name) for CAN_MO237_EDATA3.
* To use register names with standard convension, please use CAN_MO237_EDATA3.
*/
#define	CAN_EMO237DATA3	(CAN_MO237_EDATA3)

/** \brief  2DB0, Message Object  Data Register Low */
#define CAN_MO237_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001ADB0u)

/** Alias (User Manual Name) for CAN_MO237_EDATA4.
* To use register names with standard convension, please use CAN_MO237_EDATA4.
*/
#define	CAN_EMO237DATA4	(CAN_MO237_EDATA4)

/** \brief  2DB4, Message Object  Data Register High */
#define CAN_MO237_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001ADB4u)

