luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO237_EDATA5.
* To use register names with standard convension, please use CAN_MO237_EDATA5.
*/
#define	CAN_EMO237DATA5	(CAN_MO237_EDATA5)

/** \brief  2DB8, Message Object  Arbitration Register */
#define CAN_MO237_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001ADB8u)

/** Alias (User Manual Name) for CAN_MO237_EDATA6.
* To use register names with standard convension, please use CAN_MO237_EDATA6.
*/
#define	CAN_EMO237DATA6	(CAN_MO237_EDATA6)

/** \brief  2DA0, Message Object  Function Control Register */
#define CAN_MO237_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ADA0u)

/** Alias (User Manual Name) for CAN_MO237_FCR.
* To use register names with standard convension, please use CAN_MO237_FCR.
*/
#define	CAN_MOFCR237	(CAN_MO237_FCR)

/** \brief  2DA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO237_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ADA4u)

/** Alias (User Manual Name) for CAN_MO237_FGPR.
* To use register names with standard convension, please use CAN_MO237_FGPR.
*/
#define	CAN_MOFGPR237	(CAN_MO237_FGPR)

/** \brief  2DA8, Message Object  Interrupt Pointer Register */
#define CAN_MO237_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ADA8u)

/** Alias (User Manual Name) for CAN_MO237_IPR.
* To use register names with standard convension, please use CAN_MO237_IPR.
*/
#define	CAN_MOIPR237	(CAN_MO237_IPR)

/** \brief  2DBC, Message Object  Control Register */
#define CAN_MO237_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001ADBCu)

/** Alias (User Manual Name) for CAN_MO237_STAT.
* To use register names with standard convension, please use CAN_MO237_STAT.
*/
#define	CAN_MOSTAT237	(CAN_MO237_STAT)

/** \brief  2DCC, Message Object  Acceptance Mask Register */
#define CAN_MO238_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001ADCCu)

/** Alias (User Manual Name) for CAN_MO238_AMR.
* To use register names with standard convension, please use CAN_MO238_AMR.
*/
#define	CAN_MOAMR238	(CAN_MO238_AMR)

/** \brief  2DD8, Message Object  Arbitration Register */
#define CAN_MO238_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001ADD8u)

/** Alias (User Manual Name) for CAN_MO238_AR.
* To use register names with standard convension, please use CAN_MO238_AR.
*/
#define	CAN_MOAR238	(CAN_MO238_AR)

/** \brief  2DDC, Message Object  Control Register */
#define CAN_MO238_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001ADDCu)

/** Alias (User Manual Name) for CAN_MO238_CTR.
* To use register names with standard convension, please use CAN_MO238_CTR.
*/
#define	CAN_MOCTR238	(CAN_MO238_CTR)

/** \brief  2DD4, Message Object  Data Register High */
#define CAN_MO238_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001ADD4u)

/** Alias (User Manual Name) for CAN_MO238_DATAH.
* To use register names with standard convension, please use CAN_MO238_DATAH.
*/
#define	CAN_MODATAH238	(CAN_MO238_DATAH)

/** \brief  2DD0, Message Object  Data Register Low */
#define CAN_MO238_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ADD0u)

/** Alias (User Manual Name) for CAN_MO238_DATAL.
* To use register names with standard convension, please use CAN_MO238_DATAL.
*/
#define	CAN_MODATAL238	(CAN_MO238_DATAL)

/** \brief  2DC0, Message Object  Function Control Register */
#define CAN_MO238_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001ADC0u)

/** Alias (User Manual Name) for CAN_MO238_EDATA0.
* To use register names with standard convension, please use CAN_MO238_EDATA0.
*/
#define	CAN_EMO238DATA0	(CAN_MO238_EDATA0)

/** \brief  2DC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO238_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001ADC4u)

/** Alias (User Manual Name) for CAN_MO238_EDATA1.
* To use register names with standard convension, please use CAN_MO238_EDATA1.
*/
#define	CAN_EMO238DATA1	(CAN_MO238_EDATA1)

/** \brief  2DC8, Message Object  Interrupt Pointer Register */
#define CAN_MO238_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001ADC8u)

/** Alias (User Manual Name) for CAN_MO238_EDATA2.
* To use register names with standard convension, please use CAN_MO238_EDATA2.
*/
#define	CAN_EMO238DATA2	(CAN_MO238_EDATA2)

/** \brief  2DCC, Message Object  Acceptance Mask Register */
#define CAN_MO238_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001ADCCu)

/** Alias (User Manual Name) for CAN_MO238_EDATA3.
* To use register names with standard convension, please use CAN_MO238_EDATA3.
*/
#define	CAN_EMO238DATA3	(CAN_MO238_EDATA3)

/** \brief  2DD0, Message Object  Data Register Low */
#define CAN_MO238_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001ADD0u)

/** Alias (User Manual Name) for CAN_MO238_EDATA4.
* To use register names with standard convension, please use CAN_MO238_EDATA4.
*/
#define	CAN_EMO238DATA4	(CAN_MO238_EDATA4)

/** \brief  2DD4, Message Object  Data Register High */
#define CAN_MO238_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001ADD4u)

/** Alias (User Manual Name) for CAN_MO238_EDATA5.
* To use register names with standard convension, please use CAN_MO238_EDATA5.
*/
#define	CAN_EMO238DATA5	(CAN_MO238_EDATA5)

/** \brief  2DD8, Message Object  Arbitration Register */
#define CAN_MO238_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001ADD8u)

/** Alias (User Manual Name) for CAN_MO238_EDATA6.
* To use register names with standard convension, please use CAN_MO238_EDATA6.
*/
#define	CAN_EMO238DATA6	(CAN_MO238_EDATA6)

/** \brief  2DC0, Message Object  Function Control Register */
#define CAN_MO238_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ADC0u)

/** Alias (User Manual Name) for CAN_MO238_FCR.
* To use register names with standard convension, please use CAN_MO238_FCR.
*/
#define	CAN_MOFCR238	(CAN_MO238_FCR)

/** \brief  2DC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO238_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ADC4u)

/** Alias (User Manual Name) for CAN_MO238_FGPR.
* To use register names with standard convension, please use CAN_MO238_FGPR.
*/
#define	CAN_MOFGPR238	(CAN_MO238_FGPR)

