luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  12E0, Message Object  Function Control Register */
#define CAN_MO23_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00192E0u)

/** Alias (User Manual Name) for CAN_MO23_EDATA0.
* To use register names with standard convension, please use CAN_MO23_EDATA0.
*/
#define	CAN_EMO23DATA0	(CAN_MO23_EDATA0)

/** \brief  12E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO23_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00192E4u)

/** Alias (User Manual Name) for CAN_MO23_EDATA1.
* To use register names with standard convension, please use CAN_MO23_EDATA1.
*/
#define	CAN_EMO23DATA1	(CAN_MO23_EDATA1)

/** \brief  12E8, Message Object  Interrupt Pointer Register */
#define CAN_MO23_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00192E8u)

/** Alias (User Manual Name) for CAN_MO23_EDATA2.
* To use register names with standard convension, please use CAN_MO23_EDATA2.
*/
#define	CAN_EMO23DATA2	(CAN_MO23_EDATA2)

/** \brief  12EC, Message Object  Acceptance Mask Register */
#define CAN_MO23_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00192ECu)

/** Alias (User Manual Name) for CAN_MO23_EDATA3.
* To use register names with standard convension, please use CAN_MO23_EDATA3.
*/
#define	CAN_EMO23DATA3	(CAN_MO23_EDATA3)

/** \brief  12F0, Message Object  Data Register Low */
#define CAN_MO23_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00192F0u)

/** Alias (User Manual Name) for CAN_MO23_EDATA4.
* To use register names with standard convension, please use CAN_MO23_EDATA4.
*/
#define	CAN_EMO23DATA4	(CAN_MO23_EDATA4)

/** \brief  12F4, Message Object  Data Register High */
#define CAN_MO23_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00192F4u)

/** Alias (User Manual Name) for CAN_MO23_EDATA5.
* To use register names with standard convension, please use CAN_MO23_EDATA5.
*/
#define	CAN_EMO23DATA5	(CAN_MO23_EDATA5)

/** \brief  12F8, Message Object  Arbitration Register */
#define CAN_MO23_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00192F8u)

/** Alias (User Manual Name) for CAN_MO23_EDATA6.
* To use register names with standard convension, please use CAN_MO23_EDATA6.
*/
#define	CAN_EMO23DATA6	(CAN_MO23_EDATA6)

/** \brief  12E0, Message Object  Function Control Register */
#define CAN_MO23_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00192E0u)

/** Alias (User Manual Name) for CAN_MO23_FCR.
* To use register names with standard convension, please use CAN_MO23_FCR.
*/
#define	CAN_MOFCR23	(CAN_MO23_FCR)

/** \brief  12E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO23_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00192E4u)

/** Alias (User Manual Name) for CAN_MO23_FGPR.
* To use register names with standard convension, please use CAN_MO23_FGPR.
*/
#define	CAN_MOFGPR23	(CAN_MO23_FGPR)

/** \brief  12E8, Message Object  Interrupt Pointer Register */
#define CAN_MO23_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00192E8u)

/** Alias (User Manual Name) for CAN_MO23_IPR.
* To use register names with standard convension, please use CAN_MO23_IPR.
*/
#define	CAN_MOIPR23	(CAN_MO23_IPR)

/** \brief  12FC, Message Object  Control Register */
#define CAN_MO23_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00192FCu)

/** Alias (User Manual Name) for CAN_MO23_STAT.
* To use register names with standard convension, please use CAN_MO23_STAT.
*/
#define	CAN_MOSTAT23	(CAN_MO23_STAT)

/** \brief  2E0C, Message Object  Acceptance Mask Register */
#define CAN_MO240_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AE0Cu)

/** Alias (User Manual Name) for CAN_MO240_AMR.
* To use register names with standard convension, please use CAN_MO240_AMR.
*/
#define	CAN_MOAMR240	(CAN_MO240_AMR)

/** \brief  2E18, Message Object  Arbitration Register */
#define CAN_MO240_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AE18u)

/** Alias (User Manual Name) for CAN_MO240_AR.
* To use register names with standard convension, please use CAN_MO240_AR.
*/
#define	CAN_MOAR240	(CAN_MO240_AR)

/** \brief  2E1C, Message Object  Control Register */
#define CAN_MO240_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AE1Cu)

/** Alias (User Manual Name) for CAN_MO240_CTR.
* To use register names with standard convension, please use CAN_MO240_CTR.
*/
#define	CAN_MOCTR240	(CAN_MO240_CTR)

/** \brief  2E14, Message Object  Data Register High */
#define CAN_MO240_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AE14u)

/** Alias (User Manual Name) for CAN_MO240_DATAH.
* To use register names with standard convension, please use CAN_MO240_DATAH.
*/
#define	CAN_MODATAH240	(CAN_MO240_DATAH)

/** \brief  2E10, Message Object  Data Register Low */
#define CAN_MO240_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AE10u)

/** Alias (User Manual Name) for CAN_MO240_DATAL.
* To use register names with standard convension, please use CAN_MO240_DATAL.
*/
#define	CAN_MODATAL240	(CAN_MO240_DATAL)

/** \brief  2E00, Message Object  Function Control Register */
#define CAN_MO240_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AE00u)

/** Alias (User Manual Name) for CAN_MO240_EDATA0.
* To use register names with standard convension, please use CAN_MO240_EDATA0.
*/
#define	CAN_EMO240DATA0	(CAN_MO240_EDATA0)

/** \brief  2E04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO240_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AE04u)

/** Alias (User Manual Name) for CAN_MO240_EDATA1.
* To use register names with standard convension, please use CAN_MO240_EDATA1.
*/
#define	CAN_EMO240DATA1	(CAN_MO240_EDATA1)

/** \brief  2E08, Message Object  Interrupt Pointer Register */
#define CAN_MO240_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AE08u)

/** Alias (User Manual Name) for CAN_MO240_EDATA2.
* To use register names with standard convension, please use CAN_MO240_EDATA2.
*/
#define	CAN_EMO240DATA2	(CAN_MO240_EDATA2)

/** \brief  2E0C, Message Object  Acceptance Mask Register */
#define CAN_MO240_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AE0Cu)

/** Alias (User Manual Name) for CAN_MO240_EDATA3.
* To use register names with standard convension, please use CAN_MO240_EDATA3.
*/
#define	CAN_EMO240DATA3	(CAN_MO240_EDATA3)

/** \brief  2E10, Message Object  Data Register Low */
#define CAN_MO240_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AE10u)

/** Alias (User Manual Name) for CAN_MO240_EDATA4.
* To use register names with standard convension, please use CAN_MO240_EDATA4.
*/
#define	CAN_EMO240DATA4	(CAN_MO240_EDATA4)

/** \brief  2E14, Message Object  Data Register High */
#define CAN_MO240_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AE14u)

