luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO240_EDATA5.
* To use register names with standard convension, please use CAN_MO240_EDATA5.
*/
#define	CAN_EMO240DATA5	(CAN_MO240_EDATA5)

/** \brief  2E18, Message Object  Arbitration Register */
#define CAN_MO240_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AE18u)

/** Alias (User Manual Name) for CAN_MO240_EDATA6.
* To use register names with standard convension, please use CAN_MO240_EDATA6.
*/
#define	CAN_EMO240DATA6	(CAN_MO240_EDATA6)

/** \brief  2E00, Message Object  Function Control Register */
#define CAN_MO240_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AE00u)

/** Alias (User Manual Name) for CAN_MO240_FCR.
* To use register names with standard convension, please use CAN_MO240_FCR.
*/
#define	CAN_MOFCR240	(CAN_MO240_FCR)

/** \brief  2E04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO240_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AE04u)

/** Alias (User Manual Name) for CAN_MO240_FGPR.
* To use register names with standard convension, please use CAN_MO240_FGPR.
*/
#define	CAN_MOFGPR240	(CAN_MO240_FGPR)

/** \brief  2E08, Message Object  Interrupt Pointer Register */
#define CAN_MO240_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AE08u)

/** Alias (User Manual Name) for CAN_MO240_IPR.
* To use register names with standard convension, please use CAN_MO240_IPR.
*/
#define	CAN_MOIPR240	(CAN_MO240_IPR)

/** \brief  2E1C, Message Object  Control Register */
#define CAN_MO240_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AE1Cu)

/** Alias (User Manual Name) for CAN_MO240_STAT.
* To use register names with standard convension, please use CAN_MO240_STAT.
*/
#define	CAN_MOSTAT240	(CAN_MO240_STAT)

/** \brief  2E2C, Message Object  Acceptance Mask Register */
#define CAN_MO241_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AE2Cu)

/** Alias (User Manual Name) for CAN_MO241_AMR.
* To use register names with standard convension, please use CAN_MO241_AMR.
*/
#define	CAN_MOAMR241	(CAN_MO241_AMR)

/** \brief  2E38, Message Object  Arbitration Register */
#define CAN_MO241_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AE38u)

/** Alias (User Manual Name) for CAN_MO241_AR.
* To use register names with standard convension, please use CAN_MO241_AR.
*/
#define	CAN_MOAR241	(CAN_MO241_AR)

/** \brief  2E3C, Message Object  Control Register */
#define CAN_MO241_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AE3Cu)

/** Alias (User Manual Name) for CAN_MO241_CTR.
* To use register names with standard convension, please use CAN_MO241_CTR.
*/
#define	CAN_MOCTR241	(CAN_MO241_CTR)

/** \brief  2E34, Message Object  Data Register High */
#define CAN_MO241_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AE34u)

/** Alias (User Manual Name) for CAN_MO241_DATAH.
* To use register names with standard convension, please use CAN_MO241_DATAH.
*/
#define	CAN_MODATAH241	(CAN_MO241_DATAH)

/** \brief  2E30, Message Object  Data Register Low */
#define CAN_MO241_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AE30u)

/** Alias (User Manual Name) for CAN_MO241_DATAL.
* To use register names with standard convension, please use CAN_MO241_DATAL.
*/
#define	CAN_MODATAL241	(CAN_MO241_DATAL)

/** \brief  2E20, Message Object  Function Control Register */
#define CAN_MO241_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AE20u)

/** Alias (User Manual Name) for CAN_MO241_EDATA0.
* To use register names with standard convension, please use CAN_MO241_EDATA0.
*/
#define	CAN_EMO241DATA0	(CAN_MO241_EDATA0)

/** \brief  2E24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO241_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AE24u)

/** Alias (User Manual Name) for CAN_MO241_EDATA1.
* To use register names with standard convension, please use CAN_MO241_EDATA1.
*/
#define	CAN_EMO241DATA1	(CAN_MO241_EDATA1)

/** \brief  2E28, Message Object  Interrupt Pointer Register */
#define CAN_MO241_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AE28u)

/** Alias (User Manual Name) for CAN_MO241_EDATA2.
* To use register names with standard convension, please use CAN_MO241_EDATA2.
*/
#define	CAN_EMO241DATA2	(CAN_MO241_EDATA2)

/** \brief  2E2C, Message Object  Acceptance Mask Register */
#define CAN_MO241_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AE2Cu)

/** Alias (User Manual Name) for CAN_MO241_EDATA3.
* To use register names with standard convension, please use CAN_MO241_EDATA3.
*/
#define	CAN_EMO241DATA3	(CAN_MO241_EDATA3)

/** \brief  2E30, Message Object  Data Register Low */
#define CAN_MO241_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AE30u)

/** Alias (User Manual Name) for CAN_MO241_EDATA4.
* To use register names with standard convension, please use CAN_MO241_EDATA4.
*/
#define	CAN_EMO241DATA4	(CAN_MO241_EDATA4)

/** \brief  2E34, Message Object  Data Register High */
#define CAN_MO241_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AE34u)

/** Alias (User Manual Name) for CAN_MO241_EDATA5.
* To use register names with standard convension, please use CAN_MO241_EDATA5.
*/
#define	CAN_EMO241DATA5	(CAN_MO241_EDATA5)

/** \brief  2E38, Message Object  Arbitration Register */
#define CAN_MO241_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AE38u)

/** Alias (User Manual Name) for CAN_MO241_EDATA6.
* To use register names with standard convension, please use CAN_MO241_EDATA6.
*/
#define	CAN_EMO241DATA6	(CAN_MO241_EDATA6)

/** \brief  2E20, Message Object  Function Control Register */
#define CAN_MO241_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AE20u)

/** Alias (User Manual Name) for CAN_MO241_FCR.
* To use register names with standard convension, please use CAN_MO241_FCR.
*/
#define	CAN_MOFCR241	(CAN_MO241_FCR)

/** \brief  2E24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO241_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AE24u)

/** Alias (User Manual Name) for CAN_MO241_FGPR.
* To use register names with standard convension, please use CAN_MO241_FGPR.
*/
#define	CAN_MOFGPR241	(CAN_MO241_FGPR)

/** \brief  2E28, Message Object  Interrupt Pointer Register */
#define CAN_MO241_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AE28u)

/** Alias (User Manual Name) for CAN_MO241_IPR.
* To use register names with standard convension, please use CAN_MO241_IPR.
*/
#define	CAN_MOIPR241	(CAN_MO241_IPR)

/** \brief  2E3C, Message Object  Control Register */
#define CAN_MO241_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AE3Cu)

/** Alias (User Manual Name) for CAN_MO241_STAT.
* To use register names with standard convension, please use CAN_MO241_STAT.
*/
#define	CAN_MOSTAT241	(CAN_MO241_STAT)

/** \brief  2E4C, Message Object  Acceptance Mask Register */
#define CAN_MO242_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AE4Cu)

