luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO242_AMR.
* To use register names with standard convension, please use CAN_MO242_AMR.
*/
#define	CAN_MOAMR242	(CAN_MO242_AMR)

/** \brief  2E58, Message Object  Arbitration Register */
#define CAN_MO242_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AE58u)

/** Alias (User Manual Name) for CAN_MO242_AR.
* To use register names with standard convension, please use CAN_MO242_AR.
*/
#define	CAN_MOAR242	(CAN_MO242_AR)

/** \brief  2E5C, Message Object  Control Register */
#define CAN_MO242_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AE5Cu)

/** Alias (User Manual Name) for CAN_MO242_CTR.
* To use register names with standard convension, please use CAN_MO242_CTR.
*/
#define	CAN_MOCTR242	(CAN_MO242_CTR)

/** \brief  2E54, Message Object  Data Register High */
#define CAN_MO242_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AE54u)

/** Alias (User Manual Name) for CAN_MO242_DATAH.
* To use register names with standard convension, please use CAN_MO242_DATAH.
*/
#define	CAN_MODATAH242	(CAN_MO242_DATAH)

/** \brief  2E50, Message Object  Data Register Low */
#define CAN_MO242_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AE50u)

/** Alias (User Manual Name) for CAN_MO242_DATAL.
* To use register names with standard convension, please use CAN_MO242_DATAL.
*/
#define	CAN_MODATAL242	(CAN_MO242_DATAL)

/** \brief  2E40, Message Object  Function Control Register */
#define CAN_MO242_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AE40u)

/** Alias (User Manual Name) for CAN_MO242_EDATA0.
* To use register names with standard convension, please use CAN_MO242_EDATA0.
*/
#define	CAN_EMO242DATA0	(CAN_MO242_EDATA0)

/** \brief  2E44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO242_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AE44u)

/** Alias (User Manual Name) for CAN_MO242_EDATA1.
* To use register names with standard convension, please use CAN_MO242_EDATA1.
*/
#define	CAN_EMO242DATA1	(CAN_MO242_EDATA1)

/** \brief  2E48, Message Object  Interrupt Pointer Register */
#define CAN_MO242_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AE48u)

/** Alias (User Manual Name) for CAN_MO242_EDATA2.
* To use register names with standard convension, please use CAN_MO242_EDATA2.
*/
#define	CAN_EMO242DATA2	(CAN_MO242_EDATA2)

/** \brief  2E4C, Message Object  Acceptance Mask Register */
#define CAN_MO242_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AE4Cu)

/** Alias (User Manual Name) for CAN_MO242_EDATA3.
* To use register names with standard convension, please use CAN_MO242_EDATA3.
*/
#define	CAN_EMO242DATA3	(CAN_MO242_EDATA3)

/** \brief  2E50, Message Object  Data Register Low */
#define CAN_MO242_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AE50u)

/** Alias (User Manual Name) for CAN_MO242_EDATA4.
* To use register names with standard convension, please use CAN_MO242_EDATA4.
*/
#define	CAN_EMO242DATA4	(CAN_MO242_EDATA4)

/** \brief  2E54, Message Object  Data Register High */
#define CAN_MO242_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AE54u)

/** Alias (User Manual Name) for CAN_MO242_EDATA5.
* To use register names with standard convension, please use CAN_MO242_EDATA5.
*/
#define	CAN_EMO242DATA5	(CAN_MO242_EDATA5)

/** \brief  2E58, Message Object  Arbitration Register */
#define CAN_MO242_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AE58u)

/** Alias (User Manual Name) for CAN_MO242_EDATA6.
* To use register names with standard convension, please use CAN_MO242_EDATA6.
*/
#define	CAN_EMO242DATA6	(CAN_MO242_EDATA6)

/** \brief  2E40, Message Object  Function Control Register */
#define CAN_MO242_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AE40u)

/** Alias (User Manual Name) for CAN_MO242_FCR.
* To use register names with standard convension, please use CAN_MO242_FCR.
*/
#define	CAN_MOFCR242	(CAN_MO242_FCR)

/** \brief  2E44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO242_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AE44u)

/** Alias (User Manual Name) for CAN_MO242_FGPR.
* To use register names with standard convension, please use CAN_MO242_FGPR.
*/
#define	CAN_MOFGPR242	(CAN_MO242_FGPR)

/** \brief  2E48, Message Object  Interrupt Pointer Register */
#define CAN_MO242_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AE48u)

/** Alias (User Manual Name) for CAN_MO242_IPR.
* To use register names with standard convension, please use CAN_MO242_IPR.
*/
#define	CAN_MOIPR242	(CAN_MO242_IPR)

/** \brief  2E5C, Message Object  Control Register */
#define CAN_MO242_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AE5Cu)

/** Alias (User Manual Name) for CAN_MO242_STAT.
* To use register names with standard convension, please use CAN_MO242_STAT.
*/
#define	CAN_MOSTAT242	(CAN_MO242_STAT)

/** \brief  2E6C, Message Object  Acceptance Mask Register */
#define CAN_MO243_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AE6Cu)

/** Alias (User Manual Name) for CAN_MO243_AMR.
* To use register names with standard convension, please use CAN_MO243_AMR.
*/
#define	CAN_MOAMR243	(CAN_MO243_AMR)

/** \brief  2E78, Message Object  Arbitration Register */
#define CAN_MO243_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AE78u)

/** Alias (User Manual Name) for CAN_MO243_AR.
* To use register names with standard convension, please use CAN_MO243_AR.
*/
#define	CAN_MOAR243	(CAN_MO243_AR)

/** \brief  2E7C, Message Object  Control Register */
#define CAN_MO243_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AE7Cu)

/** Alias (User Manual Name) for CAN_MO243_CTR.
* To use register names with standard convension, please use CAN_MO243_CTR.
*/
#define	CAN_MOCTR243	(CAN_MO243_CTR)

/** \brief  2E74, Message Object  Data Register High */
#define CAN_MO243_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AE74u)

/** Alias (User Manual Name) for CAN_MO243_DATAH.
* To use register names with standard convension, please use CAN_MO243_DATAH.
*/
#define	CAN_MODATAH243	(CAN_MO243_DATAH)

/** \brief  2E70, Message Object  Data Register Low */
#define CAN_MO243_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AE70u)

/** Alias (User Manual Name) for CAN_MO243_DATAL.
* To use register names with standard convension, please use CAN_MO243_DATAL.
*/
#define	CAN_MODATAL243	(CAN_MO243_DATAL)

/** \brief  2E60, Message Object  Function Control Register */
#define CAN_MO243_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AE60u)

