luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO243_EDATA0.
* To use register names with standard convension, please use CAN_MO243_EDATA0.
*/
#define	CAN_EMO243DATA0	(CAN_MO243_EDATA0)

/** \brief  2E64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO243_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AE64u)

/** Alias (User Manual Name) for CAN_MO243_EDATA1.
* To use register names with standard convension, please use CAN_MO243_EDATA1.
*/
#define	CAN_EMO243DATA1	(CAN_MO243_EDATA1)

/** \brief  2E68, Message Object  Interrupt Pointer Register */
#define CAN_MO243_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AE68u)

/** Alias (User Manual Name) for CAN_MO243_EDATA2.
* To use register names with standard convension, please use CAN_MO243_EDATA2.
*/
#define	CAN_EMO243DATA2	(CAN_MO243_EDATA2)

/** \brief  2E6C, Message Object  Acceptance Mask Register */
#define CAN_MO243_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AE6Cu)

/** Alias (User Manual Name) for CAN_MO243_EDATA3.
* To use register names with standard convension, please use CAN_MO243_EDATA3.
*/
#define	CAN_EMO243DATA3	(CAN_MO243_EDATA3)

/** \brief  2E70, Message Object  Data Register Low */
#define CAN_MO243_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AE70u)

/** Alias (User Manual Name) for CAN_MO243_EDATA4.
* To use register names with standard convension, please use CAN_MO243_EDATA4.
*/
#define	CAN_EMO243DATA4	(CAN_MO243_EDATA4)

/** \brief  2E74, Message Object  Data Register High */
#define CAN_MO243_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AE74u)

/** Alias (User Manual Name) for CAN_MO243_EDATA5.
* To use register names with standard convension, please use CAN_MO243_EDATA5.
*/
#define	CAN_EMO243DATA5	(CAN_MO243_EDATA5)

/** \brief  2E78, Message Object  Arbitration Register */
#define CAN_MO243_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AE78u)

/** Alias (User Manual Name) for CAN_MO243_EDATA6.
* To use register names with standard convension, please use CAN_MO243_EDATA6.
*/
#define	CAN_EMO243DATA6	(CAN_MO243_EDATA6)

/** \brief  2E60, Message Object  Function Control Register */
#define CAN_MO243_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AE60u)

/** Alias (User Manual Name) for CAN_MO243_FCR.
* To use register names with standard convension, please use CAN_MO243_FCR.
*/
#define	CAN_MOFCR243	(CAN_MO243_FCR)

/** \brief  2E64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO243_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AE64u)

/** Alias (User Manual Name) for CAN_MO243_FGPR.
* To use register names with standard convension, please use CAN_MO243_FGPR.
*/
#define	CAN_MOFGPR243	(CAN_MO243_FGPR)

/** \brief  2E68, Message Object  Interrupt Pointer Register */
#define CAN_MO243_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AE68u)

/** Alias (User Manual Name) for CAN_MO243_IPR.
* To use register names with standard convension, please use CAN_MO243_IPR.
*/
#define	CAN_MOIPR243	(CAN_MO243_IPR)

/** \brief  2E7C, Message Object  Control Register */
#define CAN_MO243_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AE7Cu)

/** Alias (User Manual Name) for CAN_MO243_STAT.
* To use register names with standard convension, please use CAN_MO243_STAT.
*/
#define	CAN_MOSTAT243	(CAN_MO243_STAT)

/** \brief  2E8C, Message Object  Acceptance Mask Register */
#define CAN_MO244_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AE8Cu)

/** Alias (User Manual Name) for CAN_MO244_AMR.
* To use register names with standard convension, please use CAN_MO244_AMR.
*/
#define	CAN_MOAMR244	(CAN_MO244_AMR)

/** \brief  2E98, Message Object  Arbitration Register */
#define CAN_MO244_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AE98u)

/** Alias (User Manual Name) for CAN_MO244_AR.
* To use register names with standard convension, please use CAN_MO244_AR.
*/
#define	CAN_MOAR244	(CAN_MO244_AR)

/** \brief  2E9C, Message Object  Control Register */
#define CAN_MO244_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AE9Cu)

/** Alias (User Manual Name) for CAN_MO244_CTR.
* To use register names with standard convension, please use CAN_MO244_CTR.
*/
#define	CAN_MOCTR244	(CAN_MO244_CTR)

/** \brief  2E94, Message Object  Data Register High */
#define CAN_MO244_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AE94u)

/** Alias (User Manual Name) for CAN_MO244_DATAH.
* To use register names with standard convension, please use CAN_MO244_DATAH.
*/
#define	CAN_MODATAH244	(CAN_MO244_DATAH)

/** \brief  2E90, Message Object  Data Register Low */
#define CAN_MO244_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AE90u)

/** Alias (User Manual Name) for CAN_MO244_DATAL.
* To use register names with standard convension, please use CAN_MO244_DATAL.
*/
#define	CAN_MODATAL244	(CAN_MO244_DATAL)

/** \brief  2E80, Message Object  Function Control Register */
#define CAN_MO244_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AE80u)

/** Alias (User Manual Name) for CAN_MO244_EDATA0.
* To use register names with standard convension, please use CAN_MO244_EDATA0.
*/
#define	CAN_EMO244DATA0	(CAN_MO244_EDATA0)

/** \brief  2E84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO244_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AE84u)

/** Alias (User Manual Name) for CAN_MO244_EDATA1.
* To use register names with standard convension, please use CAN_MO244_EDATA1.
*/
#define	CAN_EMO244DATA1	(CAN_MO244_EDATA1)

/** \brief  2E88, Message Object  Interrupt Pointer Register */
#define CAN_MO244_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AE88u)

/** Alias (User Manual Name) for CAN_MO244_EDATA2.
* To use register names with standard convension, please use CAN_MO244_EDATA2.
*/
#define	CAN_EMO244DATA2	(CAN_MO244_EDATA2)

/** \brief  2E8C, Message Object  Acceptance Mask Register */
#define CAN_MO244_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AE8Cu)

/** Alias (User Manual Name) for CAN_MO244_EDATA3.
* To use register names with standard convension, please use CAN_MO244_EDATA3.
*/
#define	CAN_EMO244DATA3	(CAN_MO244_EDATA3)

/** \brief  2E90, Message Object  Data Register Low */
#define CAN_MO244_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AE90u)

/** Alias (User Manual Name) for CAN_MO244_EDATA4.
* To use register names with standard convension, please use CAN_MO244_EDATA4.
*/
#define	CAN_EMO244DATA4	(CAN_MO244_EDATA4)

/** \brief  2E94, Message Object  Data Register High */
#define CAN_MO244_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AE94u)

