luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO244_EDATA5.
* To use register names with standard convension, please use CAN_MO244_EDATA5.
*/
#define	CAN_EMO244DATA5	(CAN_MO244_EDATA5)

/** \brief  2E98, Message Object  Arbitration Register */
#define CAN_MO244_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AE98u)

/** Alias (User Manual Name) for CAN_MO244_EDATA6.
* To use register names with standard convension, please use CAN_MO244_EDATA6.
*/
#define	CAN_EMO244DATA6	(CAN_MO244_EDATA6)

/** \brief  2E80, Message Object  Function Control Register */
#define CAN_MO244_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AE80u)

/** Alias (User Manual Name) for CAN_MO244_FCR.
* To use register names with standard convension, please use CAN_MO244_FCR.
*/
#define	CAN_MOFCR244	(CAN_MO244_FCR)

/** \brief  2E84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO244_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AE84u)

/** Alias (User Manual Name) for CAN_MO244_FGPR.
* To use register names with standard convension, please use CAN_MO244_FGPR.
*/
#define	CAN_MOFGPR244	(CAN_MO244_FGPR)

/** \brief  2E88, Message Object  Interrupt Pointer Register */
#define CAN_MO244_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AE88u)

/** Alias (User Manual Name) for CAN_MO244_IPR.
* To use register names with standard convension, please use CAN_MO244_IPR.
*/
#define	CAN_MOIPR244	(CAN_MO244_IPR)

/** \brief  2E9C, Message Object  Control Register */
#define CAN_MO244_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AE9Cu)

/** Alias (User Manual Name) for CAN_MO244_STAT.
* To use register names with standard convension, please use CAN_MO244_STAT.
*/
#define	CAN_MOSTAT244	(CAN_MO244_STAT)

/** \brief  2EAC, Message Object  Acceptance Mask Register */
#define CAN_MO245_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AEACu)

/** Alias (User Manual Name) for CAN_MO245_AMR.
* To use register names with standard convension, please use CAN_MO245_AMR.
*/
#define	CAN_MOAMR245	(CAN_MO245_AMR)

/** \brief  2EB8, Message Object  Arbitration Register */
#define CAN_MO245_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AEB8u)

/** Alias (User Manual Name) for CAN_MO245_AR.
* To use register names with standard convension, please use CAN_MO245_AR.
*/
#define	CAN_MOAR245	(CAN_MO245_AR)

/** \brief  2EBC, Message Object  Control Register */
#define CAN_MO245_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AEBCu)

/** Alias (User Manual Name) for CAN_MO245_CTR.
* To use register names with standard convension, please use CAN_MO245_CTR.
*/
#define	CAN_MOCTR245	(CAN_MO245_CTR)

/** \brief  2EB4, Message Object  Data Register High */
#define CAN_MO245_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AEB4u)

/** Alias (User Manual Name) for CAN_MO245_DATAH.
* To use register names with standard convension, please use CAN_MO245_DATAH.
*/
#define	CAN_MODATAH245	(CAN_MO245_DATAH)

/** \brief  2EB0, Message Object  Data Register Low */
#define CAN_MO245_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AEB0u)

/** Alias (User Manual Name) for CAN_MO245_DATAL.
* To use register names with standard convension, please use CAN_MO245_DATAL.
*/
#define	CAN_MODATAL245	(CAN_MO245_DATAL)

/** \brief  2EA0, Message Object  Function Control Register */
#define CAN_MO245_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AEA0u)

/** Alias (User Manual Name) for CAN_MO245_EDATA0.
* To use register names with standard convension, please use CAN_MO245_EDATA0.
*/
#define	CAN_EMO245DATA0	(CAN_MO245_EDATA0)

/** \brief  2EA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO245_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AEA4u)

/** Alias (User Manual Name) for CAN_MO245_EDATA1.
* To use register names with standard convension, please use CAN_MO245_EDATA1.
*/
#define	CAN_EMO245DATA1	(CAN_MO245_EDATA1)

/** \brief  2EA8, Message Object  Interrupt Pointer Register */
#define CAN_MO245_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AEA8u)

/** Alias (User Manual Name) for CAN_MO245_EDATA2.
* To use register names with standard convension, please use CAN_MO245_EDATA2.
*/
#define	CAN_EMO245DATA2	(CAN_MO245_EDATA2)

/** \brief  2EAC, Message Object  Acceptance Mask Register */
#define CAN_MO245_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AEACu)

/** Alias (User Manual Name) for CAN_MO245_EDATA3.
* To use register names with standard convension, please use CAN_MO245_EDATA3.
*/
#define	CAN_EMO245DATA3	(CAN_MO245_EDATA3)

/** \brief  2EB0, Message Object  Data Register Low */
#define CAN_MO245_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AEB0u)

/** Alias (User Manual Name) for CAN_MO245_EDATA4.
* To use register names with standard convension, please use CAN_MO245_EDATA4.
*/
#define	CAN_EMO245DATA4	(CAN_MO245_EDATA4)

/** \brief  2EB4, Message Object  Data Register High */
#define CAN_MO245_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AEB4u)

/** Alias (User Manual Name) for CAN_MO245_EDATA5.
* To use register names with standard convension, please use CAN_MO245_EDATA5.
*/
#define	CAN_EMO245DATA5	(CAN_MO245_EDATA5)

/** \brief  2EB8, Message Object  Arbitration Register */
#define CAN_MO245_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AEB8u)

/** Alias (User Manual Name) for CAN_MO245_EDATA6.
* To use register names with standard convension, please use CAN_MO245_EDATA6.
*/
#define	CAN_EMO245DATA6	(CAN_MO245_EDATA6)

/** \brief  2EA0, Message Object  Function Control Register */
#define CAN_MO245_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AEA0u)

/** Alias (User Manual Name) for CAN_MO245_FCR.
* To use register names with standard convension, please use CAN_MO245_FCR.
*/
#define	CAN_MOFCR245	(CAN_MO245_FCR)

/** \brief  2EA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO245_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AEA4u)

