luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO245_FGPR.
* To use register names with standard convension, please use CAN_MO245_FGPR.
*/
#define	CAN_MOFGPR245	(CAN_MO245_FGPR)

/** \brief  2EA8, Message Object  Interrupt Pointer Register */
#define CAN_MO245_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AEA8u)

/** Alias (User Manual Name) for CAN_MO245_IPR.
* To use register names with standard convension, please use CAN_MO245_IPR.
*/
#define	CAN_MOIPR245	(CAN_MO245_IPR)

/** \brief  2EBC, Message Object  Control Register */
#define CAN_MO245_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AEBCu)

/** Alias (User Manual Name) for CAN_MO245_STAT.
* To use register names with standard convension, please use CAN_MO245_STAT.
*/
#define	CAN_MOSTAT245	(CAN_MO245_STAT)

/** \brief  2ECC, Message Object  Acceptance Mask Register */
#define CAN_MO246_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AECCu)

/** Alias (User Manual Name) for CAN_MO246_AMR.
* To use register names with standard convension, please use CAN_MO246_AMR.
*/
#define	CAN_MOAMR246	(CAN_MO246_AMR)

/** \brief  2ED8, Message Object  Arbitration Register */
#define CAN_MO246_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AED8u)

/** Alias (User Manual Name) for CAN_MO246_AR.
* To use register names with standard convension, please use CAN_MO246_AR.
*/
#define	CAN_MOAR246	(CAN_MO246_AR)

/** \brief  2EDC, Message Object  Control Register */
#define CAN_MO246_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AEDCu)

/** Alias (User Manual Name) for CAN_MO246_CTR.
* To use register names with standard convension, please use CAN_MO246_CTR.
*/
#define	CAN_MOCTR246	(CAN_MO246_CTR)

/** \brief  2ED4, Message Object  Data Register High */
#define CAN_MO246_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AED4u)

/** Alias (User Manual Name) for CAN_MO246_DATAH.
* To use register names with standard convension, please use CAN_MO246_DATAH.
*/
#define	CAN_MODATAH246	(CAN_MO246_DATAH)

/** \brief  2ED0, Message Object  Data Register Low */
#define CAN_MO246_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AED0u)

/** Alias (User Manual Name) for CAN_MO246_DATAL.
* To use register names with standard convension, please use CAN_MO246_DATAL.
*/
#define	CAN_MODATAL246	(CAN_MO246_DATAL)

/** \brief  2EC0, Message Object  Function Control Register */
#define CAN_MO246_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AEC0u)

/** Alias (User Manual Name) for CAN_MO246_EDATA0.
* To use register names with standard convension, please use CAN_MO246_EDATA0.
*/
#define	CAN_EMO246DATA0	(CAN_MO246_EDATA0)

/** \brief  2EC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO246_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AEC4u)

/** Alias (User Manual Name) for CAN_MO246_EDATA1.
* To use register names with standard convension, please use CAN_MO246_EDATA1.
*/
#define	CAN_EMO246DATA1	(CAN_MO246_EDATA1)

/** \brief  2EC8, Message Object  Interrupt Pointer Register */
#define CAN_MO246_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AEC8u)

/** Alias (User Manual Name) for CAN_MO246_EDATA2.
* To use register names with standard convension, please use CAN_MO246_EDATA2.
*/
#define	CAN_EMO246DATA2	(CAN_MO246_EDATA2)

/** \brief  2ECC, Message Object  Acceptance Mask Register */
#define CAN_MO246_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AECCu)

/** Alias (User Manual Name) for CAN_MO246_EDATA3.
* To use register names with standard convension, please use CAN_MO246_EDATA3.
*/
#define	CAN_EMO246DATA3	(CAN_MO246_EDATA3)

/** \brief  2ED0, Message Object  Data Register Low */
#define CAN_MO246_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AED0u)

/** Alias (User Manual Name) for CAN_MO246_EDATA4.
* To use register names with standard convension, please use CAN_MO246_EDATA4.
*/
#define	CAN_EMO246DATA4	(CAN_MO246_EDATA4)

/** \brief  2ED4, Message Object  Data Register High */
#define CAN_MO246_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AED4u)

/** Alias (User Manual Name) for CAN_MO246_EDATA5.
* To use register names with standard convension, please use CAN_MO246_EDATA5.
*/
#define	CAN_EMO246DATA5	(CAN_MO246_EDATA5)

/** \brief  2ED8, Message Object  Arbitration Register */
#define CAN_MO246_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AED8u)

/** Alias (User Manual Name) for CAN_MO246_EDATA6.
* To use register names with standard convension, please use CAN_MO246_EDATA6.
*/
#define	CAN_EMO246DATA6	(CAN_MO246_EDATA6)

/** \brief  2EC0, Message Object  Function Control Register */
#define CAN_MO246_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AEC0u)

/** Alias (User Manual Name) for CAN_MO246_FCR.
* To use register names with standard convension, please use CAN_MO246_FCR.
*/
#define	CAN_MOFCR246	(CAN_MO246_FCR)

/** \brief  2EC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO246_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AEC4u)

/** Alias (User Manual Name) for CAN_MO246_FGPR.
* To use register names with standard convension, please use CAN_MO246_FGPR.
*/
#define	CAN_MOFGPR246	(CAN_MO246_FGPR)

/** \brief  2EC8, Message Object  Interrupt Pointer Register */
#define CAN_MO246_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AEC8u)

/** Alias (User Manual Name) for CAN_MO246_IPR.
* To use register names with standard convension, please use CAN_MO246_IPR.
*/
#define	CAN_MOIPR246	(CAN_MO246_IPR)

/** \brief  2EDC, Message Object  Control Register */
#define CAN_MO246_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AEDCu)

/** Alias (User Manual Name) for CAN_MO246_STAT.
* To use register names with standard convension, please use CAN_MO246_STAT.
*/
#define	CAN_MOSTAT246	(CAN_MO246_STAT)

/** \brief  2EEC, Message Object  Acceptance Mask Register */
#define CAN_MO247_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AEECu)

/** Alias (User Manual Name) for CAN_MO247_AMR.
* To use register names with standard convension, please use CAN_MO247_AMR.
*/
#define	CAN_MOAMR247	(CAN_MO247_AMR)

/** \brief  2EF8, Message Object  Arbitration Register */
#define CAN_MO247_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AEF8u)

/** Alias (User Manual Name) for CAN_MO247_AR.
* To use register names with standard convension, please use CAN_MO247_AR.
*/
#define	CAN_MOAR247	(CAN_MO247_AR)

/** \brief  2EFC, Message Object  Control Register */
#define CAN_MO247_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AEFCu)

/** Alias (User Manual Name) for CAN_MO247_CTR.
* To use register names with standard convension, please use CAN_MO247_CTR.
*/
#define	CAN_MOCTR247	(CAN_MO247_CTR)

/** \brief  2EF4, Message Object  Data Register High */
#define CAN_MO247_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AEF4u)

/** Alias (User Manual Name) for CAN_MO247_DATAH.
* To use register names with standard convension, please use CAN_MO247_DATAH.
*/
#define	CAN_MODATAH247	(CAN_MO247_DATAH)

