luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2EF0, Message Object  Data Register Low */
#define CAN_MO247_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AEF0u)

/** Alias (User Manual Name) for CAN_MO247_DATAL.
* To use register names with standard convension, please use CAN_MO247_DATAL.
*/
#define	CAN_MODATAL247	(CAN_MO247_DATAL)

/** \brief  2EE0, Message Object  Function Control Register */
#define CAN_MO247_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AEE0u)

/** Alias (User Manual Name) for CAN_MO247_EDATA0.
* To use register names with standard convension, please use CAN_MO247_EDATA0.
*/
#define	CAN_EMO247DATA0	(CAN_MO247_EDATA0)

/** \brief  2EE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO247_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AEE4u)

/** Alias (User Manual Name) for CAN_MO247_EDATA1.
* To use register names with standard convension, please use CAN_MO247_EDATA1.
*/
#define	CAN_EMO247DATA1	(CAN_MO247_EDATA1)

/** \brief  2EE8, Message Object  Interrupt Pointer Register */
#define CAN_MO247_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AEE8u)

/** Alias (User Manual Name) for CAN_MO247_EDATA2.
* To use register names with standard convension, please use CAN_MO247_EDATA2.
*/
#define	CAN_EMO247DATA2	(CAN_MO247_EDATA2)

/** \brief  2EEC, Message Object  Acceptance Mask Register */
#define CAN_MO247_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AEECu)

/** Alias (User Manual Name) for CAN_MO247_EDATA3.
* To use register names with standard convension, please use CAN_MO247_EDATA3.
*/
#define	CAN_EMO247DATA3	(CAN_MO247_EDATA3)

/** \brief  2EF0, Message Object  Data Register Low */
#define CAN_MO247_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AEF0u)

/** Alias (User Manual Name) for CAN_MO247_EDATA4.
* To use register names with standard convension, please use CAN_MO247_EDATA4.
*/
#define	CAN_EMO247DATA4	(CAN_MO247_EDATA4)

/** \brief  2EF4, Message Object  Data Register High */
#define CAN_MO247_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AEF4u)

/** Alias (User Manual Name) for CAN_MO247_EDATA5.
* To use register names with standard convension, please use CAN_MO247_EDATA5.
*/
#define	CAN_EMO247DATA5	(CAN_MO247_EDATA5)

/** \brief  2EF8, Message Object  Arbitration Register */
#define CAN_MO247_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AEF8u)

/** Alias (User Manual Name) for CAN_MO247_EDATA6.
* To use register names with standard convension, please use CAN_MO247_EDATA6.
*/
#define	CAN_EMO247DATA6	(CAN_MO247_EDATA6)

/** \brief  2EE0, Message Object  Function Control Register */
#define CAN_MO247_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AEE0u)

/** Alias (User Manual Name) for CAN_MO247_FCR.
* To use register names with standard convension, please use CAN_MO247_FCR.
*/
#define	CAN_MOFCR247	(CAN_MO247_FCR)

/** \brief  2EE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO247_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AEE4u)

/** Alias (User Manual Name) for CAN_MO247_FGPR.
* To use register names with standard convension, please use CAN_MO247_FGPR.
*/
#define	CAN_MOFGPR247	(CAN_MO247_FGPR)

/** \brief  2EE8, Message Object  Interrupt Pointer Register */
#define CAN_MO247_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AEE8u)

/** Alias (User Manual Name) for CAN_MO247_IPR.
* To use register names with standard convension, please use CAN_MO247_IPR.
*/
#define	CAN_MOIPR247	(CAN_MO247_IPR)

/** \brief  2EFC, Message Object  Control Register */
#define CAN_MO247_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AEFCu)

/** Alias (User Manual Name) for CAN_MO247_STAT.
* To use register names with standard convension, please use CAN_MO247_STAT.
*/
#define	CAN_MOSTAT247	(CAN_MO247_STAT)

/** \brief  2F0C, Message Object  Acceptance Mask Register */
#define CAN_MO248_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AF0Cu)

/** Alias (User Manual Name) for CAN_MO248_AMR.
* To use register names with standard convension, please use CAN_MO248_AMR.
*/
#define	CAN_MOAMR248	(CAN_MO248_AMR)

/** \brief  2F18, Message Object  Arbitration Register */
#define CAN_MO248_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AF18u)

/** Alias (User Manual Name) for CAN_MO248_AR.
* To use register names with standard convension, please use CAN_MO248_AR.
*/
#define	CAN_MOAR248	(CAN_MO248_AR)

/** \brief  2F1C, Message Object  Control Register */
#define CAN_MO248_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AF1Cu)

/** Alias (User Manual Name) for CAN_MO248_CTR.
* To use register names with standard convension, please use CAN_MO248_CTR.
*/
#define	CAN_MOCTR248	(CAN_MO248_CTR)

/** \brief  2F14, Message Object  Data Register High */
#define CAN_MO248_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AF14u)

/** Alias (User Manual Name) for CAN_MO248_DATAH.
* To use register names with standard convension, please use CAN_MO248_DATAH.
*/
#define	CAN_MODATAH248	(CAN_MO248_DATAH)

/** \brief  2F10, Message Object  Data Register Low */
#define CAN_MO248_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AF10u)

/** Alias (User Manual Name) for CAN_MO248_DATAL.
* To use register names with standard convension, please use CAN_MO248_DATAL.
*/
#define	CAN_MODATAL248	(CAN_MO248_DATAL)

/** \brief  2F00, Message Object  Function Control Register */
#define CAN_MO248_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AF00u)

/** Alias (User Manual Name) for CAN_MO248_EDATA0.
* To use register names with standard convension, please use CAN_MO248_EDATA0.
*/
#define	CAN_EMO248DATA0	(CAN_MO248_EDATA0)

/** \brief  2F04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO248_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AF04u)

/** Alias (User Manual Name) for CAN_MO248_EDATA1.
* To use register names with standard convension, please use CAN_MO248_EDATA1.
*/
#define	CAN_EMO248DATA1	(CAN_MO248_EDATA1)

/** \brief  2F08, Message Object  Interrupt Pointer Register */
#define CAN_MO248_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AF08u)

/** Alias (User Manual Name) for CAN_MO248_EDATA2.
* To use register names with standard convension, please use CAN_MO248_EDATA2.
*/
#define	CAN_EMO248DATA2	(CAN_MO248_EDATA2)

/** \brief  2F0C, Message Object  Acceptance Mask Register */
#define CAN_MO248_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AF0Cu)

/** Alias (User Manual Name) for CAN_MO248_EDATA3.
* To use register names with standard convension, please use CAN_MO248_EDATA3.
*/
#define	CAN_EMO248DATA3	(CAN_MO248_EDATA3)

