luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2F10, Message Object  Data Register Low */
#define CAN_MO248_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AF10u)

/** Alias (User Manual Name) for CAN_MO248_EDATA4.
* To use register names with standard convension, please use CAN_MO248_EDATA4.
*/
#define	CAN_EMO248DATA4	(CAN_MO248_EDATA4)

/** \brief  2F14, Message Object  Data Register High */
#define CAN_MO248_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AF14u)

/** Alias (User Manual Name) for CAN_MO248_EDATA5.
* To use register names with standard convension, please use CAN_MO248_EDATA5.
*/
#define	CAN_EMO248DATA5	(CAN_MO248_EDATA5)

/** \brief  2F18, Message Object  Arbitration Register */
#define CAN_MO248_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AF18u)

/** Alias (User Manual Name) for CAN_MO248_EDATA6.
* To use register names with standard convension, please use CAN_MO248_EDATA6.
*/
#define	CAN_EMO248DATA6	(CAN_MO248_EDATA6)

/** \brief  2F00, Message Object  Function Control Register */
#define CAN_MO248_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AF00u)

/** Alias (User Manual Name) for CAN_MO248_FCR.
* To use register names with standard convension, please use CAN_MO248_FCR.
*/
#define	CAN_MOFCR248	(CAN_MO248_FCR)

/** \brief  2F04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO248_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AF04u)

/** Alias (User Manual Name) for CAN_MO248_FGPR.
* To use register names with standard convension, please use CAN_MO248_FGPR.
*/
#define	CAN_MOFGPR248	(CAN_MO248_FGPR)

/** \brief  2F08, Message Object  Interrupt Pointer Register */
#define CAN_MO248_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AF08u)

/** Alias (User Manual Name) for CAN_MO248_IPR.
* To use register names with standard convension, please use CAN_MO248_IPR.
*/
#define	CAN_MOIPR248	(CAN_MO248_IPR)

/** \brief  2F1C, Message Object  Control Register */
#define CAN_MO248_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AF1Cu)

/** Alias (User Manual Name) for CAN_MO248_STAT.
* To use register names with standard convension, please use CAN_MO248_STAT.
*/
#define	CAN_MOSTAT248	(CAN_MO248_STAT)

/** \brief  2F2C, Message Object  Acceptance Mask Register */
#define CAN_MO249_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AF2Cu)

/** Alias (User Manual Name) for CAN_MO249_AMR.
* To use register names with standard convension, please use CAN_MO249_AMR.
*/
#define	CAN_MOAMR249	(CAN_MO249_AMR)

/** \brief  2F38, Message Object  Arbitration Register */
#define CAN_MO249_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AF38u)

/** Alias (User Manual Name) for CAN_MO249_AR.
* To use register names with standard convension, please use CAN_MO249_AR.
*/
#define	CAN_MOAR249	(CAN_MO249_AR)

/** \brief  2F3C, Message Object  Control Register */
#define CAN_MO249_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AF3Cu)

/** Alias (User Manual Name) for CAN_MO249_CTR.
* To use register names with standard convension, please use CAN_MO249_CTR.
*/
#define	CAN_MOCTR249	(CAN_MO249_CTR)

/** \brief  2F34, Message Object  Data Register High */
#define CAN_MO249_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AF34u)

/** Alias (User Manual Name) for CAN_MO249_DATAH.
* To use register names with standard convension, please use CAN_MO249_DATAH.
*/
#define	CAN_MODATAH249	(CAN_MO249_DATAH)

/** \brief  2F30, Message Object  Data Register Low */
#define CAN_MO249_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AF30u)

/** Alias (User Manual Name) for CAN_MO249_DATAL.
* To use register names with standard convension, please use CAN_MO249_DATAL.
*/
#define	CAN_MODATAL249	(CAN_MO249_DATAL)

/** \brief  2F20, Message Object  Function Control Register */
#define CAN_MO249_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AF20u)

/** Alias (User Manual Name) for CAN_MO249_EDATA0.
* To use register names with standard convension, please use CAN_MO249_EDATA0.
*/
#define	CAN_EMO249DATA0	(CAN_MO249_EDATA0)

/** \brief  2F24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO249_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AF24u)

/** Alias (User Manual Name) for CAN_MO249_EDATA1.
* To use register names with standard convension, please use CAN_MO249_EDATA1.
*/
#define	CAN_EMO249DATA1	(CAN_MO249_EDATA1)

/** \brief  2F28, Message Object  Interrupt Pointer Register */
#define CAN_MO249_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AF28u)

/** Alias (User Manual Name) for CAN_MO249_EDATA2.
* To use register names with standard convension, please use CAN_MO249_EDATA2.
*/
#define	CAN_EMO249DATA2	(CAN_MO249_EDATA2)

/** \brief  2F2C, Message Object  Acceptance Mask Register */
#define CAN_MO249_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AF2Cu)

/** Alias (User Manual Name) for CAN_MO249_EDATA3.
* To use register names with standard convension, please use CAN_MO249_EDATA3.
*/
#define	CAN_EMO249DATA3	(CAN_MO249_EDATA3)

/** \brief  2F30, Message Object  Data Register Low */
#define CAN_MO249_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AF30u)

/** Alias (User Manual Name) for CAN_MO249_EDATA4.
* To use register names with standard convension, please use CAN_MO249_EDATA4.
*/
#define	CAN_EMO249DATA4	(CAN_MO249_EDATA4)

/** \brief  2F34, Message Object  Data Register High */
#define CAN_MO249_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AF34u)

/** Alias (User Manual Name) for CAN_MO249_EDATA5.
* To use register names with standard convension, please use CAN_MO249_EDATA5.
*/
#define	CAN_EMO249DATA5	(CAN_MO249_EDATA5)

/** \brief  2F38, Message Object  Arbitration Register */
#define CAN_MO249_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AF38u)

/** Alias (User Manual Name) for CAN_MO249_EDATA6.
* To use register names with standard convension, please use CAN_MO249_EDATA6.
*/
#define	CAN_EMO249DATA6	(CAN_MO249_EDATA6)

/** \brief  2F20, Message Object  Function Control Register */
#define CAN_MO249_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AF20u)

