luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2F58, Message Object  Arbitration Register */
#define CAN_MO250_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AF58u)

/** Alias (User Manual Name) for CAN_MO250_AR.
* To use register names with standard convension, please use CAN_MO250_AR.
*/
#define	CAN_MOAR250	(CAN_MO250_AR)

/** \brief  2F5C, Message Object  Control Register */
#define CAN_MO250_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AF5Cu)

/** Alias (User Manual Name) for CAN_MO250_CTR.
* To use register names with standard convension, please use CAN_MO250_CTR.
*/
#define	CAN_MOCTR250	(CAN_MO250_CTR)

/** \brief  2F54, Message Object  Data Register High */
#define CAN_MO250_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AF54u)

/** Alias (User Manual Name) for CAN_MO250_DATAH.
* To use register names with standard convension, please use CAN_MO250_DATAH.
*/
#define	CAN_MODATAH250	(CAN_MO250_DATAH)

/** \brief  2F50, Message Object  Data Register Low */
#define CAN_MO250_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AF50u)

/** Alias (User Manual Name) for CAN_MO250_DATAL.
* To use register names with standard convension, please use CAN_MO250_DATAL.
*/
#define	CAN_MODATAL250	(CAN_MO250_DATAL)

/** \brief  2F40, Message Object  Function Control Register */
#define CAN_MO250_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AF40u)

/** Alias (User Manual Name) for CAN_MO250_EDATA0.
* To use register names with standard convension, please use CAN_MO250_EDATA0.
*/
#define	CAN_EMO250DATA0	(CAN_MO250_EDATA0)

/** \brief  2F44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO250_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AF44u)

/** Alias (User Manual Name) for CAN_MO250_EDATA1.
* To use register names with standard convension, please use CAN_MO250_EDATA1.
*/
#define	CAN_EMO250DATA1	(CAN_MO250_EDATA1)

/** \brief  2F48, Message Object  Interrupt Pointer Register */
#define CAN_MO250_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AF48u)

/** Alias (User Manual Name) for CAN_MO250_EDATA2.
* To use register names with standard convension, please use CAN_MO250_EDATA2.
*/
#define	CAN_EMO250DATA2	(CAN_MO250_EDATA2)

/** \brief  2F4C, Message Object  Acceptance Mask Register */
#define CAN_MO250_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AF4Cu)

/** Alias (User Manual Name) for CAN_MO250_EDATA3.
* To use register names with standard convension, please use CAN_MO250_EDATA3.
*/
#define	CAN_EMO250DATA3	(CAN_MO250_EDATA3)

/** \brief  2F50, Message Object  Data Register Low */
#define CAN_MO250_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AF50u)

/** Alias (User Manual Name) for CAN_MO250_EDATA4.
* To use register names with standard convension, please use CAN_MO250_EDATA4.
*/
#define	CAN_EMO250DATA4	(CAN_MO250_EDATA4)

/** \brief  2F54, Message Object  Data Register High */
#define CAN_MO250_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AF54u)

/** Alias (User Manual Name) for CAN_MO250_EDATA5.
* To use register names with standard convension, please use CAN_MO250_EDATA5.
*/
#define	CAN_EMO250DATA5	(CAN_MO250_EDATA5)

/** \brief  2F58, Message Object  Arbitration Register */
#define CAN_MO250_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AF58u)

/** Alias (User Manual Name) for CAN_MO250_EDATA6.
* To use register names with standard convension, please use CAN_MO250_EDATA6.
*/
#define	CAN_EMO250DATA6	(CAN_MO250_EDATA6)

/** \brief  2F40, Message Object  Function Control Register */
#define CAN_MO250_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AF40u)

/** Alias (User Manual Name) for CAN_MO250_FCR.
* To use register names with standard convension, please use CAN_MO250_FCR.
*/
#define	CAN_MOFCR250	(CAN_MO250_FCR)

/** \brief  2F44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO250_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AF44u)

/** Alias (User Manual Name) for CAN_MO250_FGPR.
* To use register names with standard convension, please use CAN_MO250_FGPR.
*/
#define	CAN_MOFGPR250	(CAN_MO250_FGPR)

/** \brief  2F48, Message Object  Interrupt Pointer Register */
#define CAN_MO250_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AF48u)

/** Alias (User Manual Name) for CAN_MO250_IPR.
* To use register names with standard convension, please use CAN_MO250_IPR.
*/
#define	CAN_MOIPR250	(CAN_MO250_IPR)

/** \brief  2F5C, Message Object  Control Register */
#define CAN_MO250_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AF5Cu)

/** Alias (User Manual Name) for CAN_MO250_STAT.
* To use register names with standard convension, please use CAN_MO250_STAT.
*/
#define	CAN_MOSTAT250	(CAN_MO250_STAT)

/** \brief  2F6C, Message Object  Acceptance Mask Register */
#define CAN_MO251_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AF6Cu)

/** Alias (User Manual Name) for CAN_MO251_AMR.
* To use register names with standard convension, please use CAN_MO251_AMR.
*/
#define	CAN_MOAMR251	(CAN_MO251_AMR)

/** \brief  2F78, Message Object  Arbitration Register */
#define CAN_MO251_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AF78u)

/** Alias (User Manual Name) for CAN_MO251_AR.
* To use register names with standard convension, please use CAN_MO251_AR.
*/
#define	CAN_MOAR251	(CAN_MO251_AR)

/** \brief  2F7C, Message Object  Control Register */
#define CAN_MO251_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AF7Cu)

/** Alias (User Manual Name) for CAN_MO251_CTR.
* To use register names with standard convension, please use CAN_MO251_CTR.
*/
#define	CAN_MOCTR251	(CAN_MO251_CTR)

/** \brief  2F74, Message Object  Data Register High */
#define CAN_MO251_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AF74u)

/** Alias (User Manual Name) for CAN_MO251_DATAH.
* To use register names with standard convension, please use CAN_MO251_DATAH.
*/
#define	CAN_MODATAH251	(CAN_MO251_DATAH)

/** \brief  2F70, Message Object  Data Register Low */
#define CAN_MO251_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AF70u)

/** Alias (User Manual Name) for CAN_MO251_DATAL.
* To use register names with standard convension, please use CAN_MO251_DATAL.
*/
#define	CAN_MODATAL251	(CAN_MO251_DATAL)

/** \brief  2F60, Message Object  Function Control Register */
#define CAN_MO251_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AF60u)

