luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO251_EDATA0.
* To use register names with standard convension, please use CAN_MO251_EDATA0.
*/
#define	CAN_EMO251DATA0	(CAN_MO251_EDATA0)

/** \brief  2F64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO251_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AF64u)

/** Alias (User Manual Name) for CAN_MO251_EDATA1.
* To use register names with standard convension, please use CAN_MO251_EDATA1.
*/
#define	CAN_EMO251DATA1	(CAN_MO251_EDATA1)

/** \brief  2F68, Message Object  Interrupt Pointer Register */
#define CAN_MO251_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AF68u)

/** Alias (User Manual Name) for CAN_MO251_EDATA2.
* To use register names with standard convension, please use CAN_MO251_EDATA2.
*/
#define	CAN_EMO251DATA2	(CAN_MO251_EDATA2)

/** \brief  2F6C, Message Object  Acceptance Mask Register */
#define CAN_MO251_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AF6Cu)

/** Alias (User Manual Name) for CAN_MO251_EDATA3.
* To use register names with standard convension, please use CAN_MO251_EDATA3.
*/
#define	CAN_EMO251DATA3	(CAN_MO251_EDATA3)

/** \brief  2F70, Message Object  Data Register Low */
#define CAN_MO251_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AF70u)

/** Alias (User Manual Name) for CAN_MO251_EDATA4.
* To use register names with standard convension, please use CAN_MO251_EDATA4.
*/
#define	CAN_EMO251DATA4	(CAN_MO251_EDATA4)

/** \brief  2F74, Message Object  Data Register High */
#define CAN_MO251_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AF74u)

/** Alias (User Manual Name) for CAN_MO251_EDATA5.
* To use register names with standard convension, please use CAN_MO251_EDATA5.
*/
#define	CAN_EMO251DATA5	(CAN_MO251_EDATA5)

/** \brief  2F78, Message Object  Arbitration Register */
#define CAN_MO251_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AF78u)

/** Alias (User Manual Name) for CAN_MO251_EDATA6.
* To use register names with standard convension, please use CAN_MO251_EDATA6.
*/
#define	CAN_EMO251DATA6	(CAN_MO251_EDATA6)

/** \brief  2F60, Message Object  Function Control Register */
#define CAN_MO251_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AF60u)

/** Alias (User Manual Name) for CAN_MO251_FCR.
* To use register names with standard convension, please use CAN_MO251_FCR.
*/
#define	CAN_MOFCR251	(CAN_MO251_FCR)

/** \brief  2F64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO251_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AF64u)

/** Alias (User Manual Name) for CAN_MO251_FGPR.
* To use register names with standard convension, please use CAN_MO251_FGPR.
*/
#define	CAN_MOFGPR251	(CAN_MO251_FGPR)

/** \brief  2F68, Message Object  Interrupt Pointer Register */
#define CAN_MO251_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AF68u)

/** Alias (User Manual Name) for CAN_MO251_IPR.
* To use register names with standard convension, please use CAN_MO251_IPR.
*/
#define	CAN_MOIPR251	(CAN_MO251_IPR)

/** \brief  2F7C, Message Object  Control Register */
#define CAN_MO251_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AF7Cu)

/** Alias (User Manual Name) for CAN_MO251_STAT.
* To use register names with standard convension, please use CAN_MO251_STAT.
*/
#define	CAN_MOSTAT251	(CAN_MO251_STAT)

/** \brief  2F8C, Message Object  Acceptance Mask Register */
#define CAN_MO252_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AF8Cu)

/** Alias (User Manual Name) for CAN_MO252_AMR.
* To use register names with standard convension, please use CAN_MO252_AMR.
*/
#define	CAN_MOAMR252	(CAN_MO252_AMR)

/** \brief  2F98, Message Object  Arbitration Register */
#define CAN_MO252_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AF98u)

/** Alias (User Manual Name) for CAN_MO252_AR.
* To use register names with standard convension, please use CAN_MO252_AR.
*/
#define	CAN_MOAR252	(CAN_MO252_AR)

/** \brief  2F9C, Message Object  Control Register */
#define CAN_MO252_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AF9Cu)

/** Alias (User Manual Name) for CAN_MO252_CTR.
* To use register names with standard convension, please use CAN_MO252_CTR.
*/
#define	CAN_MOCTR252	(CAN_MO252_CTR)

/** \brief  2F94, Message Object  Data Register High */
#define CAN_MO252_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AF94u)

/** Alias (User Manual Name) for CAN_MO252_DATAH.
* To use register names with standard convension, please use CAN_MO252_DATAH.
*/
#define	CAN_MODATAH252	(CAN_MO252_DATAH)

/** \brief  2F90, Message Object  Data Register Low */
#define CAN_MO252_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AF90u)

/** Alias (User Manual Name) for CAN_MO252_DATAL.
* To use register names with standard convension, please use CAN_MO252_DATAL.
*/
#define	CAN_MODATAL252	(CAN_MO252_DATAL)

/** \brief  2F80, Message Object  Function Control Register */
#define CAN_MO252_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AF80u)

/** Alias (User Manual Name) for CAN_MO252_EDATA0.
* To use register names with standard convension, please use CAN_MO252_EDATA0.
*/
#define	CAN_EMO252DATA0	(CAN_MO252_EDATA0)

/** \brief  2F84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO252_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AF84u)

/** Alias (User Manual Name) for CAN_MO252_EDATA1.
* To use register names with standard convension, please use CAN_MO252_EDATA1.
*/
#define	CAN_EMO252DATA1	(CAN_MO252_EDATA1)

/** \brief  2F88, Message Object  Interrupt Pointer Register */
#define CAN_MO252_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AF88u)

/** Alias (User Manual Name) for CAN_MO252_EDATA2.
* To use register names with standard convension, please use CAN_MO252_EDATA2.
*/
#define	CAN_EMO252DATA2	(CAN_MO252_EDATA2)

/** \brief  2F8C, Message Object  Acceptance Mask Register */
#define CAN_MO252_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AF8Cu)

/** Alias (User Manual Name) for CAN_MO252_EDATA3.
* To use register names with standard convension, please use CAN_MO252_EDATA3.
*/
#define	CAN_EMO252DATA3	(CAN_MO252_EDATA3)

/** \brief  2F90, Message Object  Data Register Low */
#define CAN_MO252_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AF90u)

/** Alias (User Manual Name) for CAN_MO252_EDATA4.
* To use register names with standard convension, please use CAN_MO252_EDATA4.
*/
#define	CAN_EMO252DATA4	(CAN_MO252_EDATA4)

