luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2F94, Message Object  Data Register High */
#define CAN_MO252_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AF94u)

/** Alias (User Manual Name) for CAN_MO252_EDATA5.
* To use register names with standard convension, please use CAN_MO252_EDATA5.
*/
#define	CAN_EMO252DATA5	(CAN_MO252_EDATA5)

/** \brief  2F98, Message Object  Arbitration Register */
#define CAN_MO252_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AF98u)

/** Alias (User Manual Name) for CAN_MO252_EDATA6.
* To use register names with standard convension, please use CAN_MO252_EDATA6.
*/
#define	CAN_EMO252DATA6	(CAN_MO252_EDATA6)

/** \brief  2F80, Message Object  Function Control Register */
#define CAN_MO252_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AF80u)

/** Alias (User Manual Name) for CAN_MO252_FCR.
* To use register names with standard convension, please use CAN_MO252_FCR.
*/
#define	CAN_MOFCR252	(CAN_MO252_FCR)

/** \brief  2F84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO252_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AF84u)

/** Alias (User Manual Name) for CAN_MO252_FGPR.
* To use register names with standard convension, please use CAN_MO252_FGPR.
*/
#define	CAN_MOFGPR252	(CAN_MO252_FGPR)

/** \brief  2F88, Message Object  Interrupt Pointer Register */
#define CAN_MO252_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AF88u)

/** Alias (User Manual Name) for CAN_MO252_IPR.
* To use register names with standard convension, please use CAN_MO252_IPR.
*/
#define	CAN_MOIPR252	(CAN_MO252_IPR)

/** \brief  2F9C, Message Object  Control Register */
#define CAN_MO252_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AF9Cu)

/** Alias (User Manual Name) for CAN_MO252_STAT.
* To use register names with standard convension, please use CAN_MO252_STAT.
*/
#define	CAN_MOSTAT252	(CAN_MO252_STAT)

/** \brief  2FAC, Message Object  Acceptance Mask Register */
#define CAN_MO253_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AFACu)

/** Alias (User Manual Name) for CAN_MO253_AMR.
* To use register names with standard convension, please use CAN_MO253_AMR.
*/
#define	CAN_MOAMR253	(CAN_MO253_AMR)

/** \brief  2FB8, Message Object  Arbitration Register */
#define CAN_MO253_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AFB8u)

/** Alias (User Manual Name) for CAN_MO253_AR.
* To use register names with standard convension, please use CAN_MO253_AR.
*/
#define	CAN_MOAR253	(CAN_MO253_AR)

/** \brief  2FBC, Message Object  Control Register */
#define CAN_MO253_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AFBCu)

/** Alias (User Manual Name) for CAN_MO253_CTR.
* To use register names with standard convension, please use CAN_MO253_CTR.
*/
#define	CAN_MOCTR253	(CAN_MO253_CTR)

/** \brief  2FB4, Message Object  Data Register High */
#define CAN_MO253_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AFB4u)

/** Alias (User Manual Name) for CAN_MO253_DATAH.
* To use register names with standard convension, please use CAN_MO253_DATAH.
*/
#define	CAN_MODATAH253	(CAN_MO253_DATAH)

/** \brief  2FB0, Message Object  Data Register Low */
#define CAN_MO253_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AFB0u)

/** Alias (User Manual Name) for CAN_MO253_DATAL.
* To use register names with standard convension, please use CAN_MO253_DATAL.
*/
#define	CAN_MODATAL253	(CAN_MO253_DATAL)

/** \brief  2FA0, Message Object  Function Control Register */
#define CAN_MO253_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AFA0u)

/** Alias (User Manual Name) for CAN_MO253_EDATA0.
* To use register names with standard convension, please use CAN_MO253_EDATA0.
*/
#define	CAN_EMO253DATA0	(CAN_MO253_EDATA0)

/** \brief  2FA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO253_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AFA4u)

/** Alias (User Manual Name) for CAN_MO253_EDATA1.
* To use register names with standard convension, please use CAN_MO253_EDATA1.
*/
#define	CAN_EMO253DATA1	(CAN_MO253_EDATA1)

/** \brief  2FA8, Message Object  Interrupt Pointer Register */
#define CAN_MO253_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AFA8u)

/** Alias (User Manual Name) for CAN_MO253_EDATA2.
* To use register names with standard convension, please use CAN_MO253_EDATA2.
*/
#define	CAN_EMO253DATA2	(CAN_MO253_EDATA2)

/** \brief  2FAC, Message Object  Acceptance Mask Register */
#define CAN_MO253_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AFACu)

/** Alias (User Manual Name) for CAN_MO253_EDATA3.
* To use register names with standard convension, please use CAN_MO253_EDATA3.
*/
#define	CAN_EMO253DATA3	(CAN_MO253_EDATA3)

/** \brief  2FB0, Message Object  Data Register Low */
#define CAN_MO253_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AFB0u)

/** Alias (User Manual Name) for CAN_MO253_EDATA4.
* To use register names with standard convension, please use CAN_MO253_EDATA4.
*/
#define	CAN_EMO253DATA4	(CAN_MO253_EDATA4)

/** \brief  2FB4, Message Object  Data Register High */
#define CAN_MO253_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AFB4u)

/** Alias (User Manual Name) for CAN_MO253_EDATA5.
* To use register names with standard convension, please use CAN_MO253_EDATA5.
*/
#define	CAN_EMO253DATA5	(CAN_MO253_EDATA5)

/** \brief  2FB8, Message Object  Arbitration Register */
#define CAN_MO253_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AFB8u)

/** Alias (User Manual Name) for CAN_MO253_EDATA6.
* To use register names with standard convension, please use CAN_MO253_EDATA6.
*/
#define	CAN_EMO253DATA6	(CAN_MO253_EDATA6)

/** \brief  2FA0, Message Object  Function Control Register */
#define CAN_MO253_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AFA0u)

/** Alias (User Manual Name) for CAN_MO253_FCR.
* To use register names with standard convension, please use CAN_MO253_FCR.
*/
#define	CAN_MOFCR253	(CAN_MO253_FCR)

