luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2FA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO253_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AFA4u)

/** Alias (User Manual Name) for CAN_MO253_FGPR.
* To use register names with standard convension, please use CAN_MO253_FGPR.
*/
#define	CAN_MOFGPR253	(CAN_MO253_FGPR)

/** \brief  2FA8, Message Object  Interrupt Pointer Register */
#define CAN_MO253_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AFA8u)

/** Alias (User Manual Name) for CAN_MO253_IPR.
* To use register names with standard convension, please use CAN_MO253_IPR.
*/
#define	CAN_MOIPR253	(CAN_MO253_IPR)

/** \brief  2FBC, Message Object  Control Register */
#define CAN_MO253_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AFBCu)

/** Alias (User Manual Name) for CAN_MO253_STAT.
* To use register names with standard convension, please use CAN_MO253_STAT.
*/
#define	CAN_MOSTAT253	(CAN_MO253_STAT)

/** \brief  2FCC, Message Object  Acceptance Mask Register */
#define CAN_MO254_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AFCCu)

/** Alias (User Manual Name) for CAN_MO254_AMR.
* To use register names with standard convension, please use CAN_MO254_AMR.
*/
#define	CAN_MOAMR254	(CAN_MO254_AMR)

/** \brief  2FD8, Message Object  Arbitration Register */
#define CAN_MO254_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AFD8u)

/** Alias (User Manual Name) for CAN_MO254_AR.
* To use register names with standard convension, please use CAN_MO254_AR.
*/
#define	CAN_MOAR254	(CAN_MO254_AR)

/** \brief  2FDC, Message Object  Control Register */
#define CAN_MO254_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AFDCu)

/** Alias (User Manual Name) for CAN_MO254_CTR.
* To use register names with standard convension, please use CAN_MO254_CTR.
*/
#define	CAN_MOCTR254	(CAN_MO254_CTR)

/** \brief  2FD4, Message Object  Data Register High */
#define CAN_MO254_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AFD4u)

/** Alias (User Manual Name) for CAN_MO254_DATAH.
* To use register names with standard convension, please use CAN_MO254_DATAH.
*/
#define	CAN_MODATAH254	(CAN_MO254_DATAH)

/** \brief  2FD0, Message Object  Data Register Low */
#define CAN_MO254_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AFD0u)

/** Alias (User Manual Name) for CAN_MO254_DATAL.
* To use register names with standard convension, please use CAN_MO254_DATAL.
*/
#define	CAN_MODATAL254	(CAN_MO254_DATAL)

/** \brief  2FC0, Message Object  Function Control Register */
#define CAN_MO254_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AFC0u)

/** Alias (User Manual Name) for CAN_MO254_EDATA0.
* To use register names with standard convension, please use CAN_MO254_EDATA0.
*/
#define	CAN_EMO254DATA0	(CAN_MO254_EDATA0)

/** \brief  2FC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO254_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AFC4u)

/** Alias (User Manual Name) for CAN_MO254_EDATA1.
* To use register names with standard convension, please use CAN_MO254_EDATA1.
*/
#define	CAN_EMO254DATA1	(CAN_MO254_EDATA1)

/** \brief  2FC8, Message Object  Interrupt Pointer Register */
#define CAN_MO254_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AFC8u)

/** Alias (User Manual Name) for CAN_MO254_EDATA2.
* To use register names with standard convension, please use CAN_MO254_EDATA2.
*/
#define	CAN_EMO254DATA2	(CAN_MO254_EDATA2)

/** \brief  2FCC, Message Object  Acceptance Mask Register */
#define CAN_MO254_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AFCCu)

/** Alias (User Manual Name) for CAN_MO254_EDATA3.
* To use register names with standard convension, please use CAN_MO254_EDATA3.
*/
#define	CAN_EMO254DATA3	(CAN_MO254_EDATA3)

/** \brief  2FD0, Message Object  Data Register Low */
#define CAN_MO254_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AFD0u)

/** Alias (User Manual Name) for CAN_MO254_EDATA4.
* To use register names with standard convension, please use CAN_MO254_EDATA4.
*/
#define	CAN_EMO254DATA4	(CAN_MO254_EDATA4)

/** \brief  2FD4, Message Object  Data Register High */
#define CAN_MO254_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AFD4u)

/** Alias (User Manual Name) for CAN_MO254_EDATA5.
* To use register names with standard convension, please use CAN_MO254_EDATA5.
*/
#define	CAN_EMO254DATA5	(CAN_MO254_EDATA5)

/** \brief  2FD8, Message Object  Arbitration Register */
#define CAN_MO254_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AFD8u)

/** Alias (User Manual Name) for CAN_MO254_EDATA6.
* To use register names with standard convension, please use CAN_MO254_EDATA6.
*/
#define	CAN_EMO254DATA6	(CAN_MO254_EDATA6)

/** \brief  2FC0, Message Object  Function Control Register */
#define CAN_MO254_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AFC0u)

/** Alias (User Manual Name) for CAN_MO254_FCR.
* To use register names with standard convension, please use CAN_MO254_FCR.
*/
#define	CAN_MOFCR254	(CAN_MO254_FCR)

/** \brief  2FC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO254_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AFC4u)

/** Alias (User Manual Name) for CAN_MO254_FGPR.
* To use register names with standard convension, please use CAN_MO254_FGPR.
*/
#define	CAN_MOFGPR254	(CAN_MO254_FGPR)

/** \brief  2FC8, Message Object  Interrupt Pointer Register */
#define CAN_MO254_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AFC8u)

/** Alias (User Manual Name) for CAN_MO254_IPR.
* To use register names with standard convension, please use CAN_MO254_IPR.
*/
#define	CAN_MOIPR254	(CAN_MO254_IPR)

/** \brief  2FDC, Message Object  Control Register */
#define CAN_MO254_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AFDCu)

/** Alias (User Manual Name) for CAN_MO254_STAT.
* To use register names with standard convension, please use CAN_MO254_STAT.
*/
#define	CAN_MOSTAT254	(CAN_MO254_STAT)

