luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  2FEC, Message Object  Acceptance Mask Register */
#define CAN_MO255_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AFECu)

/** Alias (User Manual Name) for CAN_MO255_AMR.
* To use register names with standard convension, please use CAN_MO255_AMR.
*/
#define	CAN_MOAMR255	(CAN_MO255_AMR)

/** \brief  2FF8, Message Object  Arbitration Register */
#define CAN_MO255_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AFF8u)

/** Alias (User Manual Name) for CAN_MO255_AR.
* To use register names with standard convension, please use CAN_MO255_AR.
*/
#define	CAN_MOAR255	(CAN_MO255_AR)

/** \brief  2FFC, Message Object  Control Register */
#define CAN_MO255_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AFFCu)

/** Alias (User Manual Name) for CAN_MO255_CTR.
* To use register names with standard convension, please use CAN_MO255_CTR.
*/
#define	CAN_MOCTR255	(CAN_MO255_CTR)

/** \brief  2FF4, Message Object  Data Register High */
#define CAN_MO255_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AFF4u)

/** Alias (User Manual Name) for CAN_MO255_DATAH.
* To use register names with standard convension, please use CAN_MO255_DATAH.
*/
#define	CAN_MODATAH255	(CAN_MO255_DATAH)

/** \brief  2FF0, Message Object  Data Register Low */
#define CAN_MO255_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AFF0u)

/** Alias (User Manual Name) for CAN_MO255_DATAL.
* To use register names with standard convension, please use CAN_MO255_DATAL.
*/
#define	CAN_MODATAL255	(CAN_MO255_DATAL)

/** \brief  2FE0, Message Object  Function Control Register */
#define CAN_MO255_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF001AFE0u)

/** Alias (User Manual Name) for CAN_MO255_EDATA0.
* To use register names with standard convension, please use CAN_MO255_EDATA0.
*/
#define	CAN_EMO255DATA0	(CAN_MO255_EDATA0)

/** \brief  2FE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO255_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF001AFE4u)

/** Alias (User Manual Name) for CAN_MO255_EDATA1.
* To use register names with standard convension, please use CAN_MO255_EDATA1.
*/
#define	CAN_EMO255DATA1	(CAN_MO255_EDATA1)

/** \brief  2FE8, Message Object  Interrupt Pointer Register */
#define CAN_MO255_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF001AFE8u)

/** Alias (User Manual Name) for CAN_MO255_EDATA2.
* To use register names with standard convension, please use CAN_MO255_EDATA2.
*/
#define	CAN_EMO255DATA2	(CAN_MO255_EDATA2)

/** \brief  2FEC, Message Object  Acceptance Mask Register */
#define CAN_MO255_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001AFECu)

/** Alias (User Manual Name) for CAN_MO255_EDATA3.
* To use register names with standard convension, please use CAN_MO255_EDATA3.
*/
#define	CAN_EMO255DATA3	(CAN_MO255_EDATA3)

/** \brief  2FF0, Message Object  Data Register Low */
#define CAN_MO255_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF001AFF0u)

/** Alias (User Manual Name) for CAN_MO255_EDATA4.
* To use register names with standard convension, please use CAN_MO255_EDATA4.
*/
#define	CAN_EMO255DATA4	(CAN_MO255_EDATA4)

/** \brief  2FF4, Message Object  Data Register High */
#define CAN_MO255_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF001AFF4u)

/** Alias (User Manual Name) for CAN_MO255_EDATA5.
* To use register names with standard convension, please use CAN_MO255_EDATA5.
*/
#define	CAN_EMO255DATA5	(CAN_MO255_EDATA5)

/** \brief  2FF8, Message Object  Arbitration Register */
#define CAN_MO255_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF001AFF8u)

/** Alias (User Manual Name) for CAN_MO255_EDATA6.
* To use register names with standard convension, please use CAN_MO255_EDATA6.
*/
#define	CAN_EMO255DATA6	(CAN_MO255_EDATA6)

/** \brief  2FE0, Message Object  Function Control Register */
#define CAN_MO255_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AFE0u)

/** Alias (User Manual Name) for CAN_MO255_FCR.
* To use register names with standard convension, please use CAN_MO255_FCR.
*/
#define	CAN_MOFCR255	(CAN_MO255_FCR)

/** \brief  2FE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO255_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AFE4u)

/** Alias (User Manual Name) for CAN_MO255_FGPR.
* To use register names with standard convension, please use CAN_MO255_FGPR.
*/
#define	CAN_MOFGPR255	(CAN_MO255_FGPR)

/** \brief  2FE8, Message Object  Interrupt Pointer Register */
#define CAN_MO255_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AFE8u)

/** Alias (User Manual Name) for CAN_MO255_IPR.
* To use register names with standard convension, please use CAN_MO255_IPR.
*/
#define	CAN_MOIPR255	(CAN_MO255_IPR)

/** \brief  2FFC, Message Object  Control Register */
#define CAN_MO255_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AFFCu)

/** Alias (User Manual Name) for CAN_MO255_STAT.
* To use register names with standard convension, please use CAN_MO255_STAT.
*/
#define	CAN_MOSTAT255	(CAN_MO255_STAT)

/** \brief  132C, Message Object  Acceptance Mask Register */
#define CAN_MO25_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001932Cu)

/** Alias (User Manual Name) for CAN_MO25_AMR.
* To use register names with standard convension, please use CAN_MO25_AMR.
*/
#define	CAN_MOAMR25	(CAN_MO25_AMR)

/** \brief  1338, Message Object  Arbitration Register */
#define CAN_MO25_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019338u)

/** Alias (User Manual Name) for CAN_MO25_AR.
* To use register names with standard convension, please use CAN_MO25_AR.
*/
#define	CAN_MOAR25	(CAN_MO25_AR)

/** \brief  133C, Message Object  Control Register */
#define CAN_MO25_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001933Cu)

/** Alias (User Manual Name) for CAN_MO25_CTR.
* To use register names with standard convension, please use CAN_MO25_CTR.
*/
#define	CAN_MOCTR25	(CAN_MO25_CTR)

/** \brief  1334, Message Object  Data Register High */
#define CAN_MO25_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019334u)

