luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  1348, Message Object  Interrupt Pointer Register */
#define CAN_MO26_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019348u)

/** Alias (User Manual Name) for CAN_MO26_EDATA2.
* To use register names with standard convension, please use CAN_MO26_EDATA2.
*/
#define	CAN_EMO26DATA2	(CAN_MO26_EDATA2)

/** \brief  134C, Message Object  Acceptance Mask Register */
#define CAN_MO26_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001934Cu)

/** Alias (User Manual Name) for CAN_MO26_EDATA3.
* To use register names with standard convension, please use CAN_MO26_EDATA3.
*/
#define	CAN_EMO26DATA3	(CAN_MO26_EDATA3)

/** \brief  1350, Message Object  Data Register Low */
#define CAN_MO26_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019350u)

/** Alias (User Manual Name) for CAN_MO26_EDATA4.
* To use register names with standard convension, please use CAN_MO26_EDATA4.
*/
#define	CAN_EMO26DATA4	(CAN_MO26_EDATA4)

/** \brief  1354, Message Object  Data Register High */
#define CAN_MO26_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019354u)

/** Alias (User Manual Name) for CAN_MO26_EDATA5.
* To use register names with standard convension, please use CAN_MO26_EDATA5.
*/
#define	CAN_EMO26DATA5	(CAN_MO26_EDATA5)

/** \brief  1358, Message Object  Arbitration Register */
#define CAN_MO26_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019358u)

/** Alias (User Manual Name) for CAN_MO26_EDATA6.
* To use register names with standard convension, please use CAN_MO26_EDATA6.
*/
#define	CAN_EMO26DATA6	(CAN_MO26_EDATA6)

/** \brief  1340, Message Object  Function Control Register */
#define CAN_MO26_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019340u)

/** Alias (User Manual Name) for CAN_MO26_FCR.
* To use register names with standard convension, please use CAN_MO26_FCR.
*/
#define	CAN_MOFCR26	(CAN_MO26_FCR)

/** \brief  1344, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO26_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019344u)

/** Alias (User Manual Name) for CAN_MO26_FGPR.
* To use register names with standard convension, please use CAN_MO26_FGPR.
*/
#define	CAN_MOFGPR26	(CAN_MO26_FGPR)

/** \brief  1348, Message Object  Interrupt Pointer Register */
#define CAN_MO26_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019348u)

/** Alias (User Manual Name) for CAN_MO26_IPR.
* To use register names with standard convension, please use CAN_MO26_IPR.
*/
#define	CAN_MOIPR26	(CAN_MO26_IPR)

/** \brief  135C, Message Object  Control Register */
#define CAN_MO26_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001935Cu)

/** Alias (User Manual Name) for CAN_MO26_STAT.
* To use register names with standard convension, please use CAN_MO26_STAT.
*/
#define	CAN_MOSTAT26	(CAN_MO26_STAT)

/** \brief  136C, Message Object  Acceptance Mask Register */
#define CAN_MO27_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001936Cu)

/** Alias (User Manual Name) for CAN_MO27_AMR.
* To use register names with standard convension, please use CAN_MO27_AMR.
*/
#define	CAN_MOAMR27	(CAN_MO27_AMR)

/** \brief  1378, Message Object  Arbitration Register */
#define CAN_MO27_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019378u)

/** Alias (User Manual Name) for CAN_MO27_AR.
* To use register names with standard convension, please use CAN_MO27_AR.
*/
#define	CAN_MOAR27	(CAN_MO27_AR)

/** \brief  137C, Message Object  Control Register */
#define CAN_MO27_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001937Cu)

/** Alias (User Manual Name) for CAN_MO27_CTR.
* To use register names with standard convension, please use CAN_MO27_CTR.
*/
#define	CAN_MOCTR27	(CAN_MO27_CTR)

/** \brief  1374, Message Object  Data Register High */
#define CAN_MO27_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019374u)

/** Alias (User Manual Name) for CAN_MO27_DATAH.
* To use register names with standard convension, please use CAN_MO27_DATAH.
*/
#define	CAN_MODATAH27	(CAN_MO27_DATAH)

/** \brief  1370, Message Object  Data Register Low */
#define CAN_MO27_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019370u)

/** Alias (User Manual Name) for CAN_MO27_DATAL.
* To use register names with standard convension, please use CAN_MO27_DATAL.
*/
#define	CAN_MODATAL27	(CAN_MO27_DATAL)

/** \brief  1360, Message Object  Function Control Register */
#define CAN_MO27_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019360u)

/** Alias (User Manual Name) for CAN_MO27_EDATA0.
* To use register names with standard convension, please use CAN_MO27_EDATA0.
*/
#define	CAN_EMO27DATA0	(CAN_MO27_EDATA0)

/** \brief  1364, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO27_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019364u)

/** Alias (User Manual Name) for CAN_MO27_EDATA1.
* To use register names with standard convension, please use CAN_MO27_EDATA1.
*/
#define	CAN_EMO27DATA1	(CAN_MO27_EDATA1)

/** \brief  1368, Message Object  Interrupt Pointer Register */
#define CAN_MO27_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019368u)

/** Alias (User Manual Name) for CAN_MO27_EDATA2.
* To use register names with standard convension, please use CAN_MO27_EDATA2.
*/
#define	CAN_EMO27DATA2	(CAN_MO27_EDATA2)

/** \brief  136C, Message Object  Acceptance Mask Register */
#define CAN_MO27_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001936Cu)

/** Alias (User Manual Name) for CAN_MO27_EDATA3.
* To use register names with standard convension, please use CAN_MO27_EDATA3.
*/
#define	CAN_EMO27DATA3	(CAN_MO27_EDATA3)

/** \brief  1370, Message Object  Data Register Low */
#define CAN_MO27_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019370u)

/** Alias (User Manual Name) for CAN_MO27_EDATA4.
* To use register names with standard convension, please use CAN_MO27_EDATA4.
*/
#define	CAN_EMO27DATA4	(CAN_MO27_EDATA4)

/** \brief  1374, Message Object  Data Register High */
#define CAN_MO27_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019374u)

/** Alias (User Manual Name) for CAN_MO27_EDATA5.
* To use register names with standard convension, please use CAN_MO27_EDATA5.
*/
#define	CAN_EMO27DATA5	(CAN_MO27_EDATA5)

/** \brief  1378, Message Object  Arbitration Register */
#define CAN_MO27_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019378u)

/** Alias (User Manual Name) for CAN_MO27_EDATA6.
* To use register names with standard convension, please use CAN_MO27_EDATA6.
*/
#define	CAN_EMO27DATA6	(CAN_MO27_EDATA6)

