luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  145C, Message Object  Control Register */
#define CAN_MO34_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001945Cu)

/** Alias (User Manual Name) for CAN_MO34_STAT.
* To use register names with standard convension, please use CAN_MO34_STAT.
*/
#define	CAN_MOSTAT34	(CAN_MO34_STAT)

/** \brief  146C, Message Object  Acceptance Mask Register */
#define CAN_MO35_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001946Cu)

/** Alias (User Manual Name) for CAN_MO35_AMR.
* To use register names with standard convension, please use CAN_MO35_AMR.
*/
#define	CAN_MOAMR35	(CAN_MO35_AMR)

/** \brief  1478, Message Object  Arbitration Register */
#define CAN_MO35_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019478u)

/** Alias (User Manual Name) for CAN_MO35_AR.
* To use register names with standard convension, please use CAN_MO35_AR.
*/
#define	CAN_MOAR35	(CAN_MO35_AR)

/** \brief  147C, Message Object  Control Register */
#define CAN_MO35_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001947Cu)

/** Alias (User Manual Name) for CAN_MO35_CTR.
* To use register names with standard convension, please use CAN_MO35_CTR.
*/
#define	CAN_MOCTR35	(CAN_MO35_CTR)

/** \brief  1474, Message Object  Data Register High */
#define CAN_MO35_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019474u)

/** Alias (User Manual Name) for CAN_MO35_DATAH.
* To use register names with standard convension, please use CAN_MO35_DATAH.
*/
#define	CAN_MODATAH35	(CAN_MO35_DATAH)

/** \brief  1470, Message Object  Data Register Low */
#define CAN_MO35_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019470u)

/** Alias (User Manual Name) for CAN_MO35_DATAL.
* To use register names with standard convension, please use CAN_MO35_DATAL.
*/
#define	CAN_MODATAL35	(CAN_MO35_DATAL)

/** \brief  1460, Message Object  Function Control Register */
#define CAN_MO35_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019460u)

/** Alias (User Manual Name) for CAN_MO35_EDATA0.
* To use register names with standard convension, please use CAN_MO35_EDATA0.
*/
#define	CAN_EMO35DATA0	(CAN_MO35_EDATA0)

/** \brief  1464, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO35_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019464u)

/** Alias (User Manual Name) for CAN_MO35_EDATA1.
* To use register names with standard convension, please use CAN_MO35_EDATA1.
*/
#define	CAN_EMO35DATA1	(CAN_MO35_EDATA1)

/** \brief  1468, Message Object  Interrupt Pointer Register */
#define CAN_MO35_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019468u)

/** Alias (User Manual Name) for CAN_MO35_EDATA2.
* To use register names with standard convension, please use CAN_MO35_EDATA2.
*/
#define	CAN_EMO35DATA2	(CAN_MO35_EDATA2)

/** \brief  146C, Message Object  Acceptance Mask Register */
#define CAN_MO35_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001946Cu)

/** Alias (User Manual Name) for CAN_MO35_EDATA3.
* To use register names with standard convension, please use CAN_MO35_EDATA3.
*/
#define	CAN_EMO35DATA3	(CAN_MO35_EDATA3)

/** \brief  1470, Message Object  Data Register Low */
#define CAN_MO35_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019470u)

/** Alias (User Manual Name) for CAN_MO35_EDATA4.
* To use register names with standard convension, please use CAN_MO35_EDATA4.
*/
#define	CAN_EMO35DATA4	(CAN_MO35_EDATA4)

/** \brief  1474, Message Object  Data Register High */
#define CAN_MO35_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019474u)

/** Alias (User Manual Name) for CAN_MO35_EDATA5.
* To use register names with standard convension, please use CAN_MO35_EDATA5.
*/
#define	CAN_EMO35DATA5	(CAN_MO35_EDATA5)

/** \brief  1478, Message Object  Arbitration Register */
#define CAN_MO35_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019478u)

/** Alias (User Manual Name) for CAN_MO35_EDATA6.
* To use register names with standard convension, please use CAN_MO35_EDATA6.
*/
#define	CAN_EMO35DATA6	(CAN_MO35_EDATA6)

/** \brief  1460, Message Object  Function Control Register */
#define CAN_MO35_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019460u)

/** Alias (User Manual Name) for CAN_MO35_FCR.
* To use register names with standard convension, please use CAN_MO35_FCR.
*/
#define	CAN_MOFCR35	(CAN_MO35_FCR)

/** \brief  1464, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO35_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019464u)

/** Alias (User Manual Name) for CAN_MO35_FGPR.
* To use register names with standard convension, please use CAN_MO35_FGPR.
*/
#define	CAN_MOFGPR35	(CAN_MO35_FGPR)

/** \brief  1468, Message Object  Interrupt Pointer Register */
#define CAN_MO35_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019468u)

/** Alias (User Manual Name) for CAN_MO35_IPR.
* To use register names with standard convension, please use CAN_MO35_IPR.
*/
#define	CAN_MOIPR35	(CAN_MO35_IPR)

/** \brief  147C, Message Object  Control Register */
#define CAN_MO35_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001947Cu)

/** Alias (User Manual Name) for CAN_MO35_STAT.
* To use register names with standard convension, please use CAN_MO35_STAT.
*/
#define	CAN_MOSTAT35	(CAN_MO35_STAT)

/** \brief  148C, Message Object  Acceptance Mask Register */
#define CAN_MO36_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001948Cu)

/** Alias (User Manual Name) for CAN_MO36_AMR.
* To use register names with standard convension, please use CAN_MO36_AMR.
*/
#define	CAN_MOAMR36	(CAN_MO36_AMR)

/** \brief  1498, Message Object  Arbitration Register */
#define CAN_MO36_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019498u)

/** Alias (User Manual Name) for CAN_MO36_AR.
* To use register names with standard convension, please use CAN_MO36_AR.
*/
#define	CAN_MOAR36	(CAN_MO36_AR)

/** \brief  149C, Message Object  Control Register */
#define CAN_MO36_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001949Cu)

