luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO36_CTR.
* To use register names with standard convension, please use CAN_MO36_CTR.
*/
#define	CAN_MOCTR36	(CAN_MO36_CTR)

/** \brief  1494, Message Object  Data Register High */
#define CAN_MO36_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019494u)

/** Alias (User Manual Name) for CAN_MO36_DATAH.
* To use register names with standard convension, please use CAN_MO36_DATAH.
*/
#define	CAN_MODATAH36	(CAN_MO36_DATAH)

/** \brief  1490, Message Object  Data Register Low */
#define CAN_MO36_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019490u)

/** Alias (User Manual Name) for CAN_MO36_DATAL.
* To use register names with standard convension, please use CAN_MO36_DATAL.
*/
#define	CAN_MODATAL36	(CAN_MO36_DATAL)

/** \brief  1480, Message Object  Function Control Register */
#define CAN_MO36_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019480u)

/** Alias (User Manual Name) for CAN_MO36_EDATA0.
* To use register names with standard convension, please use CAN_MO36_EDATA0.
*/
#define	CAN_EMO36DATA0	(CAN_MO36_EDATA0)

/** \brief  1484, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO36_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019484u)

/** Alias (User Manual Name) for CAN_MO36_EDATA1.
* To use register names with standard convension, please use CAN_MO36_EDATA1.
*/
#define	CAN_EMO36DATA1	(CAN_MO36_EDATA1)

/** \brief  1488, Message Object  Interrupt Pointer Register */
#define CAN_MO36_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019488u)

/** Alias (User Manual Name) for CAN_MO36_EDATA2.
* To use register names with standard convension, please use CAN_MO36_EDATA2.
*/
#define	CAN_EMO36DATA2	(CAN_MO36_EDATA2)

/** \brief  148C, Message Object  Acceptance Mask Register */
#define CAN_MO36_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001948Cu)

/** Alias (User Manual Name) for CAN_MO36_EDATA3.
* To use register names with standard convension, please use CAN_MO36_EDATA3.
*/
#define	CAN_EMO36DATA3	(CAN_MO36_EDATA3)

/** \brief  1490, Message Object  Data Register Low */
#define CAN_MO36_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019490u)

/** Alias (User Manual Name) for CAN_MO36_EDATA4.
* To use register names with standard convension, please use CAN_MO36_EDATA4.
*/
#define	CAN_EMO36DATA4	(CAN_MO36_EDATA4)

/** \brief  1494, Message Object  Data Register High */
#define CAN_MO36_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019494u)

/** Alias (User Manual Name) for CAN_MO36_EDATA5.
* To use register names with standard convension, please use CAN_MO36_EDATA5.
*/
#define	CAN_EMO36DATA5	(CAN_MO36_EDATA5)

/** \brief  1498, Message Object  Arbitration Register */
#define CAN_MO36_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019498u)

/** Alias (User Manual Name) for CAN_MO36_EDATA6.
* To use register names with standard convension, please use CAN_MO36_EDATA6.
*/
#define	CAN_EMO36DATA6	(CAN_MO36_EDATA6)

/** \brief  1480, Message Object  Function Control Register */
#define CAN_MO36_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019480u)

/** Alias (User Manual Name) for CAN_MO36_FCR.
* To use register names with standard convension, please use CAN_MO36_FCR.
*/
#define	CAN_MOFCR36	(CAN_MO36_FCR)

/** \brief  1484, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO36_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019484u)

/** Alias (User Manual Name) for CAN_MO36_FGPR.
* To use register names with standard convension, please use CAN_MO36_FGPR.
*/
#define	CAN_MOFGPR36	(CAN_MO36_FGPR)

/** \brief  1488, Message Object  Interrupt Pointer Register */
#define CAN_MO36_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019488u)

/** Alias (User Manual Name) for CAN_MO36_IPR.
* To use register names with standard convension, please use CAN_MO36_IPR.
*/
#define	CAN_MOIPR36	(CAN_MO36_IPR)

/** \brief  149C, Message Object  Control Register */
#define CAN_MO36_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001949Cu)

/** Alias (User Manual Name) for CAN_MO36_STAT.
* To use register names with standard convension, please use CAN_MO36_STAT.
*/
#define	CAN_MOSTAT36	(CAN_MO36_STAT)

/** \brief  14AC, Message Object  Acceptance Mask Register */
#define CAN_MO37_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00194ACu)

/** Alias (User Manual Name) for CAN_MO37_AMR.
* To use register names with standard convension, please use CAN_MO37_AMR.
*/
#define	CAN_MOAMR37	(CAN_MO37_AMR)

/** \brief  14B8, Message Object  Arbitration Register */
#define CAN_MO37_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00194B8u)

/** Alias (User Manual Name) for CAN_MO37_AR.
* To use register names with standard convension, please use CAN_MO37_AR.
*/
#define	CAN_MOAR37	(CAN_MO37_AR)

/** \brief  14BC, Message Object  Control Register */
#define CAN_MO37_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00194BCu)

/** Alias (User Manual Name) for CAN_MO37_CTR.
* To use register names with standard convension, please use CAN_MO37_CTR.
*/
#define	CAN_MOCTR37	(CAN_MO37_CTR)

/** \brief  14B4, Message Object  Data Register High */
#define CAN_MO37_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00194B4u)

/** Alias (User Manual Name) for CAN_MO37_DATAH.
* To use register names with standard convension, please use CAN_MO37_DATAH.
*/
#define	CAN_MODATAH37	(CAN_MO37_DATAH)

/** \brief  14B0, Message Object  Data Register Low */
#define CAN_MO37_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00194B0u)

/** Alias (User Manual Name) for CAN_MO37_DATAL.
* To use register names with standard convension, please use CAN_MO37_DATAL.
*/
#define	CAN_MODATAL37	(CAN_MO37_DATAL)

/** \brief  14A0, Message Object  Function Control Register */
#define CAN_MO37_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00194A0u)

/** Alias (User Manual Name) for CAN_MO37_EDATA0.
* To use register names with standard convension, please use CAN_MO37_EDATA0.
*/
#define	CAN_EMO37DATA0	(CAN_MO37_EDATA0)

/** \brief  14A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO37_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00194A4u)

/** Alias (User Manual Name) for CAN_MO37_EDATA1.
* To use register names with standard convension, please use CAN_MO37_EDATA1.
*/
#define	CAN_EMO37DATA1	(CAN_MO37_EDATA1)

