luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  14A8, Message Object  Interrupt Pointer Register */
#define CAN_MO37_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00194A8u)

/** Alias (User Manual Name) for CAN_MO37_EDATA2.
* To use register names with standard convension, please use CAN_MO37_EDATA2.
*/
#define	CAN_EMO37DATA2	(CAN_MO37_EDATA2)

/** \brief  14AC, Message Object  Acceptance Mask Register */
#define CAN_MO37_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00194ACu)

/** Alias (User Manual Name) for CAN_MO37_EDATA3.
* To use register names with standard convension, please use CAN_MO37_EDATA3.
*/
#define	CAN_EMO37DATA3	(CAN_MO37_EDATA3)

/** \brief  14B0, Message Object  Data Register Low */
#define CAN_MO37_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00194B0u)

/** Alias (User Manual Name) for CAN_MO37_EDATA4.
* To use register names with standard convension, please use CAN_MO37_EDATA4.
*/
#define	CAN_EMO37DATA4	(CAN_MO37_EDATA4)

/** \brief  14B4, Message Object  Data Register High */
#define CAN_MO37_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00194B4u)

/** Alias (User Manual Name) for CAN_MO37_EDATA5.
* To use register names with standard convension, please use CAN_MO37_EDATA5.
*/
#define	CAN_EMO37DATA5	(CAN_MO37_EDATA5)

/** \brief  14B8, Message Object  Arbitration Register */
#define CAN_MO37_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00194B8u)

/** Alias (User Manual Name) for CAN_MO37_EDATA6.
* To use register names with standard convension, please use CAN_MO37_EDATA6.
*/
#define	CAN_EMO37DATA6	(CAN_MO37_EDATA6)

/** \brief  14A0, Message Object  Function Control Register */
#define CAN_MO37_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00194A0u)

/** Alias (User Manual Name) for CAN_MO37_FCR.
* To use register names with standard convension, please use CAN_MO37_FCR.
*/
#define	CAN_MOFCR37	(CAN_MO37_FCR)

/** \brief  14A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO37_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00194A4u)

/** Alias (User Manual Name) for CAN_MO37_FGPR.
* To use register names with standard convension, please use CAN_MO37_FGPR.
*/
#define	CAN_MOFGPR37	(CAN_MO37_FGPR)

/** \brief  14A8, Message Object  Interrupt Pointer Register */
#define CAN_MO37_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00194A8u)

/** Alias (User Manual Name) for CAN_MO37_IPR.
* To use register names with standard convension, please use CAN_MO37_IPR.
*/
#define	CAN_MOIPR37	(CAN_MO37_IPR)

/** \brief  14BC, Message Object  Control Register */
#define CAN_MO37_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00194BCu)

/** Alias (User Manual Name) for CAN_MO37_STAT.
* To use register names with standard convension, please use CAN_MO37_STAT.
*/
#define	CAN_MOSTAT37	(CAN_MO37_STAT)

/** \brief  14CC, Message Object  Acceptance Mask Register */
#define CAN_MO38_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00194CCu)

/** Alias (User Manual Name) for CAN_MO38_AMR.
* To use register names with standard convension, please use CAN_MO38_AMR.
*/
#define	CAN_MOAMR38	(CAN_MO38_AMR)

/** \brief  14D8, Message Object  Arbitration Register */
#define CAN_MO38_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00194D8u)

/** Alias (User Manual Name) for CAN_MO38_AR.
* To use register names with standard convension, please use CAN_MO38_AR.
*/
#define	CAN_MOAR38	(CAN_MO38_AR)

/** \brief  14DC, Message Object  Control Register */
#define CAN_MO38_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00194DCu)

/** Alias (User Manual Name) for CAN_MO38_CTR.
* To use register names with standard convension, please use CAN_MO38_CTR.
*/
#define	CAN_MOCTR38	(CAN_MO38_CTR)

/** \brief  14D4, Message Object  Data Register High */
#define CAN_MO38_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00194D4u)

/** Alias (User Manual Name) for CAN_MO38_DATAH.
* To use register names with standard convension, please use CAN_MO38_DATAH.
*/
#define	CAN_MODATAH38	(CAN_MO38_DATAH)

/** \brief  14D0, Message Object  Data Register Low */
#define CAN_MO38_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00194D0u)

/** Alias (User Manual Name) for CAN_MO38_DATAL.
* To use register names with standard convension, please use CAN_MO38_DATAL.
*/
#define	CAN_MODATAL38	(CAN_MO38_DATAL)

/** \brief  14C0, Message Object  Function Control Register */
#define CAN_MO38_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00194C0u)

/** Alias (User Manual Name) for CAN_MO38_EDATA0.
* To use register names with standard convension, please use CAN_MO38_EDATA0.
*/
#define	CAN_EMO38DATA0	(CAN_MO38_EDATA0)

/** \brief  14C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO38_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00194C4u)

/** Alias (User Manual Name) for CAN_MO38_EDATA1.
* To use register names with standard convension, please use CAN_MO38_EDATA1.
*/
#define	CAN_EMO38DATA1	(CAN_MO38_EDATA1)

/** \brief  14C8, Message Object  Interrupt Pointer Register */
#define CAN_MO38_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00194C8u)

/** Alias (User Manual Name) for CAN_MO38_EDATA2.
* To use register names with standard convension, please use CAN_MO38_EDATA2.
*/
#define	CAN_EMO38DATA2	(CAN_MO38_EDATA2)

/** \brief  14CC, Message Object  Acceptance Mask Register */
#define CAN_MO38_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00194CCu)

/** Alias (User Manual Name) for CAN_MO38_EDATA3.
* To use register names with standard convension, please use CAN_MO38_EDATA3.
*/
#define	CAN_EMO38DATA3	(CAN_MO38_EDATA3)

/** \brief  14D0, Message Object  Data Register Low */
#define CAN_MO38_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00194D0u)

/** Alias (User Manual Name) for CAN_MO38_EDATA4.
* To use register names with standard convension, please use CAN_MO38_EDATA4.
*/
#define	CAN_EMO38DATA4	(CAN_MO38_EDATA4)

/** \brief  14D4, Message Object  Data Register High */
#define CAN_MO38_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00194D4u)

/** Alias (User Manual Name) for CAN_MO38_EDATA5.
* To use register names with standard convension, please use CAN_MO38_EDATA5.
*/
#define	CAN_EMO38DATA5	(CAN_MO38_EDATA5)

