luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  1510, Message Object  Data Register Low */
#define CAN_MO40_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019510u)

/** Alias (User Manual Name) for CAN_MO40_DATAL.
* To use register names with standard convension, please use CAN_MO40_DATAL.
*/
#define	CAN_MODATAL40	(CAN_MO40_DATAL)

/** \brief  1500, Message Object  Function Control Register */
#define CAN_MO40_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019500u)

/** Alias (User Manual Name) for CAN_MO40_EDATA0.
* To use register names with standard convension, please use CAN_MO40_EDATA0.
*/
#define	CAN_EMO40DATA0	(CAN_MO40_EDATA0)

/** \brief  1504, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO40_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019504u)

/** Alias (User Manual Name) for CAN_MO40_EDATA1.
* To use register names with standard convension, please use CAN_MO40_EDATA1.
*/
#define	CAN_EMO40DATA1	(CAN_MO40_EDATA1)

/** \brief  1508, Message Object  Interrupt Pointer Register */
#define CAN_MO40_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019508u)

/** Alias (User Manual Name) for CAN_MO40_EDATA2.
* To use register names with standard convension, please use CAN_MO40_EDATA2.
*/
#define	CAN_EMO40DATA2	(CAN_MO40_EDATA2)

/** \brief  150C, Message Object  Acceptance Mask Register */
#define CAN_MO40_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001950Cu)

/** Alias (User Manual Name) for CAN_MO40_EDATA3.
* To use register names with standard convension, please use CAN_MO40_EDATA3.
*/
#define	CAN_EMO40DATA3	(CAN_MO40_EDATA3)

/** \brief  1510, Message Object  Data Register Low */
#define CAN_MO40_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019510u)

/** Alias (User Manual Name) for CAN_MO40_EDATA4.
* To use register names with standard convension, please use CAN_MO40_EDATA4.
*/
#define	CAN_EMO40DATA4	(CAN_MO40_EDATA4)

/** \brief  1514, Message Object  Data Register High */
#define CAN_MO40_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019514u)

/** Alias (User Manual Name) for CAN_MO40_EDATA5.
* To use register names with standard convension, please use CAN_MO40_EDATA5.
*/
#define	CAN_EMO40DATA5	(CAN_MO40_EDATA5)

/** \brief  1518, Message Object  Arbitration Register */
#define CAN_MO40_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019518u)

/** Alias (User Manual Name) for CAN_MO40_EDATA6.
* To use register names with standard convension, please use CAN_MO40_EDATA6.
*/
#define	CAN_EMO40DATA6	(CAN_MO40_EDATA6)

/** \brief  1500, Message Object  Function Control Register */
#define CAN_MO40_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019500u)

/** Alias (User Manual Name) for CAN_MO40_FCR.
* To use register names with standard convension, please use CAN_MO40_FCR.
*/
#define	CAN_MOFCR40	(CAN_MO40_FCR)

/** \brief  1504, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO40_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019504u)

/** Alias (User Manual Name) for CAN_MO40_FGPR.
* To use register names with standard convension, please use CAN_MO40_FGPR.
*/
#define	CAN_MOFGPR40	(CAN_MO40_FGPR)

/** \brief  1508, Message Object  Interrupt Pointer Register */
#define CAN_MO40_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019508u)

/** Alias (User Manual Name) for CAN_MO40_IPR.
* To use register names with standard convension, please use CAN_MO40_IPR.
*/
#define	CAN_MOIPR40	(CAN_MO40_IPR)

/** \brief  151C, Message Object  Control Register */
#define CAN_MO40_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001951Cu)

/** Alias (User Manual Name) for CAN_MO40_STAT.
* To use register names with standard convension, please use CAN_MO40_STAT.
*/
#define	CAN_MOSTAT40	(CAN_MO40_STAT)

/** \brief  152C, Message Object  Acceptance Mask Register */
#define CAN_MO41_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001952Cu)

/** Alias (User Manual Name) for CAN_MO41_AMR.
* To use register names with standard convension, please use CAN_MO41_AMR.
*/
#define	CAN_MOAMR41	(CAN_MO41_AMR)

/** \brief  1538, Message Object  Arbitration Register */
#define CAN_MO41_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019538u)

/** Alias (User Manual Name) for CAN_MO41_AR.
* To use register names with standard convension, please use CAN_MO41_AR.
*/
#define	CAN_MOAR41	(CAN_MO41_AR)

/** \brief  153C, Message Object  Control Register */
#define CAN_MO41_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001953Cu)

/** Alias (User Manual Name) for CAN_MO41_CTR.
* To use register names with standard convension, please use CAN_MO41_CTR.
*/
#define	CAN_MOCTR41	(CAN_MO41_CTR)

/** \brief  1534, Message Object  Data Register High */
#define CAN_MO41_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019534u)

/** Alias (User Manual Name) for CAN_MO41_DATAH.
* To use register names with standard convension, please use CAN_MO41_DATAH.
*/
#define	CAN_MODATAH41	(CAN_MO41_DATAH)

/** \brief  1530, Message Object  Data Register Low */
#define CAN_MO41_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019530u)

/** Alias (User Manual Name) for CAN_MO41_DATAL.
* To use register names with standard convension, please use CAN_MO41_DATAL.
*/
#define	CAN_MODATAL41	(CAN_MO41_DATAL)

/** \brief  1520, Message Object  Function Control Register */
#define CAN_MO41_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019520u)

/** Alias (User Manual Name) for CAN_MO41_EDATA0.
* To use register names with standard convension, please use CAN_MO41_EDATA0.
*/
#define	CAN_EMO41DATA0	(CAN_MO41_EDATA0)

/** \brief  1524, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO41_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019524u)

/** Alias (User Manual Name) for CAN_MO41_EDATA1.
* To use register names with standard convension, please use CAN_MO41_EDATA1.
*/
#define	CAN_EMO41DATA1	(CAN_MO41_EDATA1)

/** \brief  1528, Message Object  Interrupt Pointer Register */
#define CAN_MO41_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019528u)

/** Alias (User Manual Name) for CAN_MO41_EDATA2.
* To use register names with standard convension, please use CAN_MO41_EDATA2.
*/
#define	CAN_EMO41DATA2	(CAN_MO41_EDATA2)

/** \brief  152C, Message Object  Acceptance Mask Register */
#define CAN_MO41_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001952Cu)

/** Alias (User Manual Name) for CAN_MO41_EDATA3.
* To use register names with standard convension, please use CAN_MO41_EDATA3.
*/
#define	CAN_EMO41DATA3	(CAN_MO41_EDATA3)

/** \brief  1530, Message Object  Data Register Low */
#define CAN_MO41_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019530u)

/** Alias (User Manual Name) for CAN_MO41_EDATA4.
* To use register names with standard convension, please use CAN_MO41_EDATA4.
*/
#define	CAN_EMO41DATA4	(CAN_MO41_EDATA4)

/** \brief  1534, Message Object  Data Register High */
#define CAN_MO41_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019534u)

