luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  1594, Message Object  Data Register High */
#define CAN_MO44_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019594u)

/** Alias (User Manual Name) for CAN_MO44_DATAH.
* To use register names with standard convension, please use CAN_MO44_DATAH.
*/
#define	CAN_MODATAH44	(CAN_MO44_DATAH)

/** \brief  1590, Message Object  Data Register Low */
#define CAN_MO44_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019590u)

/** Alias (User Manual Name) for CAN_MO44_DATAL.
* To use register names with standard convension, please use CAN_MO44_DATAL.
*/
#define	CAN_MODATAL44	(CAN_MO44_DATAL)

/** \brief  1580, Message Object  Function Control Register */
#define CAN_MO44_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019580u)

/** Alias (User Manual Name) for CAN_MO44_EDATA0.
* To use register names with standard convension, please use CAN_MO44_EDATA0.
*/
#define	CAN_EMO44DATA0	(CAN_MO44_EDATA0)

/** \brief  1584, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO44_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019584u)

/** Alias (User Manual Name) for CAN_MO44_EDATA1.
* To use register names with standard convension, please use CAN_MO44_EDATA1.
*/
#define	CAN_EMO44DATA1	(CAN_MO44_EDATA1)

/** \brief  1588, Message Object  Interrupt Pointer Register */
#define CAN_MO44_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019588u)

/** Alias (User Manual Name) for CAN_MO44_EDATA2.
* To use register names with standard convension, please use CAN_MO44_EDATA2.
*/
#define	CAN_EMO44DATA2	(CAN_MO44_EDATA2)

/** \brief  158C, Message Object  Acceptance Mask Register */
#define CAN_MO44_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001958Cu)

/** Alias (User Manual Name) for CAN_MO44_EDATA3.
* To use register names with standard convension, please use CAN_MO44_EDATA3.
*/
#define	CAN_EMO44DATA3	(CAN_MO44_EDATA3)

/** \brief  1590, Message Object  Data Register Low */
#define CAN_MO44_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019590u)

/** Alias (User Manual Name) for CAN_MO44_EDATA4.
* To use register names with standard convension, please use CAN_MO44_EDATA4.
*/
#define	CAN_EMO44DATA4	(CAN_MO44_EDATA4)

/** \brief  1594, Message Object  Data Register High */
#define CAN_MO44_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019594u)

/** Alias (User Manual Name) for CAN_MO44_EDATA5.
* To use register names with standard convension, please use CAN_MO44_EDATA5.
*/
#define	CAN_EMO44DATA5	(CAN_MO44_EDATA5)

/** \brief  1598, Message Object  Arbitration Register */
#define CAN_MO44_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019598u)

/** Alias (User Manual Name) for CAN_MO44_EDATA6.
* To use register names with standard convension, please use CAN_MO44_EDATA6.
*/
#define	CAN_EMO44DATA6	(CAN_MO44_EDATA6)

/** \brief  1580, Message Object  Function Control Register */
#define CAN_MO44_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019580u)

/** Alias (User Manual Name) for CAN_MO44_FCR.
* To use register names with standard convension, please use CAN_MO44_FCR.
*/
#define	CAN_MOFCR44	(CAN_MO44_FCR)

/** \brief  1584, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO44_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019584u)

/** Alias (User Manual Name) for CAN_MO44_FGPR.
* To use register names with standard convension, please use CAN_MO44_FGPR.
*/
#define	CAN_MOFGPR44	(CAN_MO44_FGPR)

/** \brief  1588, Message Object  Interrupt Pointer Register */
#define CAN_MO44_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019588u)

/** Alias (User Manual Name) for CAN_MO44_IPR.
* To use register names with standard convension, please use CAN_MO44_IPR.
*/
#define	CAN_MOIPR44	(CAN_MO44_IPR)

/** \brief  159C, Message Object  Control Register */
#define CAN_MO44_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001959Cu)

/** Alias (User Manual Name) for CAN_MO44_STAT.
* To use register names with standard convension, please use CAN_MO44_STAT.
*/
#define	CAN_MOSTAT44	(CAN_MO44_STAT)

/** \brief  15AC, Message Object  Acceptance Mask Register */
#define CAN_MO45_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00195ACu)

/** Alias (User Manual Name) for CAN_MO45_AMR.
* To use register names with standard convension, please use CAN_MO45_AMR.
*/
#define	CAN_MOAMR45	(CAN_MO45_AMR)

/** \brief  15B8, Message Object  Arbitration Register */
#define CAN_MO45_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00195B8u)

/** Alias (User Manual Name) for CAN_MO45_AR.
* To use register names with standard convension, please use CAN_MO45_AR.
*/
#define	CAN_MOAR45	(CAN_MO45_AR)

/** \brief  15BC, Message Object  Control Register */
#define CAN_MO45_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00195BCu)

/** Alias (User Manual Name) for CAN_MO45_CTR.
* To use register names with standard convension, please use CAN_MO45_CTR.
*/
#define	CAN_MOCTR45	(CAN_MO45_CTR)

/** \brief  15B4, Message Object  Data Register High */
#define CAN_MO45_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00195B4u)

/** Alias (User Manual Name) for CAN_MO45_DATAH.
* To use register names with standard convension, please use CAN_MO45_DATAH.
*/
#define	CAN_MODATAH45	(CAN_MO45_DATAH)

/** \brief  15B0, Message Object  Data Register Low */
#define CAN_MO45_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00195B0u)

/** Alias (User Manual Name) for CAN_MO45_DATAL.
* To use register names with standard convension, please use CAN_MO45_DATAL.
*/
#define	CAN_MODATAL45	(CAN_MO45_DATAL)

/** \brief  15A0, Message Object  Function Control Register */
#define CAN_MO45_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00195A0u)

/** Alias (User Manual Name) for CAN_MO45_EDATA0.
* To use register names with standard convension, please use CAN_MO45_EDATA0.
*/
#define	CAN_EMO45DATA0	(CAN_MO45_EDATA0)

/** \brief  15A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO45_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00195A4u)

