luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO45_EDATA1.
* To use register names with standard convension, please use CAN_MO45_EDATA1.
*/
#define	CAN_EMO45DATA1	(CAN_MO45_EDATA1)

/** \brief  15A8, Message Object  Interrupt Pointer Register */
#define CAN_MO45_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00195A8u)

/** Alias (User Manual Name) for CAN_MO45_EDATA2.
* To use register names with standard convension, please use CAN_MO45_EDATA2.
*/
#define	CAN_EMO45DATA2	(CAN_MO45_EDATA2)

/** \brief  15AC, Message Object  Acceptance Mask Register */
#define CAN_MO45_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00195ACu)

/** Alias (User Manual Name) for CAN_MO45_EDATA3.
* To use register names with standard convension, please use CAN_MO45_EDATA3.
*/
#define	CAN_EMO45DATA3	(CAN_MO45_EDATA3)

/** \brief  15B0, Message Object  Data Register Low */
#define CAN_MO45_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00195B0u)

/** Alias (User Manual Name) for CAN_MO45_EDATA4.
* To use register names with standard convension, please use CAN_MO45_EDATA4.
*/
#define	CAN_EMO45DATA4	(CAN_MO45_EDATA4)

/** \brief  15B4, Message Object  Data Register High */
#define CAN_MO45_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00195B4u)

/** Alias (User Manual Name) for CAN_MO45_EDATA5.
* To use register names with standard convension, please use CAN_MO45_EDATA5.
*/
#define	CAN_EMO45DATA5	(CAN_MO45_EDATA5)

/** \brief  15B8, Message Object  Arbitration Register */
#define CAN_MO45_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00195B8u)

/** Alias (User Manual Name) for CAN_MO45_EDATA6.
* To use register names with standard convension, please use CAN_MO45_EDATA6.
*/
#define	CAN_EMO45DATA6	(CAN_MO45_EDATA6)

/** \brief  15A0, Message Object  Function Control Register */
#define CAN_MO45_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00195A0u)

/** Alias (User Manual Name) for CAN_MO45_FCR.
* To use register names with standard convension, please use CAN_MO45_FCR.
*/
#define	CAN_MOFCR45	(CAN_MO45_FCR)

/** \brief  15A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO45_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00195A4u)

/** Alias (User Manual Name) for CAN_MO45_FGPR.
* To use register names with standard convension, please use CAN_MO45_FGPR.
*/
#define	CAN_MOFGPR45	(CAN_MO45_FGPR)

/** \brief  15A8, Message Object  Interrupt Pointer Register */
#define CAN_MO45_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00195A8u)

/** Alias (User Manual Name) for CAN_MO45_IPR.
* To use register names with standard convension, please use CAN_MO45_IPR.
*/
#define	CAN_MOIPR45	(CAN_MO45_IPR)

/** \brief  15BC, Message Object  Control Register */
#define CAN_MO45_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00195BCu)

/** Alias (User Manual Name) for CAN_MO45_STAT.
* To use register names with standard convension, please use CAN_MO45_STAT.
*/
#define	CAN_MOSTAT45	(CAN_MO45_STAT)

/** \brief  15CC, Message Object  Acceptance Mask Register */
#define CAN_MO46_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00195CCu)

/** Alias (User Manual Name) for CAN_MO46_AMR.
* To use register names with standard convension, please use CAN_MO46_AMR.
*/
#define	CAN_MOAMR46	(CAN_MO46_AMR)

/** \brief  15D8, Message Object  Arbitration Register */
#define CAN_MO46_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00195D8u)

/** Alias (User Manual Name) for CAN_MO46_AR.
* To use register names with standard convension, please use CAN_MO46_AR.
*/
#define	CAN_MOAR46	(CAN_MO46_AR)

/** \brief  15DC, Message Object  Control Register */
#define CAN_MO46_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00195DCu)

/** Alias (User Manual Name) for CAN_MO46_CTR.
* To use register names with standard convension, please use CAN_MO46_CTR.
*/
#define	CAN_MOCTR46	(CAN_MO46_CTR)

/** \brief  15D4, Message Object  Data Register High */
#define CAN_MO46_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00195D4u)

/** Alias (User Manual Name) for CAN_MO46_DATAH.
* To use register names with standard convension, please use CAN_MO46_DATAH.
*/
#define	CAN_MODATAH46	(CAN_MO46_DATAH)

/** \brief  15D0, Message Object  Data Register Low */
#define CAN_MO46_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00195D0u)

/** Alias (User Manual Name) for CAN_MO46_DATAL.
* To use register names with standard convension, please use CAN_MO46_DATAL.
*/
#define	CAN_MODATAL46	(CAN_MO46_DATAL)

/** \brief  15C0, Message Object  Function Control Register */
#define CAN_MO46_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00195C0u)

/** Alias (User Manual Name) for CAN_MO46_EDATA0.
* To use register names with standard convension, please use CAN_MO46_EDATA0.
*/
#define	CAN_EMO46DATA0	(CAN_MO46_EDATA0)

/** \brief  15C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO46_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00195C4u)

/** Alias (User Manual Name) for CAN_MO46_EDATA1.
* To use register names with standard convension, please use CAN_MO46_EDATA1.
*/
#define	CAN_EMO46DATA1	(CAN_MO46_EDATA1)

/** \brief  15C8, Message Object  Interrupt Pointer Register */
#define CAN_MO46_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00195C8u)

/** Alias (User Manual Name) for CAN_MO46_EDATA2.
* To use register names with standard convension, please use CAN_MO46_EDATA2.
*/
#define	CAN_EMO46DATA2	(CAN_MO46_EDATA2)

/** \brief  15CC, Message Object  Acceptance Mask Register */
#define CAN_MO46_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00195CCu)

/** Alias (User Manual Name) for CAN_MO46_EDATA3.
* To use register names with standard convension, please use CAN_MO46_EDATA3.
*/
#define	CAN_EMO46DATA3	(CAN_MO46_EDATA3)

/** \brief  15D0, Message Object  Data Register Low */
#define CAN_MO46_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00195D0u)

/** Alias (User Manual Name) for CAN_MO46_EDATA4.
* To use register names with standard convension, please use CAN_MO46_EDATA4.
*/
#define	CAN_EMO46DATA4	(CAN_MO46_EDATA4)

/** \brief  15D4, Message Object  Data Register High */
#define CAN_MO46_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00195D4u)

/** Alias (User Manual Name) for CAN_MO46_EDATA5.
* To use register names with standard convension, please use CAN_MO46_EDATA5.
*/
#define	CAN_EMO46DATA5	(CAN_MO46_EDATA5)

/** \brief  15D8, Message Object  Arbitration Register */
#define CAN_MO46_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00195D8u)

/** Alias (User Manual Name) for CAN_MO46_EDATA6.
* To use register names with standard convension, please use CAN_MO46_EDATA6.
*/
#define	CAN_EMO46DATA6	(CAN_MO46_EDATA6)

/** \brief  15C0, Message Object  Function Control Register */
#define CAN_MO46_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00195C0u)

/** Alias (User Manual Name) for CAN_MO46_FCR.
* To use register names with standard convension, please use CAN_MO46_FCR.
*/
#define	CAN_MOFCR46	(CAN_MO46_FCR)

/** \brief  15C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO46_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00195C4u)

/** Alias (User Manual Name) for CAN_MO46_FGPR.
* To use register names with standard convension, please use CAN_MO46_FGPR.
*/
#define	CAN_MOFGPR46	(CAN_MO46_FGPR)

/** \brief  15C8, Message Object  Interrupt Pointer Register */
#define CAN_MO46_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00195C8u)

/** Alias (User Manual Name) for CAN_MO46_IPR.
* To use register names with standard convension, please use CAN_MO46_IPR.
*/
#define	CAN_MOIPR46	(CAN_MO46_IPR)

