luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  1634, Message Object  Data Register High */
#define CAN_MO49_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019634u)

/** Alias (User Manual Name) for CAN_MO49_EDATA5.
* To use register names with standard convension, please use CAN_MO49_EDATA5.
*/
#define	CAN_EMO49DATA5	(CAN_MO49_EDATA5)

/** \brief  1638, Message Object  Arbitration Register */
#define CAN_MO49_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019638u)

/** Alias (User Manual Name) for CAN_MO49_EDATA6.
* To use register names with standard convension, please use CAN_MO49_EDATA6.
*/
#define	CAN_EMO49DATA6	(CAN_MO49_EDATA6)

/** \brief  1620, Message Object  Function Control Register */
#define CAN_MO49_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019620u)

/** Alias (User Manual Name) for CAN_MO49_FCR.
* To use register names with standard convension, please use CAN_MO49_FCR.
*/
#define	CAN_MOFCR49	(CAN_MO49_FCR)

/** \brief  1624, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO49_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019624u)

/** Alias (User Manual Name) for CAN_MO49_FGPR.
* To use register names with standard convension, please use CAN_MO49_FGPR.
*/
#define	CAN_MOFGPR49	(CAN_MO49_FGPR)

/** \brief  1628, Message Object  Interrupt Pointer Register */
#define CAN_MO49_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019628u)

/** Alias (User Manual Name) for CAN_MO49_IPR.
* To use register names with standard convension, please use CAN_MO49_IPR.
*/
#define	CAN_MOIPR49	(CAN_MO49_IPR)

/** \brief  163C, Message Object  Control Register */
#define CAN_MO49_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001963Cu)

/** Alias (User Manual Name) for CAN_MO49_STAT.
* To use register names with standard convension, please use CAN_MO49_STAT.
*/
#define	CAN_MOSTAT49	(CAN_MO49_STAT)

/** \brief  108C, Message Object  Acceptance Mask Register */
#define CAN_MO4_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001908Cu)

/** Alias (User Manual Name) for CAN_MO4_AMR.
* To use register names with standard convension, please use CAN_MO4_AMR.
*/
#define	CAN_MOAMR4	(CAN_MO4_AMR)

/** \brief  1098, Message Object  Arbitration Register */
#define CAN_MO4_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019098u)

/** Alias (User Manual Name) for CAN_MO4_AR.
* To use register names with standard convension, please use CAN_MO4_AR.
*/
#define	CAN_MOAR4	(CAN_MO4_AR)

/** \brief  109C, Message Object  Control Register */
#define CAN_MO4_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001909Cu)

/** Alias (User Manual Name) for CAN_MO4_CTR.
* To use register names with standard convension, please use CAN_MO4_CTR.
*/
#define	CAN_MOCTR4	(CAN_MO4_CTR)

/** \brief  1094, Message Object  Data Register High */
#define CAN_MO4_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019094u)

/** Alias (User Manual Name) for CAN_MO4_DATAH.
* To use register names with standard convension, please use CAN_MO4_DATAH.
*/
#define	CAN_MODATAH4	(CAN_MO4_DATAH)

/** \brief  1090, Message Object  Data Register Low */
#define CAN_MO4_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019090u)

/** Alias (User Manual Name) for CAN_MO4_DATAL.
* To use register names with standard convension, please use CAN_MO4_DATAL.
*/
#define	CAN_MODATAL4	(CAN_MO4_DATAL)

/** \brief  1080, Message Object  Function Control Register */
#define CAN_MO4_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019080u)

/** Alias (User Manual Name) for CAN_MO4_EDATA0.
* To use register names with standard convension, please use CAN_MO4_EDATA0.
*/
#define	CAN_EMO4DATA0	(CAN_MO4_EDATA0)

/** \brief  1084, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO4_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019084u)

/** Alias (User Manual Name) for CAN_MO4_EDATA1.
* To use register names with standard convension, please use CAN_MO4_EDATA1.
*/
#define	CAN_EMO4DATA1	(CAN_MO4_EDATA1)

/** \brief  1088, Message Object  Interrupt Pointer Register */
#define CAN_MO4_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019088u)

/** Alias (User Manual Name) for CAN_MO4_EDATA2.
* To use register names with standard convension, please use CAN_MO4_EDATA2.
*/
#define	CAN_EMO4DATA2	(CAN_MO4_EDATA2)

/** \brief  108C, Message Object  Acceptance Mask Register */
#define CAN_MO4_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001908Cu)

/** Alias (User Manual Name) for CAN_MO4_EDATA3.
* To use register names with standard convension, please use CAN_MO4_EDATA3.
*/
#define	CAN_EMO4DATA3	(CAN_MO4_EDATA3)

/** \brief  1090, Message Object  Data Register Low */
#define CAN_MO4_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019090u)

/** Alias (User Manual Name) for CAN_MO4_EDATA4.
* To use register names with standard convension, please use CAN_MO4_EDATA4.
*/
#define	CAN_EMO4DATA4	(CAN_MO4_EDATA4)

/** \brief  1094, Message Object  Data Register High */
#define CAN_MO4_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019094u)

/** Alias (User Manual Name) for CAN_MO4_EDATA5.
* To use register names with standard convension, please use CAN_MO4_EDATA5.
*/
#define	CAN_EMO4DATA5	(CAN_MO4_EDATA5)

/** \brief  1098, Message Object  Arbitration Register */
#define CAN_MO4_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019098u)

/** Alias (User Manual Name) for CAN_MO4_EDATA6.
* To use register names with standard convension, please use CAN_MO4_EDATA6.
*/
#define	CAN_EMO4DATA6	(CAN_MO4_EDATA6)

/** \brief  1080, Message Object  Function Control Register */
#define CAN_MO4_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019080u)

/** Alias (User Manual Name) for CAN_MO4_FCR.
* To use register names with standard convension, please use CAN_MO4_FCR.
*/
#define	CAN_MOFCR4	(CAN_MO4_FCR)

/** \brief  1084, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO4_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019084u)

