luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  1660, Message Object  Function Control Register */
#define CAN_MO51_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019660u)

/** Alias (User Manual Name) for CAN_MO51_EDATA0.
* To use register names with standard convension, please use CAN_MO51_EDATA0.
*/
#define	CAN_EMO51DATA0	(CAN_MO51_EDATA0)

/** \brief  1664, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO51_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019664u)

/** Alias (User Manual Name) for CAN_MO51_EDATA1.
* To use register names with standard convension, please use CAN_MO51_EDATA1.
*/
#define	CAN_EMO51DATA1	(CAN_MO51_EDATA1)

/** \brief  1668, Message Object  Interrupt Pointer Register */
#define CAN_MO51_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019668u)

/** Alias (User Manual Name) for CAN_MO51_EDATA2.
* To use register names with standard convension, please use CAN_MO51_EDATA2.
*/
#define	CAN_EMO51DATA2	(CAN_MO51_EDATA2)

/** \brief  166C, Message Object  Acceptance Mask Register */
#define CAN_MO51_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001966Cu)

/** Alias (User Manual Name) for CAN_MO51_EDATA3.
* To use register names with standard convension, please use CAN_MO51_EDATA3.
*/
#define	CAN_EMO51DATA3	(CAN_MO51_EDATA3)

/** \brief  1670, Message Object  Data Register Low */
#define CAN_MO51_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019670u)

/** Alias (User Manual Name) for CAN_MO51_EDATA4.
* To use register names with standard convension, please use CAN_MO51_EDATA4.
*/
#define	CAN_EMO51DATA4	(CAN_MO51_EDATA4)

/** \brief  1674, Message Object  Data Register High */
#define CAN_MO51_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019674u)

/** Alias (User Manual Name) for CAN_MO51_EDATA5.
* To use register names with standard convension, please use CAN_MO51_EDATA5.
*/
#define	CAN_EMO51DATA5	(CAN_MO51_EDATA5)

/** \brief  1678, Message Object  Arbitration Register */
#define CAN_MO51_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019678u)

/** Alias (User Manual Name) for CAN_MO51_EDATA6.
* To use register names with standard convension, please use CAN_MO51_EDATA6.
*/
#define	CAN_EMO51DATA6	(CAN_MO51_EDATA6)

/** \brief  1660, Message Object  Function Control Register */
#define CAN_MO51_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019660u)

/** Alias (User Manual Name) for CAN_MO51_FCR.
* To use register names with standard convension, please use CAN_MO51_FCR.
*/
#define	CAN_MOFCR51	(CAN_MO51_FCR)

/** \brief  1664, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO51_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019664u)

/** Alias (User Manual Name) for CAN_MO51_FGPR.
* To use register names with standard convension, please use CAN_MO51_FGPR.
*/
#define	CAN_MOFGPR51	(CAN_MO51_FGPR)

/** \brief  1668, Message Object  Interrupt Pointer Register */
#define CAN_MO51_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019668u)

/** Alias (User Manual Name) for CAN_MO51_IPR.
* To use register names with standard convension, please use CAN_MO51_IPR.
*/
#define	CAN_MOIPR51	(CAN_MO51_IPR)

/** \brief  167C, Message Object  Control Register */
#define CAN_MO51_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001967Cu)

/** Alias (User Manual Name) for CAN_MO51_STAT.
* To use register names with standard convension, please use CAN_MO51_STAT.
*/
#define	CAN_MOSTAT51	(CAN_MO51_STAT)

/** \brief  168C, Message Object  Acceptance Mask Register */
#define CAN_MO52_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001968Cu)

/** Alias (User Manual Name) for CAN_MO52_AMR.
* To use register names with standard convension, please use CAN_MO52_AMR.
*/
#define	CAN_MOAMR52	(CAN_MO52_AMR)

/** \brief  1698, Message Object  Arbitration Register */
#define CAN_MO52_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019698u)

/** Alias (User Manual Name) for CAN_MO52_AR.
* To use register names with standard convension, please use CAN_MO52_AR.
*/
#define	CAN_MOAR52	(CAN_MO52_AR)

/** \brief  169C, Message Object  Control Register */
#define CAN_MO52_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001969Cu)

/** Alias (User Manual Name) for CAN_MO52_CTR.
* To use register names with standard convension, please use CAN_MO52_CTR.
*/
#define	CAN_MOCTR52	(CAN_MO52_CTR)

/** \brief  1694, Message Object  Data Register High */
#define CAN_MO52_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019694u)

/** Alias (User Manual Name) for CAN_MO52_DATAH.
* To use register names with standard convension, please use CAN_MO52_DATAH.
*/
#define	CAN_MODATAH52	(CAN_MO52_DATAH)

/** \brief  1690, Message Object  Data Register Low */
#define CAN_MO52_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019690u)

/** Alias (User Manual Name) for CAN_MO52_DATAL.
* To use register names with standard convension, please use CAN_MO52_DATAL.
*/
#define	CAN_MODATAL52	(CAN_MO52_DATAL)

/** \brief  1680, Message Object  Function Control Register */
#define CAN_MO52_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019680u)

/** Alias (User Manual Name) for CAN_MO52_EDATA0.
* To use register names with standard convension, please use CAN_MO52_EDATA0.
*/
#define	CAN_EMO52DATA0	(CAN_MO52_EDATA0)

/** \brief  1684, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO52_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019684u)

/** Alias (User Manual Name) for CAN_MO52_EDATA1.
* To use register names with standard convension, please use CAN_MO52_EDATA1.
*/
#define	CAN_EMO52DATA1	(CAN_MO52_EDATA1)

/** \brief  1688, Message Object  Interrupt Pointer Register */
#define CAN_MO52_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019688u)

/** Alias (User Manual Name) for CAN_MO52_EDATA2.
* To use register names with standard convension, please use CAN_MO52_EDATA2.
*/
#define	CAN_EMO52DATA2	(CAN_MO52_EDATA2)

/** \brief  168C, Message Object  Acceptance Mask Register */
#define CAN_MO52_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001968Cu)

/** Alias (User Manual Name) for CAN_MO52_EDATA3.
* To use register names with standard convension, please use CAN_MO52_EDATA3.
*/
#define	CAN_EMO52DATA3	(CAN_MO52_EDATA3)

/** \brief  1690, Message Object  Data Register Low */
#define CAN_MO52_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019690u)

/** Alias (User Manual Name) for CAN_MO52_EDATA4.
* To use register names with standard convension, please use CAN_MO52_EDATA4.
*/
#define	CAN_EMO52DATA4	(CAN_MO52_EDATA4)

/** \brief  1694, Message Object  Data Register High */
#define CAN_MO52_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019694u)

/** Alias (User Manual Name) for CAN_MO52_EDATA5.
* To use register names with standard convension, please use CAN_MO52_EDATA5.
*/
#define	CAN_EMO52DATA5	(CAN_MO52_EDATA5)

/** \brief  1698, Message Object  Arbitration Register */
#define CAN_MO52_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019698u)

