luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  16CC, Message Object  Acceptance Mask Register */
#define CAN_MO54_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00196CCu)

/** Alias (User Manual Name) for CAN_MO54_AMR.
* To use register names with standard convension, please use CAN_MO54_AMR.
*/
#define	CAN_MOAMR54	(CAN_MO54_AMR)

/** \brief  16D8, Message Object  Arbitration Register */
#define CAN_MO54_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00196D8u)

/** Alias (User Manual Name) for CAN_MO54_AR.
* To use register names with standard convension, please use CAN_MO54_AR.
*/
#define	CAN_MOAR54	(CAN_MO54_AR)

/** \brief  16DC, Message Object  Control Register */
#define CAN_MO54_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00196DCu)

/** Alias (User Manual Name) for CAN_MO54_CTR.
* To use register names with standard convension, please use CAN_MO54_CTR.
*/
#define	CAN_MOCTR54	(CAN_MO54_CTR)

/** \brief  16D4, Message Object  Data Register High */
#define CAN_MO54_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00196D4u)

/** Alias (User Manual Name) for CAN_MO54_DATAH.
* To use register names with standard convension, please use CAN_MO54_DATAH.
*/
#define	CAN_MODATAH54	(CAN_MO54_DATAH)

/** \brief  16D0, Message Object  Data Register Low */
#define CAN_MO54_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00196D0u)

/** Alias (User Manual Name) for CAN_MO54_DATAL.
* To use register names with standard convension, please use CAN_MO54_DATAL.
*/
#define	CAN_MODATAL54	(CAN_MO54_DATAL)

/** \brief  16C0, Message Object  Function Control Register */
#define CAN_MO54_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00196C0u)

/** Alias (User Manual Name) for CAN_MO54_EDATA0.
* To use register names with standard convension, please use CAN_MO54_EDATA0.
*/
#define	CAN_EMO54DATA0	(CAN_MO54_EDATA0)

/** \brief  16C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO54_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00196C4u)

/** Alias (User Manual Name) for CAN_MO54_EDATA1.
* To use register names with standard convension, please use CAN_MO54_EDATA1.
*/
#define	CAN_EMO54DATA1	(CAN_MO54_EDATA1)

/** \brief  16C8, Message Object  Interrupt Pointer Register */
#define CAN_MO54_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00196C8u)

/** Alias (User Manual Name) for CAN_MO54_EDATA2.
* To use register names with standard convension, please use CAN_MO54_EDATA2.
*/
#define	CAN_EMO54DATA2	(CAN_MO54_EDATA2)

/** \brief  16CC, Message Object  Acceptance Mask Register */
#define CAN_MO54_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00196CCu)

/** Alias (User Manual Name) for CAN_MO54_EDATA3.
* To use register names with standard convension, please use CAN_MO54_EDATA3.
*/
#define	CAN_EMO54DATA3	(CAN_MO54_EDATA3)

/** \brief  16D0, Message Object  Data Register Low */
#define CAN_MO54_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00196D0u)

/** Alias (User Manual Name) for CAN_MO54_EDATA4.
* To use register names with standard convension, please use CAN_MO54_EDATA4.
*/
#define	CAN_EMO54DATA4	(CAN_MO54_EDATA4)

/** \brief  16D4, Message Object  Data Register High */
#define CAN_MO54_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00196D4u)

/** Alias (User Manual Name) for CAN_MO54_EDATA5.
* To use register names with standard convension, please use CAN_MO54_EDATA5.
*/
#define	CAN_EMO54DATA5	(CAN_MO54_EDATA5)

/** \brief  16D8, Message Object  Arbitration Register */
#define CAN_MO54_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00196D8u)

/** Alias (User Manual Name) for CAN_MO54_EDATA6.
* To use register names with standard convension, please use CAN_MO54_EDATA6.
*/
#define	CAN_EMO54DATA6	(CAN_MO54_EDATA6)

/** \brief  16C0, Message Object  Function Control Register */
#define CAN_MO54_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00196C0u)

/** Alias (User Manual Name) for CAN_MO54_FCR.
* To use register names with standard convension, please use CAN_MO54_FCR.
*/
#define	CAN_MOFCR54	(CAN_MO54_FCR)

/** \brief  16C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO54_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00196C4u)

/** Alias (User Manual Name) for CAN_MO54_FGPR.
* To use register names with standard convension, please use CAN_MO54_FGPR.
*/
#define	CAN_MOFGPR54	(CAN_MO54_FGPR)

/** \brief  16C8, Message Object  Interrupt Pointer Register */
#define CAN_MO54_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00196C8u)

/** Alias (User Manual Name) for CAN_MO54_IPR.
* To use register names with standard convension, please use CAN_MO54_IPR.
*/
#define	CAN_MOIPR54	(CAN_MO54_IPR)

/** \brief  16DC, Message Object  Control Register */
#define CAN_MO54_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00196DCu)

/** Alias (User Manual Name) for CAN_MO54_STAT.
* To use register names with standard convension, please use CAN_MO54_STAT.
*/
#define	CAN_MOSTAT54	(CAN_MO54_STAT)

/** \brief  16EC, Message Object  Acceptance Mask Register */
#define CAN_MO55_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00196ECu)

/** Alias (User Manual Name) for CAN_MO55_AMR.
* To use register names with standard convension, please use CAN_MO55_AMR.
*/
#define	CAN_MOAMR55	(CAN_MO55_AMR)

/** \brief  16F8, Message Object  Arbitration Register */
#define CAN_MO55_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00196F8u)

/** Alias (User Manual Name) for CAN_MO55_AR.
* To use register names with standard convension, please use CAN_MO55_AR.
*/
#define	CAN_MOAR55	(CAN_MO55_AR)

/** \brief  16FC, Message Object  Control Register */
#define CAN_MO55_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00196FCu)

/** Alias (User Manual Name) for CAN_MO55_CTR.
* To use register names with standard convension, please use CAN_MO55_CTR.
*/
#define	CAN_MOCTR55	(CAN_MO55_CTR)

/** \brief  16F4, Message Object  Data Register High */
#define CAN_MO55_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00196F4u)

/** Alias (User Manual Name) for CAN_MO55_DATAH.
* To use register names with standard convension, please use CAN_MO55_DATAH.
*/
#define	CAN_MODATAH55	(CAN_MO55_DATAH)

