luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  16F0, Message Object  Data Register Low */
#define CAN_MO55_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00196F0u)

/** Alias (User Manual Name) for CAN_MO55_DATAL.
* To use register names with standard convension, please use CAN_MO55_DATAL.
*/
#define	CAN_MODATAL55	(CAN_MO55_DATAL)

/** \brief  16E0, Message Object  Function Control Register */
#define CAN_MO55_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00196E0u)

/** Alias (User Manual Name) for CAN_MO55_EDATA0.
* To use register names with standard convension, please use CAN_MO55_EDATA0.
*/
#define	CAN_EMO55DATA0	(CAN_MO55_EDATA0)

/** \brief  16E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO55_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00196E4u)

/** Alias (User Manual Name) for CAN_MO55_EDATA1.
* To use register names with standard convension, please use CAN_MO55_EDATA1.
*/
#define	CAN_EMO55DATA1	(CAN_MO55_EDATA1)

/** \brief  16E8, Message Object  Interrupt Pointer Register */
#define CAN_MO55_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00196E8u)

/** Alias (User Manual Name) for CAN_MO55_EDATA2.
* To use register names with standard convension, please use CAN_MO55_EDATA2.
*/
#define	CAN_EMO55DATA2	(CAN_MO55_EDATA2)

/** \brief  16EC, Message Object  Acceptance Mask Register */
#define CAN_MO55_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00196ECu)

/** Alias (User Manual Name) for CAN_MO55_EDATA3.
* To use register names with standard convension, please use CAN_MO55_EDATA3.
*/
#define	CAN_EMO55DATA3	(CAN_MO55_EDATA3)

/** \brief  16F0, Message Object  Data Register Low */
#define CAN_MO55_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00196F0u)

/** Alias (User Manual Name) for CAN_MO55_EDATA4.
* To use register names with standard convension, please use CAN_MO55_EDATA4.
*/
#define	CAN_EMO55DATA4	(CAN_MO55_EDATA4)

/** \brief  16F4, Message Object  Data Register High */
#define CAN_MO55_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00196F4u)

/** Alias (User Manual Name) for CAN_MO55_EDATA5.
* To use register names with standard convension, please use CAN_MO55_EDATA5.
*/
#define	CAN_EMO55DATA5	(CAN_MO55_EDATA5)

/** \brief  16F8, Message Object  Arbitration Register */
#define CAN_MO55_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00196F8u)

/** Alias (User Manual Name) for CAN_MO55_EDATA6.
* To use register names with standard convension, please use CAN_MO55_EDATA6.
*/
#define	CAN_EMO55DATA6	(CAN_MO55_EDATA6)

/** \brief  16E0, Message Object  Function Control Register */
#define CAN_MO55_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00196E0u)

/** Alias (User Manual Name) for CAN_MO55_FCR.
* To use register names with standard convension, please use CAN_MO55_FCR.
*/
#define	CAN_MOFCR55	(CAN_MO55_FCR)

/** \brief  16E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO55_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00196E4u)

/** Alias (User Manual Name) for CAN_MO55_FGPR.
* To use register names with standard convension, please use CAN_MO55_FGPR.
*/
#define	CAN_MOFGPR55	(CAN_MO55_FGPR)

/** \brief  16E8, Message Object  Interrupt Pointer Register */
#define CAN_MO55_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00196E8u)

/** Alias (User Manual Name) for CAN_MO55_IPR.
* To use register names with standard convension, please use CAN_MO55_IPR.
*/
#define	CAN_MOIPR55	(CAN_MO55_IPR)

/** \brief  16FC, Message Object  Control Register */
#define CAN_MO55_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00196FCu)

/** Alias (User Manual Name) for CAN_MO55_STAT.
* To use register names with standard convension, please use CAN_MO55_STAT.
*/
#define	CAN_MOSTAT55	(CAN_MO55_STAT)

/** \brief  170C, Message Object  Acceptance Mask Register */
#define CAN_MO56_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001970Cu)

/** Alias (User Manual Name) for CAN_MO56_AMR.
* To use register names with standard convension, please use CAN_MO56_AMR.
*/
#define	CAN_MOAMR56	(CAN_MO56_AMR)

/** \brief  1718, Message Object  Arbitration Register */
#define CAN_MO56_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019718u)

/** Alias (User Manual Name) for CAN_MO56_AR.
* To use register names with standard convension, please use CAN_MO56_AR.
*/
#define	CAN_MOAR56	(CAN_MO56_AR)

/** \brief  171C, Message Object  Control Register */
#define CAN_MO56_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001971Cu)

/** Alias (User Manual Name) for CAN_MO56_CTR.
* To use register names with standard convension, please use CAN_MO56_CTR.
*/
#define	CAN_MOCTR56	(CAN_MO56_CTR)

/** \brief  1714, Message Object  Data Register High */
#define CAN_MO56_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019714u)

/** Alias (User Manual Name) for CAN_MO56_DATAH.
* To use register names with standard convension, please use CAN_MO56_DATAH.
*/
#define	CAN_MODATAH56	(CAN_MO56_DATAH)

/** \brief  1710, Message Object  Data Register Low */
#define CAN_MO56_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019710u)

/** Alias (User Manual Name) for CAN_MO56_DATAL.
* To use register names with standard convension, please use CAN_MO56_DATAL.
*/
#define	CAN_MODATAL56	(CAN_MO56_DATAL)

/** \brief  1700, Message Object  Function Control Register */
#define CAN_MO56_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019700u)

/** Alias (User Manual Name) for CAN_MO56_EDATA0.
* To use register names with standard convension, please use CAN_MO56_EDATA0.
*/
#define	CAN_EMO56DATA0	(CAN_MO56_EDATA0)

/** \brief  1704, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO56_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019704u)

/** Alias (User Manual Name) for CAN_MO56_EDATA1.
* To use register names with standard convension, please use CAN_MO56_EDATA1.
*/
#define	CAN_EMO56DATA1	(CAN_MO56_EDATA1)

/** \brief  1708, Message Object  Interrupt Pointer Register */
#define CAN_MO56_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019708u)

