luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO56_EDATA2.
* To use register names with standard convension, please use CAN_MO56_EDATA2.
*/
#define	CAN_EMO56DATA2	(CAN_MO56_EDATA2)

/** \brief  170C, Message Object  Acceptance Mask Register */
#define CAN_MO56_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001970Cu)

/** Alias (User Manual Name) for CAN_MO56_EDATA3.
* To use register names with standard convension, please use CAN_MO56_EDATA3.
*/
#define	CAN_EMO56DATA3	(CAN_MO56_EDATA3)

/** \brief  1710, Message Object  Data Register Low */
#define CAN_MO56_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019710u)

/** Alias (User Manual Name) for CAN_MO56_EDATA4.
* To use register names with standard convension, please use CAN_MO56_EDATA4.
*/
#define	CAN_EMO56DATA4	(CAN_MO56_EDATA4)

/** \brief  1714, Message Object  Data Register High */
#define CAN_MO56_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019714u)

/** Alias (User Manual Name) for CAN_MO56_EDATA5.
* To use register names with standard convension, please use CAN_MO56_EDATA5.
*/
#define	CAN_EMO56DATA5	(CAN_MO56_EDATA5)

/** \brief  1718, Message Object  Arbitration Register */
#define CAN_MO56_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019718u)

/** Alias (User Manual Name) for CAN_MO56_EDATA6.
* To use register names with standard convension, please use CAN_MO56_EDATA6.
*/
#define	CAN_EMO56DATA6	(CAN_MO56_EDATA6)

/** \brief  1700, Message Object  Function Control Register */
#define CAN_MO56_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019700u)

/** Alias (User Manual Name) for CAN_MO56_FCR.
* To use register names with standard convension, please use CAN_MO56_FCR.
*/
#define	CAN_MOFCR56	(CAN_MO56_FCR)

/** \brief  1704, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO56_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019704u)

/** Alias (User Manual Name) for CAN_MO56_FGPR.
* To use register names with standard convension, please use CAN_MO56_FGPR.
*/
#define	CAN_MOFGPR56	(CAN_MO56_FGPR)

/** \brief  1708, Message Object  Interrupt Pointer Register */
#define CAN_MO56_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019708u)

/** Alias (User Manual Name) for CAN_MO56_IPR.
* To use register names with standard convension, please use CAN_MO56_IPR.
*/
#define	CAN_MOIPR56	(CAN_MO56_IPR)

/** \brief  171C, Message Object  Control Register */
#define CAN_MO56_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001971Cu)

/** Alias (User Manual Name) for CAN_MO56_STAT.
* To use register names with standard convension, please use CAN_MO56_STAT.
*/
#define	CAN_MOSTAT56	(CAN_MO56_STAT)

/** \brief  172C, Message Object  Acceptance Mask Register */
#define CAN_MO57_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001972Cu)

/** Alias (User Manual Name) for CAN_MO57_AMR.
* To use register names with standard convension, please use CAN_MO57_AMR.
*/
#define	CAN_MOAMR57	(CAN_MO57_AMR)

/** \brief  1738, Message Object  Arbitration Register */
#define CAN_MO57_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019738u)

/** Alias (User Manual Name) for CAN_MO57_AR.
* To use register names with standard convension, please use CAN_MO57_AR.
*/
#define	CAN_MOAR57	(CAN_MO57_AR)

/** \brief  173C, Message Object  Control Register */
#define CAN_MO57_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001973Cu)

/** Alias (User Manual Name) for CAN_MO57_CTR.
* To use register names with standard convension, please use CAN_MO57_CTR.
*/
#define	CAN_MOCTR57	(CAN_MO57_CTR)

/** \brief  1734, Message Object  Data Register High */
#define CAN_MO57_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019734u)

/** Alias (User Manual Name) for CAN_MO57_DATAH.
* To use register names with standard convension, please use CAN_MO57_DATAH.
*/
#define	CAN_MODATAH57	(CAN_MO57_DATAH)

/** \brief  1730, Message Object  Data Register Low */
#define CAN_MO57_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019730u)

/** Alias (User Manual Name) for CAN_MO57_DATAL.
* To use register names with standard convension, please use CAN_MO57_DATAL.
*/
#define	CAN_MODATAL57	(CAN_MO57_DATAL)

/** \brief  1720, Message Object  Function Control Register */
#define CAN_MO57_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019720u)

/** Alias (User Manual Name) for CAN_MO57_EDATA0.
* To use register names with standard convension, please use CAN_MO57_EDATA0.
*/
#define	CAN_EMO57DATA0	(CAN_MO57_EDATA0)

/** \brief  1724, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO57_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019724u)

/** Alias (User Manual Name) for CAN_MO57_EDATA1.
* To use register names with standard convension, please use CAN_MO57_EDATA1.
*/
#define	CAN_EMO57DATA1	(CAN_MO57_EDATA1)

/** \brief  1728, Message Object  Interrupt Pointer Register */
#define CAN_MO57_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019728u)

/** Alias (User Manual Name) for CAN_MO57_EDATA2.
* To use register names with standard convension, please use CAN_MO57_EDATA2.
*/
#define	CAN_EMO57DATA2	(CAN_MO57_EDATA2)

/** \brief  172C, Message Object  Acceptance Mask Register */
#define CAN_MO57_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001972Cu)

/** Alias (User Manual Name) for CAN_MO57_EDATA3.
* To use register names with standard convension, please use CAN_MO57_EDATA3.
*/
#define	CAN_EMO57DATA3	(CAN_MO57_EDATA3)

/** \brief  1730, Message Object  Data Register Low */
#define CAN_MO57_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019730u)

/** Alias (User Manual Name) for CAN_MO57_EDATA4.
* To use register names with standard convension, please use CAN_MO57_EDATA4.
*/
#define	CAN_EMO57DATA4	(CAN_MO57_EDATA4)

/** \brief  1734, Message Object  Data Register High */
#define CAN_MO57_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019734u)

/** Alias (User Manual Name) for CAN_MO57_EDATA5.
* To use register names with standard convension, please use CAN_MO57_EDATA5.
*/
#define	CAN_EMO57DATA5	(CAN_MO57_EDATA5)

/** \brief  1738, Message Object  Arbitration Register */
#define CAN_MO57_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019738u)

/** Alias (User Manual Name) for CAN_MO57_EDATA6.
* To use register names with standard convension, please use CAN_MO57_EDATA6.
*/
#define	CAN_EMO57DATA6	(CAN_MO57_EDATA6)

/** \brief  1720, Message Object  Function Control Register */
#define CAN_MO57_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019720u)

