luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  18D4, Message Object  Data Register High */
#define CAN_MO70_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00198D4u)

/** Alias (User Manual Name) for CAN_MO70_DATAH.
* To use register names with standard convension, please use CAN_MO70_DATAH.
*/
#define	CAN_MODATAH70	(CAN_MO70_DATAH)

/** \brief  18D0, Message Object  Data Register Low */
#define CAN_MO70_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00198D0u)

/** Alias (User Manual Name) for CAN_MO70_DATAL.
* To use register names with standard convension, please use CAN_MO70_DATAL.
*/
#define	CAN_MODATAL70	(CAN_MO70_DATAL)

/** \brief  18C0, Message Object  Function Control Register */
#define CAN_MO70_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00198C0u)

/** Alias (User Manual Name) for CAN_MO70_EDATA0.
* To use register names with standard convension, please use CAN_MO70_EDATA0.
*/
#define	CAN_EMO70DATA0	(CAN_MO70_EDATA0)

/** \brief  18C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO70_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00198C4u)

/** Alias (User Manual Name) for CAN_MO70_EDATA1.
* To use register names with standard convension, please use CAN_MO70_EDATA1.
*/
#define	CAN_EMO70DATA1	(CAN_MO70_EDATA1)

/** \brief  18C8, Message Object  Interrupt Pointer Register */
#define CAN_MO70_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00198C8u)

/** Alias (User Manual Name) for CAN_MO70_EDATA2.
* To use register names with standard convension, please use CAN_MO70_EDATA2.
*/
#define	CAN_EMO70DATA2	(CAN_MO70_EDATA2)

/** \brief  18CC, Message Object  Acceptance Mask Register */
#define CAN_MO70_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00198CCu)

/** Alias (User Manual Name) for CAN_MO70_EDATA3.
* To use register names with standard convension, please use CAN_MO70_EDATA3.
*/
#define	CAN_EMO70DATA3	(CAN_MO70_EDATA3)

/** \brief  18D0, Message Object  Data Register Low */
#define CAN_MO70_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00198D0u)

/** Alias (User Manual Name) for CAN_MO70_EDATA4.
* To use register names with standard convension, please use CAN_MO70_EDATA4.
*/
#define	CAN_EMO70DATA4	(CAN_MO70_EDATA4)

/** \brief  18D4, Message Object  Data Register High */
#define CAN_MO70_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00198D4u)

/** Alias (User Manual Name) for CAN_MO70_EDATA5.
* To use register names with standard convension, please use CAN_MO70_EDATA5.
*/
#define	CAN_EMO70DATA5	(CAN_MO70_EDATA5)

/** \brief  18D8, Message Object  Arbitration Register */
#define CAN_MO70_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00198D8u)

/** Alias (User Manual Name) for CAN_MO70_EDATA6.
* To use register names with standard convension, please use CAN_MO70_EDATA6.
*/
#define	CAN_EMO70DATA6	(CAN_MO70_EDATA6)

/** \brief  18C0, Message Object  Function Control Register */
#define CAN_MO70_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00198C0u)

/** Alias (User Manual Name) for CAN_MO70_FCR.
* To use register names with standard convension, please use CAN_MO70_FCR.
*/
#define	CAN_MOFCR70	(CAN_MO70_FCR)

/** \brief  18C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO70_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00198C4u)

/** Alias (User Manual Name) for CAN_MO70_FGPR.
* To use register names with standard convension, please use CAN_MO70_FGPR.
*/
#define	CAN_MOFGPR70	(CAN_MO70_FGPR)

/** \brief  18C8, Message Object  Interrupt Pointer Register */
#define CAN_MO70_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00198C8u)

/** Alias (User Manual Name) for CAN_MO70_IPR.
* To use register names with standard convension, please use CAN_MO70_IPR.
*/
#define	CAN_MOIPR70	(CAN_MO70_IPR)

/** \brief  18DC, Message Object  Control Register */
#define CAN_MO70_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00198DCu)

/** Alias (User Manual Name) for CAN_MO70_STAT.
* To use register names with standard convension, please use CAN_MO70_STAT.
*/
#define	CAN_MOSTAT70	(CAN_MO70_STAT)

/** \brief  18EC, Message Object  Acceptance Mask Register */
#define CAN_MO71_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00198ECu)

/** Alias (User Manual Name) for CAN_MO71_AMR.
* To use register names with standard convension, please use CAN_MO71_AMR.
*/
#define	CAN_MOAMR71	(CAN_MO71_AMR)

/** \brief  18F8, Message Object  Arbitration Register */
#define CAN_MO71_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00198F8u)

/** Alias (User Manual Name) for CAN_MO71_AR.
* To use register names with standard convension, please use CAN_MO71_AR.
*/
#define	CAN_MOAR71	(CAN_MO71_AR)

/** \brief  18FC, Message Object  Control Register */
#define CAN_MO71_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00198FCu)

/** Alias (User Manual Name) for CAN_MO71_CTR.
* To use register names with standard convension, please use CAN_MO71_CTR.
*/
#define	CAN_MOCTR71	(CAN_MO71_CTR)

/** \brief  18F4, Message Object  Data Register High */
#define CAN_MO71_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00198F4u)

/** Alias (User Manual Name) for CAN_MO71_DATAH.
* To use register names with standard convension, please use CAN_MO71_DATAH.
*/
#define	CAN_MODATAH71	(CAN_MO71_DATAH)

/** \brief  18F0, Message Object  Data Register Low */
#define CAN_MO71_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00198F0u)

/** Alias (User Manual Name) for CAN_MO71_DATAL.
* To use register names with standard convension, please use CAN_MO71_DATAL.
*/
#define	CAN_MODATAL71	(CAN_MO71_DATAL)

/** \brief  18E0, Message Object  Function Control Register */
#define CAN_MO71_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00198E0u)

/** Alias (User Manual Name) for CAN_MO71_EDATA0.
* To use register names with standard convension, please use CAN_MO71_EDATA0.
*/
#define	CAN_EMO71DATA0	(CAN_MO71_EDATA0)

/** \brief  18E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO71_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00198E4u)

/** Alias (User Manual Name) for CAN_MO71_EDATA1.
* To use register names with standard convension, please use CAN_MO71_EDATA1.
*/
#define	CAN_EMO71DATA1	(CAN_MO71_EDATA1)

/** \brief  18E8, Message Object  Interrupt Pointer Register */
#define CAN_MO71_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00198E8u)

