luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO74_EDATA1.
* To use register names with standard convension, please use CAN_MO74_EDATA1.
*/
#define	CAN_EMO74DATA1	(CAN_MO74_EDATA1)

/** \brief  1948, Message Object  Interrupt Pointer Register */
#define CAN_MO74_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019948u)

/** Alias (User Manual Name) for CAN_MO74_EDATA2.
* To use register names with standard convension, please use CAN_MO74_EDATA2.
*/
#define	CAN_EMO74DATA2	(CAN_MO74_EDATA2)

/** \brief  194C, Message Object  Acceptance Mask Register */
#define CAN_MO74_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001994Cu)

/** Alias (User Manual Name) for CAN_MO74_EDATA3.
* To use register names with standard convension, please use CAN_MO74_EDATA3.
*/
#define	CAN_EMO74DATA3	(CAN_MO74_EDATA3)

/** \brief  1950, Message Object  Data Register Low */
#define CAN_MO74_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019950u)

/** Alias (User Manual Name) for CAN_MO74_EDATA4.
* To use register names with standard convension, please use CAN_MO74_EDATA4.
*/
#define	CAN_EMO74DATA4	(CAN_MO74_EDATA4)

/** \brief  1954, Message Object  Data Register High */
#define CAN_MO74_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019954u)

/** Alias (User Manual Name) for CAN_MO74_EDATA5.
* To use register names with standard convension, please use CAN_MO74_EDATA5.
*/
#define	CAN_EMO74DATA5	(CAN_MO74_EDATA5)

/** \brief  1958, Message Object  Arbitration Register */
#define CAN_MO74_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019958u)

/** Alias (User Manual Name) for CAN_MO74_EDATA6.
* To use register names with standard convension, please use CAN_MO74_EDATA6.
*/
#define	CAN_EMO74DATA6	(CAN_MO74_EDATA6)

/** \brief  1940, Message Object  Function Control Register */
#define CAN_MO74_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019940u)

/** Alias (User Manual Name) for CAN_MO74_FCR.
* To use register names with standard convension, please use CAN_MO74_FCR.
*/
#define	CAN_MOFCR74	(CAN_MO74_FCR)

/** \brief  1944, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO74_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019944u)

/** Alias (User Manual Name) for CAN_MO74_FGPR.
* To use register names with standard convension, please use CAN_MO74_FGPR.
*/
#define	CAN_MOFGPR74	(CAN_MO74_FGPR)

/** \brief  1948, Message Object  Interrupt Pointer Register */
#define CAN_MO74_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019948u)

/** Alias (User Manual Name) for CAN_MO74_IPR.
* To use register names with standard convension, please use CAN_MO74_IPR.
*/
#define	CAN_MOIPR74	(CAN_MO74_IPR)

/** \brief  195C, Message Object  Control Register */
#define CAN_MO74_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001995Cu)

/** Alias (User Manual Name) for CAN_MO74_STAT.
* To use register names with standard convension, please use CAN_MO74_STAT.
*/
#define	CAN_MOSTAT74	(CAN_MO74_STAT)

/** \brief  196C, Message Object  Acceptance Mask Register */
#define CAN_MO75_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001996Cu)

/** Alias (User Manual Name) for CAN_MO75_AMR.
* To use register names with standard convension, please use CAN_MO75_AMR.
*/
#define	CAN_MOAMR75	(CAN_MO75_AMR)

/** \brief  1978, Message Object  Arbitration Register */
#define CAN_MO75_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019978u)

/** Alias (User Manual Name) for CAN_MO75_AR.
* To use register names with standard convension, please use CAN_MO75_AR.
*/
#define	CAN_MOAR75	(CAN_MO75_AR)

/** \brief  197C, Message Object  Control Register */
#define CAN_MO75_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001997Cu)

/** Alias (User Manual Name) for CAN_MO75_CTR.
* To use register names with standard convension, please use CAN_MO75_CTR.
*/
#define	CAN_MOCTR75	(CAN_MO75_CTR)

/** \brief  1974, Message Object  Data Register High */
#define CAN_MO75_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019974u)

/** Alias (User Manual Name) for CAN_MO75_DATAH.
* To use register names with standard convension, please use CAN_MO75_DATAH.
*/
#define	CAN_MODATAH75	(CAN_MO75_DATAH)

/** \brief  1970, Message Object  Data Register Low */
#define CAN_MO75_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019970u)

/** Alias (User Manual Name) for CAN_MO75_DATAL.
* To use register names with standard convension, please use CAN_MO75_DATAL.
*/
#define	CAN_MODATAL75	(CAN_MO75_DATAL)

/** \brief  1960, Message Object  Function Control Register */
#define CAN_MO75_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019960u)

/** Alias (User Manual Name) for CAN_MO75_EDATA0.
* To use register names with standard convension, please use CAN_MO75_EDATA0.
*/
#define	CAN_EMO75DATA0	(CAN_MO75_EDATA0)

/** \brief  1964, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO75_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019964u)

/** Alias (User Manual Name) for CAN_MO75_EDATA1.
* To use register names with standard convension, please use CAN_MO75_EDATA1.
*/
#define	CAN_EMO75DATA1	(CAN_MO75_EDATA1)

/** \brief  1968, Message Object  Interrupt Pointer Register */
#define CAN_MO75_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019968u)

/** Alias (User Manual Name) for CAN_MO75_EDATA2.
* To use register names with standard convension, please use CAN_MO75_EDATA2.
*/
#define	CAN_EMO75DATA2	(CAN_MO75_EDATA2)

/** \brief  196C, Message Object  Acceptance Mask Register */
#define CAN_MO75_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001996Cu)

/** Alias (User Manual Name) for CAN_MO75_EDATA3.
* To use register names with standard convension, please use CAN_MO75_EDATA3.
*/
#define	CAN_EMO75DATA3	(CAN_MO75_EDATA3)

/** \brief  1970, Message Object  Data Register Low */
#define CAN_MO75_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019970u)

/** Alias (User Manual Name) for CAN_MO75_EDATA4.
* To use register names with standard convension, please use CAN_MO75_EDATA4.
*/
#define	CAN_EMO75DATA4	(CAN_MO75_EDATA4)

/** \brief  1974, Message Object  Data Register High */
#define CAN_MO75_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019974u)

/** Alias (User Manual Name) for CAN_MO75_EDATA5.
* To use register names with standard convension, please use CAN_MO75_EDATA5.
*/
#define	CAN_EMO75DATA5	(CAN_MO75_EDATA5)

/** \brief  1978, Message Object  Arbitration Register */
#define CAN_MO75_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019978u)

