luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO78_EDATA1.
* To use register names with standard convension, please use CAN_MO78_EDATA1.
*/
#define	CAN_EMO78DATA1	(CAN_MO78_EDATA1)

/** \brief  19C8, Message Object  Interrupt Pointer Register */
#define CAN_MO78_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00199C8u)

/** Alias (User Manual Name) for CAN_MO78_EDATA2.
* To use register names with standard convension, please use CAN_MO78_EDATA2.
*/
#define	CAN_EMO78DATA2	(CAN_MO78_EDATA2)

/** \brief  19CC, Message Object  Acceptance Mask Register */
#define CAN_MO78_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00199CCu)

/** Alias (User Manual Name) for CAN_MO78_EDATA3.
* To use register names with standard convension, please use CAN_MO78_EDATA3.
*/
#define	CAN_EMO78DATA3	(CAN_MO78_EDATA3)

/** \brief  19D0, Message Object  Data Register Low */
#define CAN_MO78_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00199D0u)

/** Alias (User Manual Name) for CAN_MO78_EDATA4.
* To use register names with standard convension, please use CAN_MO78_EDATA4.
*/
#define	CAN_EMO78DATA4	(CAN_MO78_EDATA4)

/** \brief  19D4, Message Object  Data Register High */
#define CAN_MO78_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00199D4u)

/** Alias (User Manual Name) for CAN_MO78_EDATA5.
* To use register names with standard convension, please use CAN_MO78_EDATA5.
*/
#define	CAN_EMO78DATA5	(CAN_MO78_EDATA5)

/** \brief  19D8, Message Object  Arbitration Register */
#define CAN_MO78_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00199D8u)

/** Alias (User Manual Name) for CAN_MO78_EDATA6.
* To use register names with standard convension, please use CAN_MO78_EDATA6.
*/
#define	CAN_EMO78DATA6	(CAN_MO78_EDATA6)

/** \brief  19C0, Message Object  Function Control Register */
#define CAN_MO78_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00199C0u)

/** Alias (User Manual Name) for CAN_MO78_FCR.
* To use register names with standard convension, please use CAN_MO78_FCR.
*/
#define	CAN_MOFCR78	(CAN_MO78_FCR)

/** \brief  19C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO78_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00199C4u)

/** Alias (User Manual Name) for CAN_MO78_FGPR.
* To use register names with standard convension, please use CAN_MO78_FGPR.
*/
#define	CAN_MOFGPR78	(CAN_MO78_FGPR)

/** \brief  19C8, Message Object  Interrupt Pointer Register */
#define CAN_MO78_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00199C8u)

/** Alias (User Manual Name) for CAN_MO78_IPR.
* To use register names with standard convension, please use CAN_MO78_IPR.
*/
#define	CAN_MOIPR78	(CAN_MO78_IPR)

/** \brief  19DC, Message Object  Control Register */
#define CAN_MO78_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF00199DCu)

/** Alias (User Manual Name) for CAN_MO78_STAT.
* To use register names with standard convension, please use CAN_MO78_STAT.
*/
#define	CAN_MOSTAT78	(CAN_MO78_STAT)

/** \brief  19EC, Message Object  Acceptance Mask Register */
#define CAN_MO79_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00199ECu)

/** Alias (User Manual Name) for CAN_MO79_AMR.
* To use register names with standard convension, please use CAN_MO79_AMR.
*/
#define	CAN_MOAMR79	(CAN_MO79_AMR)

/** \brief  19F8, Message Object  Arbitration Register */
#define CAN_MO79_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00199F8u)

/** Alias (User Manual Name) for CAN_MO79_AR.
* To use register names with standard convension, please use CAN_MO79_AR.
*/
#define	CAN_MOAR79	(CAN_MO79_AR)

/** \brief  19FC, Message Object  Control Register */
#define CAN_MO79_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00199FCu)

/** Alias (User Manual Name) for CAN_MO79_CTR.
* To use register names with standard convension, please use CAN_MO79_CTR.
*/
#define	CAN_MOCTR79	(CAN_MO79_CTR)

/** \brief  19F4, Message Object  Data Register High */
#define CAN_MO79_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00199F4u)

/** Alias (User Manual Name) for CAN_MO79_DATAH.
* To use register names with standard convension, please use CAN_MO79_DATAH.
*/
#define	CAN_MODATAH79	(CAN_MO79_DATAH)

/** \brief  19F0, Message Object  Data Register Low */
#define CAN_MO79_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00199F0u)

/** Alias (User Manual Name) for CAN_MO79_DATAL.
* To use register names with standard convension, please use CAN_MO79_DATAL.
*/
#define	CAN_MODATAL79	(CAN_MO79_DATAL)

/** \brief  19E0, Message Object  Function Control Register */
#define CAN_MO79_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF00199E0u)

/** Alias (User Manual Name) for CAN_MO79_EDATA0.
* To use register names with standard convension, please use CAN_MO79_EDATA0.
*/
#define	CAN_EMO79DATA0	(CAN_MO79_EDATA0)

/** \brief  19E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO79_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF00199E4u)

/** Alias (User Manual Name) for CAN_MO79_EDATA1.
* To use register names with standard convension, please use CAN_MO79_EDATA1.
*/
#define	CAN_EMO79DATA1	(CAN_MO79_EDATA1)

/** \brief  19E8, Message Object  Interrupt Pointer Register */
#define CAN_MO79_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF00199E8u)

/** Alias (User Manual Name) for CAN_MO79_EDATA2.
* To use register names with standard convension, please use CAN_MO79_EDATA2.
*/
#define	CAN_EMO79DATA2	(CAN_MO79_EDATA2)

/** \brief  19EC, Message Object  Acceptance Mask Register */
#define CAN_MO79_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF00199ECu)

/** Alias (User Manual Name) for CAN_MO79_EDATA3.
* To use register names with standard convension, please use CAN_MO79_EDATA3.
*/
#define	CAN_EMO79DATA3	(CAN_MO79_EDATA3)

/** \brief  19F0, Message Object  Data Register Low */
#define CAN_MO79_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF00199F0u)

/** Alias (User Manual Name) for CAN_MO79_EDATA4.
* To use register names with standard convension, please use CAN_MO79_EDATA4.
*/
#define	CAN_EMO79DATA4	(CAN_MO79_EDATA4)

/** \brief  19F4, Message Object  Data Register High */
#define CAN_MO79_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF00199F4u)

/** Alias (User Manual Name) for CAN_MO79_EDATA5.
* To use register names with standard convension, please use CAN_MO79_EDATA5.
*/
#define	CAN_EMO79DATA5	(CAN_MO79_EDATA5)

/** \brief  19F8, Message Object  Arbitration Register */
#define CAN_MO79_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF00199F8u)

