luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  1AA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO85_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019AA4u)

/** Alias (User Manual Name) for CAN_MO85_EDATA1.
* To use register names with standard convension, please use CAN_MO85_EDATA1.
*/
#define	CAN_EMO85DATA1	(CAN_MO85_EDATA1)

/** \brief  1AA8, Message Object  Interrupt Pointer Register */
#define CAN_MO85_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019AA8u)

/** Alias (User Manual Name) for CAN_MO85_EDATA2.
* To use register names with standard convension, please use CAN_MO85_EDATA2.
*/
#define	CAN_EMO85DATA2	(CAN_MO85_EDATA2)

/** \brief  1AAC, Message Object  Acceptance Mask Register */
#define CAN_MO85_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019AACu)

/** Alias (User Manual Name) for CAN_MO85_EDATA3.
* To use register names with standard convension, please use CAN_MO85_EDATA3.
*/
#define	CAN_EMO85DATA3	(CAN_MO85_EDATA3)

/** \brief  1AB0, Message Object  Data Register Low */
#define CAN_MO85_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019AB0u)

/** Alias (User Manual Name) for CAN_MO85_EDATA4.
* To use register names with standard convension, please use CAN_MO85_EDATA4.
*/
#define	CAN_EMO85DATA4	(CAN_MO85_EDATA4)

/** \brief  1AB4, Message Object  Data Register High */
#define CAN_MO85_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019AB4u)

/** Alias (User Manual Name) for CAN_MO85_EDATA5.
* To use register names with standard convension, please use CAN_MO85_EDATA5.
*/
#define	CAN_EMO85DATA5	(CAN_MO85_EDATA5)

/** \brief  1AB8, Message Object  Arbitration Register */
#define CAN_MO85_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019AB8u)

/** Alias (User Manual Name) for CAN_MO85_EDATA6.
* To use register names with standard convension, please use CAN_MO85_EDATA6.
*/
#define	CAN_EMO85DATA6	(CAN_MO85_EDATA6)

/** \brief  1AA0, Message Object  Function Control Register */
#define CAN_MO85_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019AA0u)

/** Alias (User Manual Name) for CAN_MO85_FCR.
* To use register names with standard convension, please use CAN_MO85_FCR.
*/
#define	CAN_MOFCR85	(CAN_MO85_FCR)

/** \brief  1AA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO85_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019AA4u)

/** Alias (User Manual Name) for CAN_MO85_FGPR.
* To use register names with standard convension, please use CAN_MO85_FGPR.
*/
#define	CAN_MOFGPR85	(CAN_MO85_FGPR)

/** \brief  1AA8, Message Object  Interrupt Pointer Register */
#define CAN_MO85_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019AA8u)

/** Alias (User Manual Name) for CAN_MO85_IPR.
* To use register names with standard convension, please use CAN_MO85_IPR.
*/
#define	CAN_MOIPR85	(CAN_MO85_IPR)

/** \brief  1ABC, Message Object  Control Register */
#define CAN_MO85_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019ABCu)

/** Alias (User Manual Name) for CAN_MO85_STAT.
* To use register names with standard convension, please use CAN_MO85_STAT.
*/
#define	CAN_MOSTAT85	(CAN_MO85_STAT)

/** \brief  1ACC, Message Object  Acceptance Mask Register */
#define CAN_MO86_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019ACCu)

/** Alias (User Manual Name) for CAN_MO86_AMR.
* To use register names with standard convension, please use CAN_MO86_AMR.
*/
#define	CAN_MOAMR86	(CAN_MO86_AMR)

/** \brief  1AD8, Message Object  Arbitration Register */
#define CAN_MO86_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019AD8u)

/** Alias (User Manual Name) for CAN_MO86_AR.
* To use register names with standard convension, please use CAN_MO86_AR.
*/
#define	CAN_MOAR86	(CAN_MO86_AR)

/** \brief  1ADC, Message Object  Control Register */
#define CAN_MO86_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019ADCu)

/** Alias (User Manual Name) for CAN_MO86_CTR.
* To use register names with standard convension, please use CAN_MO86_CTR.
*/
#define	CAN_MOCTR86	(CAN_MO86_CTR)

/** \brief  1AD4, Message Object  Data Register High */
#define CAN_MO86_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019AD4u)

/** Alias (User Manual Name) for CAN_MO86_DATAH.
* To use register names with standard convension, please use CAN_MO86_DATAH.
*/
#define	CAN_MODATAH86	(CAN_MO86_DATAH)

/** \brief  1AD0, Message Object  Data Register Low */
#define CAN_MO86_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019AD0u)

/** Alias (User Manual Name) for CAN_MO86_DATAL.
* To use register names with standard convension, please use CAN_MO86_DATAL.
*/
#define	CAN_MODATAL86	(CAN_MO86_DATAL)

/** \brief  1AC0, Message Object  Function Control Register */
#define CAN_MO86_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019AC0u)

/** Alias (User Manual Name) for CAN_MO86_EDATA0.
* To use register names with standard convension, please use CAN_MO86_EDATA0.
*/
#define	CAN_EMO86DATA0	(CAN_MO86_EDATA0)

/** \brief  1AC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO86_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019AC4u)

/** Alias (User Manual Name) for CAN_MO86_EDATA1.
* To use register names with standard convension, please use CAN_MO86_EDATA1.
*/
#define	CAN_EMO86DATA1	(CAN_MO86_EDATA1)

/** \brief  1AC8, Message Object  Interrupt Pointer Register */
#define CAN_MO86_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019AC8u)

/** Alias (User Manual Name) for CAN_MO86_EDATA2.
* To use register names with standard convension, please use CAN_MO86_EDATA2.
*/
#define	CAN_EMO86DATA2	(CAN_MO86_EDATA2)

/** \brief  1ACC, Message Object  Acceptance Mask Register */
#define CAN_MO86_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019ACCu)

/** Alias (User Manual Name) for CAN_MO86_EDATA3.
* To use register names with standard convension, please use CAN_MO86_EDATA3.
*/
#define	CAN_EMO86DATA3	(CAN_MO86_EDATA3)

/** \brief  1AD0, Message Object  Data Register Low */
#define CAN_MO86_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019AD0u)

/** Alias (User Manual Name) for CAN_MO86_EDATA4.
* To use register names with standard convension, please use CAN_MO86_EDATA4.
*/
#define	CAN_EMO86DATA4	(CAN_MO86_EDATA4)

/** \brief  1AD4, Message Object  Data Register High */
#define CAN_MO86_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019AD4u)

/** Alias (User Manual Name) for CAN_MO86_EDATA5.
* To use register names with standard convension, please use CAN_MO86_EDATA5.
*/
#define	CAN_EMO86DATA5	(CAN_MO86_EDATA5)

