luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO89_EDATA3.
* To use register names with standard convension, please use CAN_MO89_EDATA3.
*/
#define	CAN_EMO89DATA3	(CAN_MO89_EDATA3)

/** \brief  1B30, Message Object  Data Register Low */
#define CAN_MO89_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019B30u)

/** Alias (User Manual Name) for CAN_MO89_EDATA4.
* To use register names with standard convension, please use CAN_MO89_EDATA4.
*/
#define	CAN_EMO89DATA4	(CAN_MO89_EDATA4)

/** \brief  1B34, Message Object  Data Register High */
#define CAN_MO89_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019B34u)

/** Alias (User Manual Name) for CAN_MO89_EDATA5.
* To use register names with standard convension, please use CAN_MO89_EDATA5.
*/
#define	CAN_EMO89DATA5	(CAN_MO89_EDATA5)

/** \brief  1B38, Message Object  Arbitration Register */
#define CAN_MO89_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019B38u)

/** Alias (User Manual Name) for CAN_MO89_EDATA6.
* To use register names with standard convension, please use CAN_MO89_EDATA6.
*/
#define	CAN_EMO89DATA6	(CAN_MO89_EDATA6)

/** \brief  1B20, Message Object  Function Control Register */
#define CAN_MO89_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019B20u)

/** Alias (User Manual Name) for CAN_MO89_FCR.
* To use register names with standard convension, please use CAN_MO89_FCR.
*/
#define	CAN_MOFCR89	(CAN_MO89_FCR)

/** \brief  1B24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO89_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019B24u)

/** Alias (User Manual Name) for CAN_MO89_FGPR.
* To use register names with standard convension, please use CAN_MO89_FGPR.
*/
#define	CAN_MOFGPR89	(CAN_MO89_FGPR)

/** \brief  1B28, Message Object  Interrupt Pointer Register */
#define CAN_MO89_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019B28u)

/** Alias (User Manual Name) for CAN_MO89_IPR.
* To use register names with standard convension, please use CAN_MO89_IPR.
*/
#define	CAN_MOIPR89	(CAN_MO89_IPR)

/** \brief  1B3C, Message Object  Control Register */
#define CAN_MO89_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019B3Cu)

/** Alias (User Manual Name) for CAN_MO89_STAT.
* To use register names with standard convension, please use CAN_MO89_STAT.
*/
#define	CAN_MOSTAT89	(CAN_MO89_STAT)

/** \brief  110C, Message Object  Acceptance Mask Register */
#define CAN_MO8_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001910Cu)

/** Alias (User Manual Name) for CAN_MO8_AMR.
* To use register names with standard convension, please use CAN_MO8_AMR.
*/
#define	CAN_MOAMR8	(CAN_MO8_AMR)

/** \brief  1118, Message Object  Arbitration Register */
#define CAN_MO8_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019118u)

/** Alias (User Manual Name) for CAN_MO8_AR.
* To use register names with standard convension, please use CAN_MO8_AR.
*/
#define	CAN_MOAR8	(CAN_MO8_AR)

/** \brief  111C, Message Object  Control Register */
#define CAN_MO8_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001911Cu)

/** Alias (User Manual Name) for CAN_MO8_CTR.
* To use register names with standard convension, please use CAN_MO8_CTR.
*/
#define	CAN_MOCTR8	(CAN_MO8_CTR)

/** \brief  1114, Message Object  Data Register High */
#define CAN_MO8_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019114u)

/** Alias (User Manual Name) for CAN_MO8_DATAH.
* To use register names with standard convension, please use CAN_MO8_DATAH.
*/
#define	CAN_MODATAH8	(CAN_MO8_DATAH)

/** \brief  1110, Message Object  Data Register Low */
#define CAN_MO8_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019110u)

/** Alias (User Manual Name) for CAN_MO8_DATAL.
* To use register names with standard convension, please use CAN_MO8_DATAL.
*/
#define	CAN_MODATAL8	(CAN_MO8_DATAL)

/** \brief  1100, Message Object  Function Control Register */
#define CAN_MO8_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019100u)

/** Alias (User Manual Name) for CAN_MO8_EDATA0.
* To use register names with standard convension, please use CAN_MO8_EDATA0.
*/
#define	CAN_EMO8DATA0	(CAN_MO8_EDATA0)

/** \brief  1104, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO8_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019104u)

/** Alias (User Manual Name) for CAN_MO8_EDATA1.
* To use register names with standard convension, please use CAN_MO8_EDATA1.
*/
#define	CAN_EMO8DATA1	(CAN_MO8_EDATA1)

/** \brief  1108, Message Object  Interrupt Pointer Register */
#define CAN_MO8_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019108u)

/** Alias (User Manual Name) for CAN_MO8_EDATA2.
* To use register names with standard convension, please use CAN_MO8_EDATA2.
*/
#define	CAN_EMO8DATA2	(CAN_MO8_EDATA2)

/** \brief  110C, Message Object  Acceptance Mask Register */
#define CAN_MO8_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF001910Cu)

/** Alias (User Manual Name) for CAN_MO8_EDATA3.
* To use register names with standard convension, please use CAN_MO8_EDATA3.
*/
#define	CAN_EMO8DATA3	(CAN_MO8_EDATA3)

/** \brief  1110, Message Object  Data Register Low */
#define CAN_MO8_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019110u)

/** Alias (User Manual Name) for CAN_MO8_EDATA4.
* To use register names with standard convension, please use CAN_MO8_EDATA4.
*/
#define	CAN_EMO8DATA4	(CAN_MO8_EDATA4)

/** \brief  1114, Message Object  Data Register High */
#define CAN_MO8_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019114u)

/** Alias (User Manual Name) for CAN_MO8_EDATA5.
* To use register names with standard convension, please use CAN_MO8_EDATA5.
*/
#define	CAN_EMO8DATA5	(CAN_MO8_EDATA5)

/** \brief  1118, Message Object  Arbitration Register */
#define CAN_MO8_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019118u)

/** Alias (User Manual Name) for CAN_MO8_EDATA6.
* To use register names with standard convension, please use CAN_MO8_EDATA6.
*/
#define	CAN_EMO8DATA6	(CAN_MO8_EDATA6)

/** \brief  1100, Message Object  Function Control Register */
#define CAN_MO8_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019100u)

/** Alias (User Manual Name) for CAN_MO8_FCR.
* To use register names with standard convension, please use CAN_MO8_FCR.
*/
#define	CAN_MOFCR8	(CAN_MO8_FCR)

