luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  1BB0, Message Object  Data Register Low */
#define CAN_MO93_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019BB0u)

/** Alias (User Manual Name) for CAN_MO93_EDATA4.
* To use register names with standard convension, please use CAN_MO93_EDATA4.
*/
#define	CAN_EMO93DATA4	(CAN_MO93_EDATA4)

/** \brief  1BB4, Message Object  Data Register High */
#define CAN_MO93_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019BB4u)

/** Alias (User Manual Name) for CAN_MO93_EDATA5.
* To use register names with standard convension, please use CAN_MO93_EDATA5.
*/
#define	CAN_EMO93DATA5	(CAN_MO93_EDATA5)

/** \brief  1BB8, Message Object  Arbitration Register */
#define CAN_MO93_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019BB8u)

/** Alias (User Manual Name) for CAN_MO93_EDATA6.
* To use register names with standard convension, please use CAN_MO93_EDATA6.
*/
#define	CAN_EMO93DATA6	(CAN_MO93_EDATA6)

/** \brief  1BA0, Message Object  Function Control Register */
#define CAN_MO93_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019BA0u)

/** Alias (User Manual Name) for CAN_MO93_FCR.
* To use register names with standard convension, please use CAN_MO93_FCR.
*/
#define	CAN_MOFCR93	(CAN_MO93_FCR)

/** \brief  1BA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO93_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019BA4u)

/** Alias (User Manual Name) for CAN_MO93_FGPR.
* To use register names with standard convension, please use CAN_MO93_FGPR.
*/
#define	CAN_MOFGPR93	(CAN_MO93_FGPR)

/** \brief  1BA8, Message Object  Interrupt Pointer Register */
#define CAN_MO93_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019BA8u)

/** Alias (User Manual Name) for CAN_MO93_IPR.
* To use register names with standard convension, please use CAN_MO93_IPR.
*/
#define	CAN_MOIPR93	(CAN_MO93_IPR)

/** \brief  1BBC, Message Object  Control Register */
#define CAN_MO93_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF0019BBCu)

/** Alias (User Manual Name) for CAN_MO93_STAT.
* To use register names with standard convension, please use CAN_MO93_STAT.
*/
#define	CAN_MOSTAT93	(CAN_MO93_STAT)

/** \brief  1BCC, Message Object  Acceptance Mask Register */
#define CAN_MO94_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0019BCCu)

/** Alias (User Manual Name) for CAN_MO94_AMR.
* To use register names with standard convension, please use CAN_MO94_AMR.
*/
#define	CAN_MOAMR94	(CAN_MO94_AMR)

/** \brief  1BD8, Message Object  Arbitration Register */
#define CAN_MO94_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019BD8u)

/** Alias (User Manual Name) for CAN_MO94_AR.
* To use register names with standard convension, please use CAN_MO94_AR.
*/
#define	CAN_MOAR94	(CAN_MO94_AR)

/** \brief  1BDC, Message Object  Control Register */
#define CAN_MO94_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF0019BDCu)

/** Alias (User Manual Name) for CAN_MO94_CTR.
* To use register names with standard convension, please use CAN_MO94_CTR.
*/
#define	CAN_MOCTR94	(CAN_MO94_CTR)

/** \brief  1BD4, Message Object  Data Register High */
#define CAN_MO94_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019BD4u)

/** Alias (User Manual Name) for CAN_MO94_DATAH.
* To use register names with standard convension, please use CAN_MO94_DATAH.
*/
#define	CAN_MODATAH94	(CAN_MO94_DATAH)

/** \brief  1BD0, Message Object  Data Register Low */
#define CAN_MO94_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019BD0u)

/** Alias (User Manual Name) for CAN_MO94_DATAL.
* To use register names with standard convension, please use CAN_MO94_DATAL.
*/
#define	CAN_MODATAL94	(CAN_MO94_DATAL)

/** \brief  1BC0, Message Object  Function Control Register */
#define CAN_MO94_EDATA0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA0*)0xF0019BC0u)

/** Alias (User Manual Name) for CAN_MO94_EDATA0.
* To use register names with standard convension, please use CAN_MO94_EDATA0.
*/
#define	CAN_EMO94DATA0	(CAN_MO94_EDATA0)

/** \brief  1BC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO94_EDATA1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA1*)0xF0019BC4u)

/** Alias (User Manual Name) for CAN_MO94_EDATA1.
* To use register names with standard convension, please use CAN_MO94_EDATA1.
*/
#define	CAN_EMO94DATA1	(CAN_MO94_EDATA1)

/** \brief  1BC8, Message Object  Interrupt Pointer Register */
#define CAN_MO94_EDATA2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA2*)0xF0019BC8u)

/** Alias (User Manual Name) for CAN_MO94_EDATA2.
* To use register names with standard convension, please use CAN_MO94_EDATA2.
*/
#define	CAN_EMO94DATA2	(CAN_MO94_EDATA2)

/** \brief  1BCC, Message Object  Acceptance Mask Register */
#define CAN_MO94_EDATA3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA3*)0xF0019BCCu)

/** Alias (User Manual Name) for CAN_MO94_EDATA3.
* To use register names with standard convension, please use CAN_MO94_EDATA3.
*/
#define	CAN_EMO94DATA3	(CAN_MO94_EDATA3)

/** \brief  1BD0, Message Object  Data Register Low */
#define CAN_MO94_EDATA4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA4*)0xF0019BD0u)

/** Alias (User Manual Name) for CAN_MO94_EDATA4.
* To use register names with standard convension, please use CAN_MO94_EDATA4.
*/
#define	CAN_EMO94DATA4	(CAN_MO94_EDATA4)

/** \brief  1BD4, Message Object  Data Register High */
#define CAN_MO94_EDATA5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA5*)0xF0019BD4u)

/** Alias (User Manual Name) for CAN_MO94_EDATA5.
* To use register names with standard convension, please use CAN_MO94_EDATA5.
*/
#define	CAN_EMO94DATA5	(CAN_MO94_EDATA5)

/** \brief  1BD8, Message Object  Arbitration Register */
#define CAN_MO94_EDATA6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_EDATA6*)0xF0019BD8u)

/** Alias (User Manual Name) for CAN_MO94_EDATA6.
* To use register names with standard convension, please use CAN_MO94_EDATA6.
*/
#define	CAN_EMO94DATA6	(CAN_MO94_EDATA6)

/** \brief  1BC0, Message Object  Function Control Register */
#define CAN_MO94_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019BC0u)

/** Alias (User Manual Name) for CAN_MO94_FCR.
* To use register names with standard convension, please use CAN_MO94_FCR.
*/
#define	CAN_MOFCR94	(CAN_MO94_FCR)

/** \brief  1BC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO94_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019BC4u)

/** Alias (User Manual Name) for CAN_MO94_FGPR.
* To use register names with standard convension, please use CAN_MO94_FGPR.
*/
#define	CAN_MOFGPR94	(CAN_MO94_FGPR)

