luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_reg.h
/** \brief  420, Node Timer Receive Timeout Register */
#define CAN_N2_TRTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TRTR*)0xF0018420u)

/** Alias (User Manual Name) for CAN_N2_TRTR.
* To use register names with standard convension, please use CAN_N2_TRTR.
*/
#define	CAN_NTRTR2	(CAN_N2_TRTR)

/** \brief  510, Node Bit Timing Register */
#define CAN_N3_BTEVR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_BTEVR*)0xF0018510u)

/** Alias (User Manual Name) for CAN_N3_BTEVR.
* To use register names with standard convension, please use CAN_N3_BTEVR.
*/
#define	CAN_NBTEVR3	(CAN_N3_BTEVR)

/** \brief  510, Node Bit Timing Register */
#define CAN_N3_BTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_BTR*)0xF0018510u)

/** Alias (User Manual Name) for CAN_N3_BTR.
* To use register names with standard convension, please use CAN_N3_BTR.
*/
#define	CAN_NBTR3	(CAN_N3_BTR)

/** \brief  500, Node Control Register */
#define CAN_N3_CR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CR*)0xF0018500u)

/** Alias (User Manual Name) for CAN_N3_CR.
* To use register names with standard convension, please use CAN_N3_CR.
*/
#define	CAN_NCR3	(CAN_N3_CR)

/** \brief  514, Node Error Counter Register */
#define CAN_N3_ECNT /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECNT*)0xF0018514u)

/** Alias (User Manual Name) for CAN_N3_ECNT.
* To use register names with standard convension, please use CAN_N3_ECNT.
*/
#define	CAN_NECNT3	(CAN_N3_ECNT)

/** \brief  538, Fast Node Bit Timing Register */
#define CAN_N3_FBTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_FBTR*)0xF0018538u)

/** Alias (User Manual Name) for CAN_N3_FBTR.
* To use register names with standard convension, please use CAN_N3_FBTR.
*/
#define	CAN_FNBTR3	(CAN_N3_FBTR)

/** \brief  518, Node Frame Counter Register */
#define CAN_N3_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_FCR*)0xF0018518u)

/** Alias (User Manual Name) for CAN_N3_FCR.
* To use register names with standard convension, please use CAN_N3_FCR.
*/
#define	CAN_NFCR3	(CAN_N3_FCR)

/** \brief  508, Node Interrupt Pointer Register */
#define CAN_N3_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IPR*)0xF0018508u)

/** Alias (User Manual Name) for CAN_N3_IPR.
* To use register names with standard convension, please use CAN_N3_IPR.
*/
#define	CAN_NIPR3	(CAN_N3_IPR)

/** \brief  50C, Node Port Control Register */
#define CAN_N3_PCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PCR*)0xF001850Cu)

/** Alias (User Manual Name) for CAN_N3_PCR.
* To use register names with standard convension, please use CAN_N3_PCR.
*/
#define	CAN_NPCR3	(CAN_N3_PCR)

/** \brief  504, Node Status Register */
#define CAN_N3_SR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_SR*)0xF0018504u)

/** Alias (User Manual Name) for CAN_N3_SR.
* To use register names with standard convension, please use CAN_N3_SR.
*/
#define	CAN_NSR3	(CAN_N3_SR)

/** \brief  524, Node Timer A Transmit Trigger Register */
#define CAN_N3_TATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0018524u)

/** Alias (User Manual Name) for CAN_N3_TATTR.
* To use register names with standard convension, please use CAN_N3_TATTR.
*/
#define	CAN_NTATTR3	(CAN_N3_TATTR)

/** \brief  528, Node Timer B Transmit Trigger Register */
#define CAN_N3_TBTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0018528u)

/** Alias (User Manual Name) for CAN_N3_TBTTR.
* To use register names with standard convension, please use CAN_N3_TBTTR.
*/
#define	CAN_NTBTTR3	(CAN_N3_TBTTR)

/** \brief  51C, Node Timer Clock Control Register */
#define CAN_N3_TCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TCCR*)0xF001851Cu)

/** Alias (User Manual Name) for CAN_N3_TCCR.
* To use register names with standard convension, please use CAN_N3_TCCR.
*/
#define	CAN_NTCCR3	(CAN_N3_TCCR)

/** \brief  52C, Node Timer C Transmit Trigger Register */
#define CAN_N3_TCTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF001852Cu)

/** Alias (User Manual Name) for CAN_N3_TCTTR.
* To use register names with standard convension, please use CAN_N3_TCTTR.
*/
#define	CAN_NTCTTR3	(CAN_N3_TCTTR)

/** \brief  53C, Node Transmitter Delay Compensation Register */
#define CAN_N3_TDCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TDCR*)0xF001853Cu)

/** Alias (User Manual Name) for CAN_N3_TDCR.
* To use register names with standard convension, please use CAN_N3_TDCR.
*/
#define	CAN_NTDCR3	(CAN_N3_TDCR)

/** \brief  520, Node Timer Receive Timeout Register */
#define CAN_N3_TRTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TRTR*)0xF0018520u)

/** Alias (User Manual Name) for CAN_N3_TRTR.
* To use register names with standard convension, please use CAN_N3_TRTR.
*/
#define	CAN_NTRTR3	(CAN_N3_TRTR)

/** \brief  E8, OCDS Control and Status */
#define CAN_OCS /*lint --e(923)*/ (*(volatile Ifx_CAN_OCS*)0xF00180E8u)

/** \brief  1C4, Panel Control Register */
#define CAN_PANCTR /*lint --e(923)*/ (*(volatile Ifx_CAN_PANCTR*)0xF00181C4u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCAN_REG_H */
